{"platform": "reddit", "post_id": "1pzacbq", "author": "sylsau", "handle": "sylsau", "created_utc": 1767074699.0, "text": "The Inevitable Sunset: Why Every Fiat Currency in History Has Failed and Why Bitcoin Is Different. The question is not if today's fiat currencies will collapse; history guarantees they will. The only question is when.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pzacbq/the_inevitable_sunset_why_every_fiat_currency_in/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pza67j", "author": "Emotional-Fig-4105", "handle": "Emotional-Fig-4105", "created_utc": 1767074173.0, "text": "Bitcoin Long-Term Holders Stop Sell Off as ETH Whales Accumulate", "lang": null, "likes": 2, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pza67j/bitcoin_longterm_holders_stop_sell_off_as_eth/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pz5hdj", "author": "Educational_Base_301", "handle": "Educational_Base_301", "created_utc": 1767060635.0, "text": "Is the next altcoin cycle mainly a liquidity story? Altcoin cycles are often explained through narratives and new tech, but liquidity seems to lead every major cycle. Bitcoin absorbs capital first, then risk rotates into altcoins once confidence builds. Curious how others here think about liquidity vs narratives for the next cycle.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pz5hdj/is_the_next_altcoin_cycle_mainly_a_liquidity_story/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pz21p2", "author": "CloudStrikes12", "handle": "CloudStrikes12", "created_utc": 1767051678.0, "text": "The Case for Bitcoin Into 2026 This is the bull case for Bitcoin into 2026.  \n  \nChristmas has repeatedly acted as a short-term bear trap, with reversals in January for the past four years.  \n  \nThe traditional 4-year cycle narrative is being challenged, particularly by the absence of three consecutive green yearly candles.  \n  \nBitcoin spot ETF outflows are steadily compressing toward zero, suggesting selling pressure is being exhausted.  \n  \nBitcoin has just printed its fifth golden cross. Historically, golden crosses have been followed by an average move of \\~61% to the upside.  \n  \nAt the same time, gold and equity markets are pushing to new highs while Bitcoin shows unusual relative weakness. Historically, this kind of decoupling has often preceded a reversal rather than confirming continued underperformance.  \n  \nMy view: the current environment is defined by extreme fear around BTC, while optimism dominates other asset classes. That divergence doesn’t guarantee new all-time highs, but it does create a compelling asymmetry.  \n  \nIf this reversal thesis plays out, Bitcoin strength tends to ripple outward. Historically, renewed BTC momentum restores risk appetite across crypto, which is where higher-beta plays and PBA assets like SPX6900 and NSDQ420 start to matter more on a longer horizon.  \n  \nImportant disclaimer:  \nThis is my personal opinion, not financial advice or a price guarantee. Markets are unpredictable, and the risk of loss always exists. I’m personally invested in crypto, so this scenario would benefit me.", "lang": null, "likes": 15, "replies": 7, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pz21p2/the_case_for_bitcoin_into_2026/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pytwc8", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1767032743.0, "text": "realizing a btc loss without changing your position sounds easy… here’s what’s actually going on let’s say you bought 1 bitcoin at $126k. price drops to $89k. on paper you’re down $37k, but that loss usually isn’t usable for taxes until you sell (most people aren’t on special mark-to-market setups).\n\nso you sell your 1 btc at $89k. now the loss is realized. then you buy 1 btc back right after. you end up holding the same amount of bitcoin again, but you’ve locked in a capital loss that might reduce your tax bill (depending on where you live). your cost basis also resets to the new buy price, and your holding period clock restarts.\n\nthis is basically tax loss harvesting. the key idea: your market exposure can stay similar, while your cost basis resets to the lower price.\n\nbut it’s not a cheat code.\n\nfirst, rules depend on your country. some places have rules that block the “sell and instantly rebuy” move (like 30-day matching / superficial loss style rules). in the us, people often say crypto isn’t covered by wash sale rules right now, but laws can change and your situation can be different.\n\nsecond, trading friction is real. two trades means fees, spread, and slippage. if the market is moving fast, you can get a worse fill and accidentally lose more than you planned.\n\nthird, losses only help if they offset gains or reduce taxable income in a useful way (and in some places there are caps, with carryforwards). otherwise you’re just creating paperwork.\n\nif you’re thinking about doing this, treat it like tax planning, not trading. also keep clean records, because it gets messy fast.\n\nanyone here actually done this with btc and had it work out cleanly?", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pytwc8/realizing_a_btc_loss_without_changing_your/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pyo9om", "author": "obolli", "handle": "obolli", "created_utc": 1767020072.0, "text": "The massive scalper has returned with another 250+ Million Short just a few days from his last trade, 100% Margin again, Currently down -1.9M I shared this massive scalper (insane, unsafe risk to reward ratio) whale the other day.  \nWent 250 Million Short, mostly Bitcoin, but also ETH and SOL.\n\nThey profited 3 Million that day, this trader rarely holds longer than a few hours, sometimes minutes.\n\n100% Margin Utilization. \n\nSHORT  \n\\-1,359.8819 BTC  \nEntry Price - $87,527.5000  \nPosition Value - $119,626,090.98  \nLeverage 10x, Cross\n\n\\-36,281.2993 ETH  \nEntry Price: $2,920.2100  \nPosition Value: $107,164,073.74  \nLeverage: 15x cross\n\n\\-348,215.71 SOL  \nAverage Entry: $123.3713  \nPosition Value: $43,042,943.91  \nLeverage: 20x cross", "lang": null, "likes": 11, "replies": 8, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pyo9om/the_massive_scalper_has_returned_with_another_250/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pygdou", "author": "Mission-Stomach-3751", "handle": "Mission-Stomach-3751", "created_utc": 1766994801.0, "text": "Eric Trump Pushes “Gold → Bitcoin Rotation” Narrative Again — Calls BTC the Greatest Asset He’s Ever Seen \n\nEric Trump is pushing the “gold → Bitcoin rotation” narrative again. He says more money will come out of gold and flow into BTC, calling Bitcoin “the greatest asset” he’s ever seen and framing it as a better version of gold for moving value.", "lang": null, "likes": 5, "replies": 44, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pygdou/eric_trump_pushes_gold_bitcoin_rotation_narrative/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pyg9x6", "author": "sylsau", "handle": "sylsau", "created_utc": 1766994421.0, "text": "Transaction Limbo is a Choice: How to Save Your Stuck Bitcoin with RBF and CPFP. Why low fees freeze your money, and how the \"Bribe\" (RBF) and the \"Package Deal\" (CPFP) can get you moving again immediately.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pyg9x6/transaction_limbo_is_a_choice_how_to_save_your/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1py65xk", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1766965066.0, "text": "bitcoin feels stuck ...cowen says it’s basically 2019 again analyst benjamin cowen just dropped some interesting perspective on why bitcoin's been kinda sluggish lately compared to stocks and gold. and honestly his 2019 comparison makes alot of sense when you think about it.\n\nbasically bitcoin seems way more sensitive to actual liquidity conditions to really pop off. not just people being optimistic about future rate cuts or whatever. stocks and gold? they're already rallying on expectations alone. but btc tends to respond more when the real money and liquidity conditions actually shift, then it catches up.\n\nwhat's really intresting tho is the sentiment part. remember past cycle tops? everyone and their mom was talking about crypto, retail was going crazy. this time around its been way more quiet. people aren't exactly hyped up which is unusual for a potential top. that changes things for how the next year or two might play out.\n\nthe four year cycle thing is still relevant according to cowen even tho alot of people say its dead. he's pointing to broader market cycles not just crypto specific stuff. with labor market issues and tight financial conditions we might see headwinds lasting into 2026 even if we get some short term pumps here and there.\n\nfor anyone holding alts and waiting for that magical rotation, he basically says dont hold your breath. the quick rotations people expect might not happen the way they did before.\n\nbottom line is this feels more like 2019 when things were slow and grinding rather than the explosive moves we saw in other cycles. patience might be the play here rather then trying to time every move.", "lang": null, "likes": 37, "replies": 35, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1py65xk/bitcoin_feels_stuck_cowen_says_its_basically_2019/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pxzx9c", "author": "OnChainSpecter", "handle": "OnChainSpecter", "created_utc": 1766949789.0, "text": "US spot ETF flows show a heavy red day — signal or just year-end noise? US spot ETF flow update for Dec 26, 2025 showed a sharp outflow day:\n\n• Bitcoin spot ETFs: -$275.9M\n• Ethereum spot ETFs: -$38.7M\n• Total net outflow: -$314.6M\n\nWhat caught my attention is scale. The BTC ETF outflow alone was roughly equivalent to a full week of newly mined BTC leaving ETFs in one session.\n\nEven if ETFs don’t dictate price, flows like this clearly impact short-term momentum and sentiment.\n\nHow are people reading this?\n\n• Simple year-end rebalancing / tax positioning?\n• Or an early sign of cooling institutional demand?", "lang": null, "likes": 0, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pxzx9c/us_spot_etf_flows_show_a_heavy_red_day_signal_or/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pxvqc3", "author": "Aldhyabi", "handle": "Aldhyabi", "created_utc": 1766939934.0, "text": "You need to act Now !! After 8 hours, the Asian market will open and it will be bloody. The reason is that trust is broken in the financial system, China stopped exporting silver. So, Monday will be bloody. It will start with the Asian market, then Western \n\nnews outlets and governments are not describing the issue because if they do, it will be worse. So, be prepared for what is coming. \n\n\nIf you hold meme coins, I think that is done. Everyone is now moving into hard assets. It could be Bitcoin, privacy coins, or other coins.\n\n\nYour opinions? What are you holding? The decision on what to hold is very difficult right now, but later you won't be able to trade, volatility will be extreme. You need to act now!\n\n\nCheck this Guy , He is explaining what is coming , Market Meltdown \n\nhttps://x.com/i/status/2004995822614671764", "lang": null, "likes": 0, "replies": 48, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pxvqc3/you_need_to_act_now/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pxsa9o", "author": "sylsau", "handle": "sylsau", "created_utc": 1766931164.0, "text": "The Bitcoin Bomb: How Putin Is Weaponizing Crypto to Legitimize Nuclear Occupation **The Newest Weapon in Modern Warfare: Weaponized Bitcoin.**  \n  \nOn Christmas Eve, Vladimir Putin floated a bizarre claim: that Washington proposed a joint US-Russia venture to use the occupied Zaporizhzhia Nuclear Power Plant (ZNPP) for cryptocurrency mining.  \n  \nWhile physically impractical given the plant's fragile state, dismissing this as mere propaganda is a mistake. This is a calculated diplomatic maneuver—a \"sovereignty trap\" designed specifically for the incoming US administration.  \n  \nBy dressing continued occupation in the guise of a modern financial deal, Russia is attempting to:  \n\\* Shift the negotiation from demilitarization to commercialization.  \n\\* Legitimize their seizure of Ukraine's industrial infrastructure through \"joint control.\"  \n\\* Drive a wedge between Kyiv and Washington ahead of critical peace framework talks.  \n  \nThis is not an energy deal. It is an attempt to establish a precedent where aggressor states can monetize captured sovereign assets through decentralized finance.  \n  \nMy latest article dives deep into the timing, the reality on the ground at ZNPP, and the high stakes of this geopolitical bluff.", "lang": null, "likes": 0, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pxsa9o/the_bitcoin_bomb_how_putin_is_weaponizing_crypto/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pxnrdo", "author": "Mission-Stomach-3751", "handle": "Mission-Stomach-3751", "created_utc": 1766915909.0, "text": "Market Discussion: ETH Staking and Institutional Treasury Strategy On-chain data suggests that large Ethereum holders are beginning to incorporate staking into their treasury strategy.\n\nFrom a market perspective, this introduces an additional dynamic for ETH: supply locked for staking, yield expectations, and longer holding horizons. Unlike Bitcoin, which relies solely on price appreciation, Ethereum allows capital to be both held and productive.\n\nThis post isn’t about short-term price action, but about how staking could influence liquidity, supply dynamics, and institutional behavior over time.\n\nHow do you think this affects ETH’s market structure relative to BTC?", "lang": null, "likes": 5, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pxnrdo/market_discussion_eth_staking_and_institutional/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pxjs2b", "author": "sylsau", "handle": "sylsau", "created_utc": 1766901233.0, "text": "Borrow vs. Sell Bitcoin: How the Rich Never Pay Capital Gains Tax. Keep your coins. Get your cash. Screw the taxes. Selling your Bitcoin is a poverty mindset.  \n  \nThe ultra-wealthy almost never sell their prime assets. Elon doesn't sell Tesla stock to buy a house; he borrows against it.  \n  \nWhy?  \n  \nSelling triggers an immediate tax event (giving away \\~25% of your wealth).  \n  \nSelling kills future upside (opportunity cost).  \n  \nIf you need cash, don't chop down your money tree. Use a ladder to pick the fruit.  \n  \nHere is the complete guide to the \"Buy, Borrow, Die\" strategy, adapted for Bitcoin in 2026. 👇  \n  \n[**https://inbitcoinwetrust.substack.com/p/borrow-vs-sell-bitcoin-how-the-rich**](https://inbitcoinwetrust.substack.com/p/borrow-vs-sell-bitcoin-how-the-rich)", "lang": null, "likes": 0, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pxjs2b/borrow_vs_sell_bitcoin_how_the_rich_never_pay/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pxexsg", "author": "Duccatti", "handle": "Duccatti", "created_utc": 1766886685.0, "text": "New to Crypto in Payments Hey guys,\n\nI have been using Crypto to buy things online, in especial to avoid international fees or bad exchange rates in my credit card. However, the gas fees are killing me when the person doesn't have the account in the same centralized platform. Can anyone help me with how to send crypto to other ppl with the lowest fee possible? I know the majority of the cryptowallets accept Bitcoin and Bitcoin gas fees are insane bc I had to pay like 10$ or less some times", "lang": null, "likes": 4, "replies": 7, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pxexsg/new_to_crypto_in_payments/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1px6dzt", "author": "Aldhyabi", "handle": "Aldhyabi", "created_utc": 1766863931.0, "text": "December Is the End ( 4 days left ) You still didn't get what is happening right now. It's the end for hype, noise, hyped shitcoins, etc. \n\nIt means 99% are going to zero. We all agree that the current market is gambling, and most people here are gamblers. Paid influencers are less heard from. \n\n\nCryptocurrency valuation was driven by memes, celebrity endorsements, VC-backed narratives, and speculation, utility or limitation is ignored. \n\n \n\nThe fact: The Upcoming Web4 Interface, \nThe world's web interface is slowly going to be powered and run by AI. This new interface is tasked to have logic and filter out all hype and noise. \n\n\nWhat is happening now? AI ended the hype. Everyone is now an expert and can get the right information when needed. \n\n\n\nFor example, when asked what the best payment cryptocurrency, Gemini 3 ignored Bitcoin and other well-known cryptocurrencies. AI is now changing how everything is viewed. This will have a big impact on the next generation. Hype experts and paid influencers will be filtered out. AI now rewards technologies that logically solve problems, rather than those that generate the most noise. \n\nhttps://gemini.google.com/share/ca81dccb73e2\n\n\nThe New Year will be a new beginning, exposing what is next. New Candle , I think it will Be Red for most coins , because most are scams\n\nLike Akon saying ,\nI'm tryna be strong\nBut the strength I have is washin' away\nRight now Na Na Na", "lang": null, "likes": 0, "replies": 12, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1px6dzt/december_is_the_end_4_days_left/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1px3opu", "author": "Mr_Wx", "handle": "Mr_Wx", "created_utc": 1766857334.0, "text": "Is Solana (SOL) worth investing in? Key considerations and short vs long-term views Hey everyone!\n\nI’ve been investing in Bitcoin and Ethereum over the past year, and during this time I’ve been hearing a lot of positive things about Solana. I’m currently researching it and considering adding SOL to my portfolio, but before doing anything I’d love to hear some opinions from people with more experience.\n\nWhat do you think are the most important things to understand or keep in mind before investing in SOL?\n\nHow do you see Solana’s near-term outlook versus its long-term potential?\n\nAlso, the app I use (Trade Republic) offers around 6.94% staking on SOL. Is that worth it compared to other options or risks?\n\nHow you personally evaluate Solana compared to other cryptocurrencies? Any insights, personal experiences, or things you wish you had known earlier would be very appreciated.\n\nThanks in advance.", "lang": null, "likes": 46, "replies": 58, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1px3opu/is_solana_sol_worth_investing_in_key/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1px2nr5", "author": "Mission-Stomach-3751", "handle": "Mission-Stomach-3751", "created_utc": 1766854840.0, "text": "Is a New Crypto Macro Cycle Really Possible? Curious About BTC $200k &amp; ETH Long-Term Predictions There’s been a lot of discussion lately about whether we could actually see another major crypto macro cycle.\n\nSome analysts are talking about the possibility of Bitcoin reaching extremely high levels over the next few years and Ethereum following with strong upside potential as well.\n\nPersonally, I think these predictions sound bold, but I also understand that things like ETF inflows, macro liquidity, institutional adoption, and overall market sentiment can have a huge impact.\n\nWhat do you guys honestly think?\nAre these kinds of predictions even realistic, or just pure hopium?\nIf it *is* possible, what catalysts would realistically need to happen?\n\nInterested to hear different perspectives and macro-based opinions.\n\n(Not financial advice)", "lang": null, "likes": 3, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1px2nr5/is_a_new_crypto_macro_cycle_really_possible/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pwzifa", "author": "OnChainSpecter", "handle": "OnChainSpecter", "created_utc": 1766846847.0, "text": "Tom Lee shares long-term outlook on Bitcoin and Ethereum valuations Fundstrat’s Tom Lee recently outlined a bullish long-term outlook for crypto, projecting:\n\t•\tBitcoin potentially reaching ~$200,000 by 2026\n\t•\tEthereum around ~$9,000 in early 2026\n\t•\tHigher ETH valuations over the long run\n\nHis view is largely based on liquidity cycles, institutional adoption, and historical post-halving behavior rather than short-term price action.\n\nWhether or not these levels are reached, it raises an interesting discussion around how much upside is already priced in versus how much depends on macro conditions like rates, ETF flows, and global liquidity.\n\nHow do you personally view long-term crypto projections like these — useful frameworks, or mostly narrative-driven?", "lang": null, "likes": 0, "replies": 32, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pwzifa/tom_lee_shares_longterm_outlook_on_bitcoin_and/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pwyjj7", "author": "Mission-Stomach-3751", "handle": "Mission-Stomach-3751", "created_utc": 1766844168.0, "text": "Market Implications of State-Level Bitcoin Mining Discussions Unconfirmed reports suggest discussions between major powers about Bitcoin mining tied to large energy infrastructure.\n\nEven as a hypothetical, state-backed mining raises important market questions: hash rate distribution, energy costs, regulatory influence, and long-term incentives.\n\nThis post is not about confirming the news, but about discussing how such developments—if they materialize—could impact Bitcoin’s market structure.\n\nInterested in hearing market-focused", "lang": null, "likes": 0, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pwyjj7/market_implications_of_statelevel_bitcoin_mining/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pwtz2q", "author": "sylsau", "handle": "sylsau", "created_utc": 1766828409.0, "text": "Bitcoin price news: BTC stumbles as gold, silver and copper soar to new records Friday", "lang": null, "likes": 1, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pwtz2q/bitcoin_price_news_btc_stumbles_as_gold_silver/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pwtxqj", "author": "sylsau", "handle": "sylsau", "created_utc": 1766828263.0, "text": "The $126,000 Mirage: Unmasking Bitcoin's Greatest Optical Illusion.", "lang": null, "likes": 0, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pwtxqj/the_126000_mirage_unmasking_bitcoins_greatest/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pwc6u1", "author": "ImportantSlip5005", "handle": "ImportantSlip5005", "created_utc": 1766776066.0, "text": "Despite recent Bitcoin volatility, on-chain metrics indicate less sell pressure. Recent Bitcoin price volatility has raised concerns about short-term direction, but several on-chain indicators suggest sell pressure may be moderating rather than accelerating.\n\nAccording to publicly available data from [Glassnode](https://whop.com/kingcapsports/fullaccesscheckout?a=rs11bc) and Crypto Quant:\n\n* **Exchange net flows** have remained neutral to slightly negative over the past few weeks, indicating fewer coins moving to exchanges for immediate selling.\n* **Long-term holder supply** continues to trend upward, which historically correlates with accumulation phases rather than distribution.\n* **Realized profit/loss ratios** show profits being taken at lower intensity compared to previous local tops.\n\nAt the same time, derivatives data shows funding rates returning closer to neutral, suggesting leverage is cooling off after recent price swings.\n\nThis doesn’t imply a guaranteed upside move, but it may indicate that the current volatility is driven more by short-term traders than broad market distribution.\n\n**Sources:**\n\n* Glassnode – Exchange Net Position Change\n* CryptoQuant – LTH Supply &amp; Realized P/L Metrics\n* Coinglass – Funding Rate Aggregates\n\nCurious how others are interpreting the on-chain vs derivatives data right now.", "lang": null, "likes": 12, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pwc6u1/despite_recent_bitcoin_volatility_onchain_metrics/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pw7zi0", "author": "Lillianhocker", "handle": "Lillianhocker", "created_utc": 1766765707.0, "text": "If Bitcoin revisits $80k before the next halving cycle, would you see it as a buying opportunity or a warning sign? Why?", "lang": null, "likes": 0, "replies": 43, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pw7zi0/if_bitcoin_revisits_80k_before_the_next_halving/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pw304h", "author": "OnChainSpecter", "handle": "OnChainSpecter", "created_utc": 1766751525.0, "text": "Equities Keep Pushing Higher While Bitcoin Waits for a Macro Trigger Even with a shortened holiday session, the S&amp;P 500 managed to print another all-time high.\n\nTraditional risk assets still look firm, suggesting confidence hasn’t faded yet.\n\nBitcoin, on the other hand, continues to consolidate. No panic, no breakout — just sideways price action.\n\nWe’ve seen this before: equities often react first, while BTC tends to move once a clearer macro or liquidity trigger appears.\n\nFeels less like weakness and more like patience", "lang": null, "likes": 2, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pw304h/equities_keep_pushing_higher_while_bitcoin_waits/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pw0z21", "author": "sylsau", "handle": "sylsau", "created_utc": 1766743876.0, "text": "The Great Reflation: Why 2026 Could Be Bitcoin’s 2020 Sequel **The bottom line:** If the printing press fires up to save the nominal economy, Bitcoin doesn't just survive; it reigns.", "lang": null, "likes": 1, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pw0z21/the_great_reflation_why_2026_could_be_bitcoins/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pvzm1y", "author": "sylsau", "handle": "sylsau", "created_utc": 1766738409.0, "text": "Your First Programmable Bitcoin Wallet: A Step-by-Step Guide to Building a \"Dead Man's Switch\" with Liana. Automate Your Legacy: A Hands-On Guide to Building a Trustless Recovery Plan Without Writing Code.", "lang": null, "likes": 2, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pvzm1y/your_first_programmable_bitcoin_wallet_a/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pvsmnd", "author": "Superb_Conclusion603", "handle": "Superb_Conclusion603", "created_utc": 1766714254.0, "text": "Long-term crypto portfolio besides BTC &amp; ETH I’m planning a long-term crypto investment strategy with a multi-year horizon.\nBitcoin (BTC) and Ethereum (ETH) will be the core holdings of my portfolio.\nBesides those two, I’m looking to add around 8 additional cryptocurrencies that have strong fundamentals, real-world use cases, active development, and a realistic chance to stay relevant long term (5–10 years) and deliver long-term returns.\nI’m intentionally avoiding hype-driven or meme coins, since my focus is on sustainability, utility, and long-term value creation, rather than short-term speculation.\nWhich projects would you personally consider suitable for this type of long-term portfolio, and why?\nThanks in advance for your insights.", "lang": null, "likes": 83, "replies": 196, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pvsmnd/longterm_crypto_portfolio_besides_btc_eth/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pvl0tf", "author": "Mission-Stomach-3751", "handle": "Mission-Stomach-3751", "created_utc": 1766691522.0, "text": "Trump Media moved ~$174M worth of Bitcoin - on-chain data suggests it wasn't a sell \n\nTrump Media Moves $174M in Bitcoin — And It Wasn’t a Sell\n\nTrump Media shifted around 2,000 BTC worth roughly $174M across multiple wallets shortly after increasing its total holdings. Part of the transfer went to Coinbase Prime Custody, with the rest staying in wallets tied to the same entity.\n\nThis looks like reserve management, not distribution. Custody transfers are common after fresh purchases, especially for institutions organizing cold storage or consolidating wallets.\n\nBitcoin’s price didn’t react and stayed stable around $86K–$87K, which supports the idea this wasn’t a market-moving event.\n\nThe bigger signal is that Trump Media is actively managing its BTC position, not just holding it passively.", "lang": null, "likes": 35, "replies": 11, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pvl0tf/trump_media_moved_174m_worth_of_bitcoin_onchain/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pvdlgr", "author": "sylsau", "handle": "sylsau", "created_utc": 1766669998.0, "text": "The Silent Guardian: How Bitcoin Time-Locking Solves the Self-Custody Dilemma. Stop Fearing Lost Keys: How the \"Dead Man's Switch\" Transforms Bitcoin into Programmable Armor.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pvdlgr/the_silent_guardian_how_bitcoin_timelocking/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1puw1we", "author": "Aldhyabi", "handle": "Aldhyabi", "created_utc": 1766606618.0, "text": "The Next narrative is here ... When thinking about next Narrative , always check what are the major events coming or happening right now \n\n- Silver and Gold going crazy\n- New FED chairman \n- EU and US conflicts\n- XMoney \n- AI and Money \n\n\nSilver and gold are rising like a meme , Big dogs are watching and changing their mind with new strategies .\n\nFED and Trump \n\nRemember, Crypto is highly correlated with FED\n\n\nThe world trusts USD. The world trusts Jerome Powell. \n\nI cannot get better conclusion but the Trust with USD as strong currency will be /already broken  \n\n\nDollar Debasement , Many alerts ( Caused by Silver and Gold ) flashing in big institutions , to rethink about their strategies\n\n\nXMoney will push that further , Companies trying to get what elon going next to compete with him\n\n\n\nBitcoin cannot work like money, Many issues happening. In the last meeting, the SEC was clearly against custodial wallets. \n\n\nZEC is currently hyped, but can ZEC be scalable? I don't think it's built for scalability. \n\n\nAI and protocol 402 have a discovery layer for the lowest cost, and also in 402 v2. \n\n\nStablecoin hype vanished. \n\nMeme hype, NFT, DeFi... all gone. \n\nXmoney is coming with a new narrative: P2P payment. Remember why meme coins hyped? The next narrative is clearly the most scalable P2P payment money, \n\nCompanies will clone Elon Business Model and make it better\n\nBased on all above , I think p2p payment cryptocurrency is the next Narrative", "lang": null, "likes": 3, "replies": 18, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1puw1we/the_next_narrative_is_here/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1puu94x", "author": "Legitimate_Towel_919", "handle": "Legitimate_Towel_919", "created_utc": 1766601673.0, "text": "24B BTC Options Expiry Could Be the Catalyst the Market Has Been Waiting For Bitcoin may finally be setting up for the move traders have been watching for weeks. On December 26, the largest BTC options expiration in history is coming due, nearly $24 billion worth of contracts rolling off at once. For a while now, price has felt pinned, moving inside the 85 90k range as if something was holding it in place.\n\nThis kind of compression often happens ahead of major derivatives events. Volatility dries up, price action looks unnatural, and the market feels oddly quiet. But once that pressure is released, the structure tends to shift fast. With max pain sitting closer to the 95k area, it’s not surprising that many are eyeing higher levels once the expiry is out of the way.\n\nHistorically, the Christmas period has a habit of delivering sharp moves, often in the 5–7 percent range, driven more by positioning and derivatives flows than by headlines. Right now, a portion of capital is sitting in equities and precious metals, but any meaningful pullback there could trigger rotation back into Bitcoin and Ethereum.\n\nThese moves rarely happen when the crowd is confident. More often, they start when patience is wearing thin and expectations are low. That’s usually when the market decides to surprise everyone.\n\nfeels like the calm before the storm tbh… anyone else feeling this quiet is kinda creepy?", "lang": null, "likes": 38, "replies": 18, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1puu94x/24b_btc_options_expiry_could_be_the_catalyst_the/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1puo0uc", "author": "Mission-Stomach-3751", "handle": "Mission-Stomach-3751", "created_utc": 1766584812.0, "text": "People who bought BTC before 2020 and held was it worth the stress? I've been following Bitcoin for years and sometimes I wonder if holding long-term actually improves your mental health... or destroys it.\n\nFor those who held through multiple cycles, how did it really feel?", "lang": null, "likes": 49, "replies": 64, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1puo0uc/people_who_bought_btc_before_2020_and_held_was_it/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1punrtt", "author": "Mission-Stomach-3751", "handle": "Mission-Stomach-3751", "created_utc": 1766584079.0, "text": "Bitcoin’s Recent Range Explained by Options Market Structure Bitcoin spending much of December trading in a narrow range between $85k and $90k hasn’t necessarily been a sign of weakness or strong conviction in either direction.\n\nOne structural factor often overlooked is options market positioning. A large concentration of open interest around current price levels can create strong gamma effects. Dealers managing these positions are incentivized to hedge dynamically — buying into dips and selling into rallies — in order to remain neutral.\n\nThis hedging behavior can mechanically compress price action, reduce realized volatility, and keep spot price range-bound, even when broader macro assets move decisively.\n\nWith a significant portion of bitcoin options open interest approaching expiry, this gamma influence naturally decays. As those positions roll off, the mechanical pressure that constrained price action may weaken, allowing price to move more freely.\n\nThis is not a directional prediction, but an explanation of market structure dynamics that can temporarily suppress volatility.\n\nNot financial advice. Educational discussion only.", "lang": null, "likes": 9, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1punrtt/bitcoins_recent_range_explained_by_options_market/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pul2bb", "author": "sylsau", "handle": "sylsau", "created_utc": 1766574879.0, "text": "The Bitcoin Coup: Why Michael Saylor Is Meeting with the World's Biggest Banks.", "lang": null, "likes": 4, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pul2bb/the_bitcoin_coup_why_michael_saylor_is_meeting/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ptt94b", "author": "sylsau", "handle": "sylsau", "created_utc": 1766494543.0, "text": "The Ghost Protocols: PayNyms, Silent Payments, and the End of Address Reuse for your Bitcoin Txs.", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ptt94b/the_ghost_protocols_paynyms_silent_payments_and/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ptqhad", "author": "IntrepidWolverine517", "handle": "IntrepidWolverine517", "created_utc": 1766484979.0, "text": "British companies lose £80m after piling into Bitcoin Just more than half the losses have been felt by the Smarter Web Company, a Guildford-based web design business that jumped into cryptocurrency earlier this year and floated on the Aquis Stock Exchange.\n\nThe company was valued at £4m in April but its market capitalisation soared to £1.1bn in June – making the company worth more than Pets at Home, WH Smith and Wetherspoons.\n\nShares have now fallen by more than 90pc since their peak, although they still remain 14 times higher than when the company listed.\n\nAndrew Webley, its chief executive, said that “a lot of people had jumped on the bandwagon” and the company was going to “keep buying Bitcoin for many years”.", "lang": null, "likes": 23, "replies": 11, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ptqhad/british_companies_lose_80m_after_piling_into/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ptq335", "author": "341_bander", "handle": "341_bander", "created_utc": 1766483441.0, "text": "Why Markets Are Favoring Gold and Copper Over Bitcoin in 2025 : This year’s price action sends a consistent signal. Investors are leaning toward assets they can physically hold, store, and depend on as confidence in financial systems erodes or as growth requires real-world build-out.\nGold has rallied amid rising concern over fiscal discipline, currency dilution, and geopolitical risk. Copper has advanced alongside the AI expansion, electrification, and global infrastructure investment. Both embody tangibility at a time when trust in abstractions is being tested.\nBitcoin, despite its framing as both digital gold and frontier technology, has failed to absorb either flow. ETF approval and regulatory clarity are largely absorbed, while sovereign buyers continue to default to gold as their primary hedge.\nThis gap does not imply fading relevance. Historically, gold often moves first during monetary strain, with Bitcoin responding later , and typically with sharper moves.\nThe market is not dismissing crypto.\nIt is asking for evidence, endurance, and the right moment.", "lang": null, "likes": 29, "replies": 46, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ptq335/why_markets_are_favoring_gold_and_copper_over/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ptiwfh", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1766458796.0, "text": "Cointelegraph’s X account posted this stat: “There are only 1,035,659.4 BTC left to mine.” It’s a real snapshot estimate (as of that post), but it’s easy to read it like “we’re almost out of Bitcoin” and that’s not really what it means. bitcoin’s max supply is 21 million. “left to mine” is just 21m minus what’s already been created through block rewards. that number ticks down a little with each new block, so it’s always moving.\n\nand the decimals are normal. btc is divisible, and block rewards aren’t whole numbers anymore, so you’ll see supply figures like this.\n\nalso, “left to mine” isn’t the same thing as \"\"left to buy.” a lot of btc is held long term and doesn’t trade much. plus some btc is effectively gone forever because keys got lost or storage got thrown away. so the liquid supply (the stuff actually moving and available) can be way smaller than the total supply chart.\n\nat today’s block reward of 3.125 btc, miners create roughly 450 btc per day (give or take). but that pace slows over time because of halvings. every few years the new supply gets cut in half again, which is why mining doesn’t finish soon. most of the remaining coins come out earlier, then the last stretch takes decades, reaching out to around 2140.\n\none more practical angle: people use stats like this as a reason to trade more around halvings and “scarcity narratives.” which is fine, but it can turn your transaction history into a mess fast. if you’re doing a lot of rotating, it helps to keep cost basis clean while you go, not months later. that’s basically what tools like awaken tax are for, just making sure you can reconcile everything without guessing at tax time\n\nso the real takeaway isn’t “only 1.0m left.” it’s that new supply keeps shrinking, and price ends up being more about demand and holder behavior than miner issuance.", "lang": null, "likes": 4, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ptiwfh/cointelegraphs_x_account_posted_this_stat_there/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ptil8f", "author": "hodorrny", "handle": "hodorrny", "created_utc": 1766457877.0, "text": "Tokenized US Treasuries just exploded since early 2024...now roughly a ~$9 billion market as institutions pile into onchain yield This is one of those quiet revolutions happening in crypto that most people arent paying attention to. Tokenized US Treasury products have surged since early 2024 and are now roughly an ~$9 billion market depending on the tracker you look at. Some datasets frame it as a ~50x move from a very small base, while broader trackers show it was already closer to the ~$1B range in early 2024, so the multiple depends on what’s included. Either way, the direction is the same: big growth in a short time.\n\nBlackRock's BUIDL fund is leading the pack at around ~$1.7B in assets. Its basically short-term US government bonds that you can hold and settle onchain with daily yield. Other big players include Circle's USYC, Superstate's USTB and Ondo Finance's OUSG. All of them offering tokenized access to government debt through regulated structures.\n\nThe reason this matters is because US Treasury bills are perfect for bringing traditional finance onto blockchain. You get the safety of government backing combined with blockchain settlement efficiency. Plus institutions can use these as collateral for other activities which improves capital efficiency.\n\nMajor banks are already testing this stuff. DBS which is Southeast Asia's largest bank has piloted tokenized products and talked about using tokenized assets in institutional workflows like collateral management. This isnt some DeFi experiment anymore, its actual institutional infrastructure being built.\n\nThe timing makes sense too. With interest rates being higher than they've been in years, these products are offering decent yield compared to just holding stablecoins. And institutions get all the benefits of blockchain settlement without taking on crypto market risk.\n\nAnd as more portfolios hold yield-bearing assets on-chain...often across multiple wallets, chains, and structures...the operational side starts to matter too. Tracking yield, redemptions, and tax treatment across these instruments is where tools like Awaken Tax quietly become relevant, especially for funds and active investors managing both crypto-native and tokenized TradFi exposure.\n\nThis is basically tradfi and crypto merging in real time. When you see billions flowing into tokenized treasuries while the broader crypto market is struggling, it shows theres serious institutional demand for blockchain infrastructure even if they're not buying Bitcoin or ETH directly. Worth watching how this space develops in 2026.", "lang": null, "likes": 6, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ptil8f/tokenized_us_treasuries_just_exploded_since_early/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pthcvx", "author": "Crypto-Voice-Pro", "handle": "Crypto-Voice-Pro", "created_utc": 1766454336.0, "text": "Everyone’s Waiting on Bitcoin — What Happens Next? Bitcoin has been moving sideways around $88k for a while now.\nSupport seems to be near $85k, with resistance around $93k.        \n  \nI’m seeing mixed opinions, some people expect $133k next year, others think a pullback to $75k is more likely.\n\nWith holiday volume being low, it feels like a bigger move is coming.\nWhat’s your take, breakout or breakdown?", "lang": null, "likes": 85, "replies": 106, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pthcvx/everyones_waiting_on_bitcoin_what_happens_next/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pt3nsj", "author": "Lillianhocker", "handle": "Lillianhocker", "created_utc": 1766420373.0, "text": "\"If Bitcoin breaks above $94k, I think it could surge to $100k fast. But if it falls under $88k or $84k, it might drop toward $78k. What do you all think of these levels?\"", "lang": null, "likes": 0, "replies": 9, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pt3nsj/if_bitcoin_breaks_above_94k_i_think_it_could/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pt0ok0", "author": "More-Management-3940", "handle": "More-Management-3940", "created_utc": 1766413126.0, "text": "Bitcoin beginner", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pt0ok0/bitcoin_beginner/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pt0n24", "author": "sylsau", "handle": "sylsau", "created_utc": 1766413009.0, "text": "The 2026 Bitcoin Node Guide: Running Your Own Bank for Under $200. Stop asking permission to see your own wealth. Seize total financial control in an afternoon.", "lang": null, "likes": 1, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pt0n24/the_2026_bitcoin_node_guide_running_your_own_bank/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1psyj87", "author": "JAYCAZ1", "handle": "JAYCAZ1", "created_utc": 1766406997.0, "text": "Tether Executives Buy Bitcoin Mining Unit From Own Affiliate Company: Financial Times", "lang": null, "likes": 2, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1psyj87/tether_executives_buy_bitcoin_mining_unit_from/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1psrzpw", "author": "sylsau", "handle": "sylsau", "created_utc": 1766382877.0, "text": "So You Want to Accept Bitcoin? A 3-Step \"Quickstart\" for Your Small Business.", "lang": null, "likes": 5, "replies": 7, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1psrzpw/so_you_want_to_accept_bitcoin_a_3step_quickstart/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pskidv", "author": "341_bander", "handle": "341_bander", "created_utc": 1766360274.0, "text": "$23.6B in Bitcoin Options Set to Expire Next Friday Around $23.6 billion in Bitcoin options will expire next Friday, marking one of the largest BTC options expirations on record.\nCurrent positioning shows:\n\n-Call options are mainly concentrated at $100,000 and $120,000\n-Put options are concentrated near $85,000\n-The Max Pain level is estimated around $96,000\n\nGiven the size of the open interest, this expiration could influence short-term price action as it approaches.\n\nWhat do you expect?", "lang": null, "likes": 14, "replies": 9, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pskidv/236b_in_bitcoin_options_set_to_expire_next_friday/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1psadwg", "author": "sylsau", "handle": "sylsau", "created_utc": 1766334288.0, "text": "The Sovereign's Handbook: A Bitcoin Self-Custody Survival Guide.", "lang": null, "likes": 3, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1psadwg/the_sovereigns_handbook_a_bitcoin_selfcustody/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1psacqu", "author": "spriteMeLeukoKrasi", "handle": "spriteMeLeukoKrasi", "created_utc": 1766334206.0, "text": "The institutional money everyone was hyped about? It's quietly bleeding out. So we just watched [Ethereum ETFs dump over $600M in a single week](https://www.mexc.co/en-NG/news/312689?utm_source=perplexity), BlackRock's ETHA alone hemorrhaged $467M. Bitcoin's not much better, BTC is down 5% this week, ETH down 9%. The kicker? These are supposed to be the \"mature investors\" bringing stability to crypto.\n\nHere's what's frustrating me about this whole institutional adoption narrative. Traditional finance players are trying to force-fit legacy infrastructure onto blockchain rails. They're dealing with the same back-office nightmares, settlement delays, and fee structures that existed before crypto even existed. Then they wonder why institutional capital is so flighty when markets get choppy.\n\nI've been researching what actual institutional-grade blockchain infrastructure looks like beyond just wrapped ETFs, and there's a massive gap between what exists and what's actually needed. Real institutions need 24/7 markets (not just crypto market hours), atomic settlement (not T+2), and significantly lower costs than what TradFi offers.\n\nBeen following a project called Sphinx Protocol that's trying to tackle this for commodity derivatives specifically (oil, gas, futures, options). They raised $2M pre-seed back in June and are currently in their pre-testnet phase with mainnet supposedly coming later next year. The angle is building a permissioned L1 specifically for energy commodities with institutional compliance baked in from day one, not bolted on after.\n\nWhat caught my eye is they're claiming 10x lower fees and 28% better capital efficiency vs traditional exchanges, plus atomic settlement. Big promises obviously, and ngl I'm skeptical until testnet actually drops, but at least someone's trying to build proper infrastructure instead of just another token wrapper. If blockchain can't dramatically improve the actual trading infrastructure and just becomes another wrapper for the same old system, what's the point? We need better plumbing, not more speculation on broken pipes.\n\nAnyone else watching infrastructure plays in the commodity/derivatives space? Feels like this is where the real institutional adoption could actually happen if someone gets it right.", "lang": null, "likes": 20, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1psacqu/the_institutional_money_everyone_was_hyped_about/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ps4ui0", "author": "sirbrow", "handle": "sirbrow", "created_utc": 1766318041.0, "text": "FACT: XXI CAPITAL ACCUMULATED OVER 40,000 $BTC WORTH $3.8B THIS YEAR \nIT HASN'T EVEN STARTED BUYING. BULLISH 🚀\nTwenty One Capital (XXI) just hit the NYSE as the 3rd largest public Bitcoin holder on Earth. With Jack Mallers at the helm and a treasury of 43,500 BTC, they are following the MicroStrategy playbook to the letter.\nThis isn't just an ETF—it’s a massive corporate vacuum for the world's scarcest asset. If you think the top is in, you aren't paying attention.", "lang": null, "likes": 1, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ps4ui0/fact_xxi_capital_accumulated_over_40000_btc_worth/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ps0ito", "author": "Lillianhocker", "handle": "Lillianhocker", "created_utc": 1766301156.0, "text": "Why all are just mad for Bitcoin?", "lang": null, "likes": 2, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ps0ito/why_all_are_just_mad_for_bitcoin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1prkfoe", "author": "Nlovell_", "handle": "Nlovell_", "created_utc": 1766253512.0, "text": "How to start with Trading? Hello guys,\nI'm new in this community and Trading. I already know the basics of trading, reading graphs, candles etc. I'm 18yo and wanted to start with day training or long-term investing. Do you have some tips where to learn anything? Maybe some courses or something. Because just looking on the graphs doesn't bring me forward to my goals, to be successful day trader and make it as my main income or as a \"part time job\" after work. I see my potential in crypto currency's cuz I already did 300k$ from the bitcoin when it reached the 110k the first time after trump won. So I'm open for suggestions and I hope I'll find people like me that maybe want to start cooperate with me.", "lang": null, "likes": 0, "replies": 28, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1prkfoe/how_to_start_with_trading/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1prcxd2", "author": "341_bander", "handle": "341_bander", "created_utc": 1766232594.0, "text": "🇺🇸Trump says he will pardon the developers of Samurai Wallet. Trump says he will pardon the developers of Samurai Wallet , a Bitcoin privacy tool whose creators were imprisoned.\n\nIs this a win for financial privacy , or a dangerous precedent ? What do you think ?", "lang": null, "likes": 35, "replies": 39, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1prcxd2/trump_says_he_will_pardon_the_developers_of/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pr9rcq", "author": "Excluido-24", "handle": "Excluido-24", "created_utc": 1766220123.0, "text": "I'm new to this. Where do you recommend buying Bitcoin? What strategies do you recommend?\nI have very little capital and plan to hold, but I'd like to learn some other strategies besides the DCA (dollar-cost averaging) that many people mention online.", "lang": null, "likes": 2, "replies": 18, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pr9rcq/im_new_to_this_where_do_you_recommend_buying/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pr861j", "author": "tornavec", "handle": "tornavec", "created_utc": 1766213978.0, "text": "The \"Grayscale Syndrome\" Hits MicroStrategy: Why It Spells Trouble for Bitcoin Grayscale was the first company to launch a proxy instrument for institutional Bitcoin investments. Demand for GBTC trust shares was enormous, far exceeding the price of BTC.\n\nConsequently, the Bitcoin capitalisation in Grayscale's vault was 40% lower than the value of the shares. A similar situation initially developed at MicroStrategy (now Strategy). For a long period, the company's shares traded at a premium to its accumulated Bitcoin.\n\nIn February 2021, the GBTC premium turned into a discount. This was the main signal of the impending crypto winter. Today, MSTR is rapidly losing its market premium. \nFor the first time in a long while, the stock price has fallen to a level that corresponds to the actual value of the company's Bitcoin reserves.\n\nAs in 2021, investors are no longer willing to overpay for shares as a means of owning cryptocurrency. However, this is not just a sign of crypto winter.  \n\nGBTC lost its appeal due to the emergence of Bitcoin ETFs. It seems that companies accumulating BTC are also no longer of interest to investors.", "lang": null, "likes": 0, "replies": 22, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pr861j/the_grayscale_syndrome_hits_microstrategy_why_it/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pr797m", "author": "sylsau", "handle": "sylsau", "created_utc": 1766210692.0, "text": "The Great Bitcoin Washout: Escaping the Market's Spin Cycle. Why maximum pain at $80,000 is the necessary springboard for the next legendary bull run.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pr797m/the_great_bitcoin_washout_escaping_the_markets/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pr4fh7", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1766201526.0, "text": "Peter Brandt says Clarity Act wont move Bitcoin's price much - already priced in according to analysts Veteran trader Peter Brandt is throwing cold water on expectations that the US Clarity Act will pump Bitcoin prices. The next near-term milestone is a Senate committee markup in January (per White House crypto czar David Sacks), but Brandt’s saying it’s not gonna be “world-shaking” for BTC.\n\nHis take is pretty straightforward. Yeah the regulation is needed and will be good for the industry overall, but having an asset get regulated isnt some earth-shattering event. Especially when alot of Bitcoin maxis never wanted regulation in the first place. He thinks it’ll clarify the regulatory structure which is positive but wont redefine Bitcoin’s value.\n\nJohn Glover from Ledn agrees and says the Clarity Act has already been priced into the market. Any benefits to price action would be more delayed over time as Bitcoin and ETH gain broader acceptance as investable assets. So dont expect fireworks on day one.\n\nThe more interesting part is Brandt’s price prediction. He believes Bitcoin is currently in a bear market and could trade down to $60,000 in Q3 2026. Thats a 31% drop from current levels around $88,000. He says the charts are suggesting this move but his downside bias is “moderate” because of stuff like the Clarity Act providing some support.\n\nSenator Cynthia Lummis has been pushing hard to advance the bill and mentioned the crypto industry was getting concerned about progress since drafts kept changing during bipartisan discussions. The bill addresses digital asset market structure which is important long-term even if it doesnt create immediate price action.\n\nAnd honestly, if the vibe shifts from “number go up” to “rules + reporting,” that’s where people get caught off guard. Not because regulation instantly pumps price, but because it nudges more activity onto cleaner rails. If you’re actively trading or doing DeFi, it’s also the moment where keeping your cost basis straight matters more than ever, and tools like Awaken tax become less “nice to have” and more “please don’t let me guess my taxes.”\n\nSo basically temper your expectations if you’re expecting the Clarity Act to moon Bitcoin.", "lang": null, "likes": 8, "replies": 8, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pr4fh7/peter_brandt_says_clarity_act_wont_move_bitcoins/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pqmfby", "author": "usmcmike27", "handle": "usmcmike27", "created_utc": 1766154412.0, "text": "Long term question - Bitcoin or Ethereum I wanna drop $3,000 and put it in a cold wallet and forget it for 10 years or so. Any thoughts on whether bitcoin or ethereum would be a better ROI. Could Ethereum out perform bitcoin realistically?", "lang": null, "likes": 128, "replies": 264, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pqmfby/long_term_question_bitcoin_or_ethereum/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pqiqa3", "author": "sylsau", "handle": "sylsau", "created_utc": 1766143411.0, "text": "The Quantum Mirage: Why Supercomputing Will Never Break Bitcoin Mining.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pqiqa3/the_quantum_mirage_why_supercomputing_will_never/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pqgv2t", "author": "341_bander", "handle": "341_bander", "created_utc": 1766136279.0, "text": "Do you think the price of Bitcoin is being manipulated ? Over the past months, we’ve seen Bitcoin move in sharp, sometimes unexpected ways. Sudden price swings, large orders, and reactions to macro news have led many to question whether Bitcoin’s price is being influenced by more than just organic supply and demand.", "lang": null, "likes": 13, "replies": 28, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pqgv2t/do_you_think_the_price_of_bitcoin_is_being/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pq205r", "author": "sylsau", "handle": "sylsau", "created_utc": 1766091465.0, "text": "Digital Survival Guide: Using Bitcoin \"Offline\". The Hardware, The Software, and The Skills You Need to Be Unstoppable.", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pq205r/digital_survival_guide_using_bitcoin_offline_the/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ppw84y", "author": "ComplexWrangler1346", "handle": "ComplexWrangler1346", "created_utc": 1766077886.0, "text": "I could be wrong but I think ETF’s in crypto is worst thing that could have happened …. Bitcoin and ETH are now pumping and dumping literally daily because of ETF’s….i think they made all of cryptp pump and dumps due to ETF’s….thoughts ?", "lang": null, "likes": 32, "replies": 53, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ppw84y/i_could_be_wrong_but_i_think_etfs_in_crypto_is/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ppswg1", "author": "Richar_16", "handle": "Richar_16", "created_utc": 1766069956.0, "text": "Is Crypto a joke today? It feels like Crypto has lost it’s purpouse. Every coin following Bitcoin, manipulation in some way every week, altcoins bleeding like hell…\n\nI know there’s no crying in the casino, but everything looks so boring and sad these days.\n\nHolding till Good prices return, somehow in the future…", "lang": null, "likes": 123, "replies": 159, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ppswg1/is_crypto_a_joke_today/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pppjq2", "author": "OnChainSpecter", "handle": "OnChainSpecter", "created_utc": 1766060745.0, "text": "Institutional Bitcoin Allocations: Brazil’s Largest Bank Suggests 1–3% as a Hedge Brazil’s largest private bank, Itaú Unibanco, recently suggested that investors consider a small Bitcoin allocation (around 1–3%) as part of a diversified portfolio.\n\nWhat’s interesting is the framing: this isn’t positioned as a speculative trade or a high-conviction bet, but rather as a hedge — particularly against currency risk and macro uncertainty. The recommendation comes after continued weakness in the Brazilian real, with Bitcoin viewed as a non-sovereign asset that behaves differently from local equities and bonds.\n\nItaú also referenced regulated access via a local Bitcoin ETF (BITI11), highlighting how institutions increasingly prefer structured vehicles over direct self-custody.\n\nThis mirrors a broader trend we’ve seen globally: Bitcoin being discussed less as a “trade” and more as a portfolio component, especially in emerging markets facing FX volatility.\n\nCurious how others here think about this:\nDo small BTC allocations (1–3%) meaningfully improve risk-adjusted returns, or is this mostly narrative management by institutions?", "lang": null, "likes": 14, "replies": 9, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pppjq2/institutional_bitcoin_allocations_brazils_largest/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pplukw", "author": "sylsau", "handle": "sylsau", "created_utc": 1766046831.0, "text": "The Age of Maturity: How the Lightning Network is Reinventing Bitcoin's Promise. Beyond the data paradox: How record capacity, invisible adoption, and economic reality are transforming Bitcoin into a true global payment rail.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pplukw/the_age_of_maturity_how_the_lightning_network_is/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ppeuy5", "author": "Tsmacks1", "handle": "Tsmacks1", "created_utc": 1766023243.0, "text": "Michael Saylor says quantum will “harden” Bitcoin, but he’s ignoring the 1.7 million coins already at risk Michael Saylor claims quantum computing will harden Bitcoin.\n\nThe reality is more complicated. About **1.7 million BTC** are already in addresses where public keys are exposed, making them vulnerable once quantum computers arrive. Moving coins to quantum-safe outputs isn’t automatic.\n\nTechnical risks are real, and governance challenges make a smooth migration uncertain. Quantum computing could strengthen Bitcoin, or it could challenge the whole network in far greater ways than we anticipate.", "lang": null, "likes": 33, "replies": 59, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ppeuy5/michael_saylor_says_quantum_will_harden_bitcoin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pow3ro", "author": "Sensitive_Judge_5502", "handle": "Sensitive_Judge_5502", "created_utc": 1765976960.0, "text": "Institutions Changed Bitcoin’s Behavior: Why Bitwise Thinks the 4-Year Cycle Is Fading", "lang": null, "likes": 10, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pow3ro/institutions_changed_bitcoins_behavior_why/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1poq5au", "author": "sylsau", "handle": "sylsau", "created_utc": 1765955192.0, "text": "Is Your Bitcoin Lightning Wallet Spying on You? A 3-Point Privacy Check.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1poq5au/is_your_bitcoin_lightning_wallet_spying_on_you_a/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pod6hk", "author": "Original-Assistant-8", "handle": "Original-Assistant-8", "created_utc": 1765918177.0, "text": "Saylor: \"The Bitcoin Quantum Leap: Quantum computing won’t break Bitcoin—it will harden it. The network upgrades, active coins migrate, lost coins stay frozen. Security goes up. Supply comes down. Bitcoin grows stronger.\" Wow- there's a lot being said right there!\n\nHuge Acknowledgement an upgrade is required (he usually tries to discredit, misinform)\n\n\"Lost coins stay FROZEN\"  - No consensus on this.\n\nSecurity doesn't go up- it just allows it to continue in the Post Quantum world\n\n\"Supply comes down\"- not really true, it would just clarify once and for all that Satoshi era coins aren't going to be sold off.\n\nI've posted many times it is best if he just talks about how upgrading will be handled, rather than misinform.  In typical Saylor style he tries to spin it all into positives, which is fine.    \n  \nEven as an investor of Qanplatform, I still think having Bitcoin successfully manage this upgrade simply highlights the utility coins which accounted for being prepared early on.  And qanx is delivering solutions that enterprises can use to upgrade their systems.  This is a guaranteed market for upgrade solutions and blockchain utilities.", "lang": null, "likes": 12, "replies": 17, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pod6hk/saylor_the_bitcoin_quantum_leap_quantum_computing/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pocvr4", "author": "341_bander", "handle": "341_bander", "created_utc": 1765917454.0, "text": "Markets Are Bleeding ,What Now? Bitcoin is down.\nAltcoins are down.\nMemecoins are down.\nGold is down.\nStocks are down.\nSo… where’s the money going?", "lang": null, "likes": 0, "replies": 33, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pocvr4/markets_are_bleeding_what_now/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1po8mg3", "author": "EmbarrassedYak1110", "handle": "EmbarrassedYak1110", "created_utc": 1765907620.0, "text": "Seven Months to Zero: Inside China’s Bitcoin 2021 Crackdown", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1po8mg3/seven_months_to_zero_inside_chinas_bitcoin_2021/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1po4sc5", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1765898874.0, "text": "Crypto Markets Today: Bitcoin, ether extend pullback amid thin liquidity, macro jitters", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1po4sc5/crypto_markets_today_bitcoin_ether_extend/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1po2hcj", "author": "TeaPurpp", "handle": "TeaPurpp", "created_utc": 1765893193.0, "text": "Ethereum’s Vitalik Calls Out Elon: Free Speech Is Doomed", "lang": null, "likes": 10, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1po2hcj/ethereums_vitalik_calls_out_elon_free_speech_is/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pnvmdv", "author": "tornavec", "handle": "tornavec", "created_utc": 1765868793.0, "text": "The Senate Stole Bitcoin’s Santa Rally This week's vote on a key bill to regulate the cryptocurrency market has been officially postponed by the US Senate Committee on Banking, Housing, and Urban Affairs. The committee's Republican chairman, Tim Scott, decided to postpone consideration of the issue until early 2026.\n\nHis spokesperson, Jeff Naft, confirmed that progress had been made in developing a bipartisan agreement, but that negotiations with Democratic colleagues were ongoing. Initially, the committee chairman insisted that the bill should only be passed if there was consensus, in order to ensure maximum clarity for the digital asset industry and consolidate the US's position as a global crypto hub.\n\nThe vote was postponed due to requests from Democrats, who needed more time to discuss controversial issues. Consequently, the decisive stage in the formation of the legislative framework for digital assets in the US, which was anticipated this week, has been delayed, leaving the industry to continue operating in a state of regulatory uncertainty until next year.\n\nThe market reacted to the news with a drop of around 5%. The chances of a Santa Claus rally for Bitcoin are now zero. Cryptocurrencies will not grow in January until the Senate votes on the bill, which has now been postponed six times.", "lang": null, "likes": 14, "replies": 21, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pnvmdv/the_senate_stole_bitcoins_santa_rally/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pnfrvo", "author": "MarketFlux", "handle": "MarketFlux", "created_utc": 1765825111.0, "text": "JPMorgan Launches $100M Tokenized Money Market Fund on Ethereum JPMorgan Chase &amp; Co. one of the world’s largest banking institutions with over $4 trillion in assets under management has launched its first tokenized money market fund on the Ethereum blockchain, a major milestone in institutional adoption of on-chain finance.\n\nThe new fund, branded the My OnChain Net Yield Fund (MONY), was seeded with $100 million of JPMorgan’s own capital and built using the bank’s Kinexys Digital Assets tokenization platform.\n\nMONY is tokenized on Ethereum, meaning ownership is represented by digital tokens that can be held in compatible wallets and transferred on-chain.\n\nThe fund invests in traditional short-term debt instruments, such as U.S. Treasuries and fully collateralized repurchase agreements, while earning daily dividends similar to conventional money market funds.\n\nQualified investors can subscribe and redeem using U.S. dollars or the stablecoin USDC, blending traditional and on-chain liquidity.\n\nThe fund is offered as a 506(c) private placement to qualified individual and institutional investors typically requiring significant assets under management and a minimum initial commitment (e.g. $1 million).\n\nMONY is accessible through Morgan Money, JPMorgan’s integrated liquidity management and analytics platform that now bridges traditional and tokenized assets.\n\nMONY illustrates how tokenization can combine the stability and yield characteristics of traditional money market funds with the programmability and settlement efficiency of blockchain technology. Investors gain the ability to hold yield-bearing positions directly on-chain, potentially unlocking new use cases such as automated collateralization, 24/7 settlement, and peer-to-peer transfers.", "lang": null, "likes": 21, "replies": 8, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pnfrvo/jpmorgan_launches_100m_tokenized_money_market/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pn3uhg", "author": "sylsau", "handle": "sylsau", "created_utc": 1765793386.0, "text": "The Anchor of Truth: Why Bitcoin Hash Rate Is the Only Signal in a World of Noise. Bitcoin Price is Sentiment. Bitcoin Hash Rate is Reality. Why the Laws of Physics Always Win.", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pn3uhg/the_anchor_of_truth_why_bitcoin_hash_rate_is_the/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pn2jm9", "author": "sylsau", "handle": "sylsau", "created_utc": 1765787990.0, "text": "Bitcoin (BTC) Price News: $80K Retest Risk Rises", "lang": null, "likes": 2, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pn2jm9/bitcoin_btc_price_news_80k_retest_risk_rises/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pn11y6", "author": "sylsau", "handle": "sylsau", "created_utc": 1765781990.0, "text": "The Great Capitulation: Why Bitcoin Became Inevitable", "lang": null, "likes": 9, "replies": 7, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pn11y6/the_great_capitulation_why_bitcoin_became/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pn0ys2", "author": "tornavec", "handle": "tornavec", "created_utc": 1765781651.0, "text": "Bitcoin Smells of Oil \nIn 2025, the liquidity structure of the first cryptocurrency underwent fundamental changes due to a significant influx of 'petrodollars' from Persian Gulf countries. Aiming for long-term portfolio diversification, sovereign wealth funds and the region's wealthiest family offices have begun an aggressive expansion into digital assets.\n\n The key difference in this wave is the exclusive use of regulated channels, such as spot ETFs, rather than risky purchases on conventional crypto exchanges.\n\nAbu Dhabi has become a financial centre of attraction, boasting ideal infrastructure for institutional investors. The Abu Dhabi Investment Council's decision to increase its holdings in BlackRock's IBIT fund is indicative of this trend. \n\nThis influx of 'smart money' not only pushes prices up, but also improves the market qualitatively: the order book grows deeper, spreads narrow and pricing becomes more efficient. \n\nHowever, experts warn of the risks associated with such popularity: while institutional capital provides stability, it retains the ability to exit instantly and en masse through the same ETFs, creating the threat of sharp declines when global market sentiment changes.", "lang": null, "likes": 13, "replies": 8, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pn0ys2/bitcoin_smells_of_oil/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pn066k", "author": "sylsau", "handle": "sylsau", "created_utc": 1765778735.0, "text": "🌈 BITCOIN RAINBOW CHART PREDICTS $150K to $440K in 2026", "lang": null, "likes": 0, "replies": 10, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pn066k/bitcoin_rainbow_chart_predicts_150k_to_440k_in/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pmi0p0", "author": "sylsau", "handle": "sylsau", "created_utc": 1765729386.0, "text": "The Great Repricing: Why the World Is Moving to a Bitcoin-Backed Digital Credit Standard.", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pmi0p0/the_great_repricing_why_the_world_is_moving_to_a/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pmhoto", "author": "spriteMeLeukoKrasi", "handle": "spriteMeLeukoKrasi", "created_utc": 1765728589.0, "text": "SEC approves institutional tokenization. 2026 will be HUGE! Earlier this week the SEC gave DTCC the green light to tokenize Russell 1000 stocks, Treasuries, and ETFs starting H2 2026. Not sure why this isn't bigger news, but this is legitimately the infrastructure moment we've been waiting for.\n\nRight now if an institution wants to trade stocks and crypto together, they're dealing with a mess. T+2 settlement on stocks means you're stuck waiting 2 days, T+0 on crypto means instant, completely different risk systems, and you've got counterparty risk on both sides. It's inefficient as hell.\n\nIn short, in 2026 everything moves on-chain. T+0 settlement. Single margin pool. One ledger.\n\nYeah, this doesn't pump Bitcoin tomorrow. But it does mean the institutional capital sitting on the sidelines waiting for \"real infrastructure\" now has an actual date on the calendar. H2 2026 is when serious volume starts moving on-chain. If you understand why institutions are moving to DeFi, you're going to be ahead of most people in 2026. It's not really about lower fees. It's about actually being able to settle instantly and run your capital efficiently. Once you can cross-margin Russell 1000 stocks against commodities against crypto with instant settlement? That's when institutions actually move real volume.\n\nThe thing nobody's talking about:\n\nThe protocols actually building for this stuff now—institutional settlement infrastructure, real asset trading—are positioning themselves for what's coming. Most DeFi is built for retail traders. For example, Sphinx Protocol (a commodities-on-chain project still in development) is building exactly this kind of infrastructure: T+0 atomic settlement and cross-margining for institutions. There's a quiet wave of projects that started building on this thesis months ago, and now with this SEC news, their timing looks prescient.\n\nKeep an eye on how tokenization develops in H2 2026. This is the real story everyone's sleeping on.", "lang": null, "likes": 143, "replies": 38, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pmhoto/sec_approves_institutional_tokenization_2026_will/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pm7jek", "author": "sylsau", "handle": "sylsau", "created_utc": 1765694578.0, "text": "The Great Bitcoin Metamorphosis: Why the Current Purge Is Preparing the Shock of Tomorrow.", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pm7jek/the_great_bitcoin_metamorphosis_why_the_current/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pls7uv", "author": "Zaskoda", "handle": "Zaskoda", "created_utc": 1765650239.0, "text": "I think everyone is overlooking Polkadot I bought Bitcoin in 2013. I learned about Ethereum in 2017 and started building dapps shortly after. Both technologies felt like game changers. Over time, I lost hope in Ethereum. First it was issues with high fees and a congested network. Then the L2s came and gave some hope. But the whole ecosystem is a mess.\n\nI invested in Polkadot a while ago. So long ago that I paid over $20 for each DOT. As a dev, I wanted to learn about building on Polkadot but found it totally overwhelming. So my attention drifted away. Earlier this year I saw Doom running on JAM and knew I needed to see what what going on.\n\nI took the PBAX course and started learning about Polkadot. Wow. They are so far ahead of Ethereum and their roadmap is bright and shiny. I'm still learning about JAM, which is sort of an abstraction of parts of Polkadot upon which any blockchain networks can run. And it's technically as powerful as a super computer.\n\nThere are now more active developers in the Polkadot space than in the Ethereum space. The way I figure it, most people won't care about why Polkadot is important until developers start to produce applications. And it seems a giant herd of developers are moving in exactly that direction right now. I'm learning INK myself with plans to port an old project over. And I don't really expect anyone who's in the scene just to invest and make money to notice until late next year. And then - I think it's going to explode.\n\nI have moved about 80% of my ETH holdings to DOT, which is trading close to $2 now. We'll see if my intuition about Polkadot is as accurate as it was about Ethereum and Bitcoin.", "lang": null, "likes": 51, "replies": 165, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pls7uv/i_think_everyone_is_overlooking_polkadot/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1plm413", "author": "MarionberryMelodic81", "handle": "MarionberryMelodic81", "created_utc": 1765634600.0, "text": "Sending crypto still feels scary, so I tried to simplify it. Every time I send crypto, I pause. Copy address, paste, re-check, switch chains, re-check again. Even after doing this for years, there’s always that “what if I messed up?” feeling.\n\nThat’s why I’m building BitDrop. It’s not a wallet and it doesn’t touch your funds. Your wallet still signs everything. BitDrop just adds a username layer + safety check before you send.\n\nThe main idea: one username across multiple wallets.\nIf your name is Siddhant, you keep the same identity everywhere:\n\nSiddhant@trust\n\nSiddhant@metamask\n\n\nSame name, different wallets, no copying long addresses. BitDrop routes it to the right chain automatically.\n\nAt the moment, BitDrop works with Trust Wallet and supports:\n\nEVM chains (Ethereum, Polygon, BNB, Arbitrum, etc.)\n\nSolana\n\nBitcoin\n\n\nBefore anything is sent, BitDrop runs a quick scam / risk check on the receiver and warns you if something looks suspicious. It won’t stop you from sending, but at least you’re not going in blind.\n\nStill early and very much a work in progress, but I’m curious — would a shared username + pre-send safety check actually make crypto transfers less stressful for you, or is this solving a problem you’ve already learned to live with?", "lang": null, "likes": 0, "replies": 19, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1plm413/sending_crypto_still_feels_scary_so_i_tried_to/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1plfxda", "author": "tornavec", "handle": "tornavec", "created_utc": 1765611985.0, "text": "Bitcoin Is the Labubu Doll for Digital Fanatics John Ameriks, a senior executive director at Vanguard — one of the world's largest asset managers — and the global head of quantitative analysis, has expressed scepticism about Bitcoin. Speaking at a conference in New York, Ameriks compared the leading cryptocurrency to a speculative collectible toy, labelling it a 'digital Labubu' (a viral stuffed toy).\n\nHe emphasised that Bitcoin lacks the characteristics of cash flow and capitalisation that Vanguard looks for in long-term investments, and questioned whether blockchain technology has sustainable economic value.\n\nThis was despite the fact that Vanguard, which manages around $12 trillion in assets, had recently decided to allow its clients to trade cryptocurrency-focused ETFs and fund shares, including Bitcoin, Ethereum, XRP and Solana, on its platform.\n\nAmeriks explained that this move followed the launch of spot Bitcoin ETFs in January 2024. However, he clarified that Vanguard would not provide investment advice on crypto assets, leaving it up to clients to act at their own discretion.", "lang": null, "likes": 0, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1plfxda/bitcoin_is_the_labubu_doll_for_digital_fanatics/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1plfl6l", "author": "sylsau", "handle": "sylsau", "created_utc": 1765610689.0, "text": "The DNA of Freedom: Why We Don't Measure Bitcoin in Dying Dollars. Satoshi gifted us a weapon against oppression—don't treat it like a stock ticker.", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1plfl6l/the_dna_of_freedom_why_we_dont_measure_bitcoin_in/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pld9af", "author": "NoCucumber4783", "handle": "NoCucumber4783", "created_utc": 1765602317.0, "text": "I watched $1M shrink to $100k. Twice. Here's why \"just HODL\" is terrible advice I've been in crypto since 2018. I'm a developer, not a trader. That distinction cost me nearly a million dollars in unrealized gains.\n\n**The setup**\n\nStarted with ETH in 2018. As a dev, I participated in grants and hackathons. Then I discovered Stacks (back when it was Blockstack) and joined their App Mining program.\n\nThe program paid well. Really well. Enough-to-retire well.\n\nBut I didn't cash out enough. I held most of it.\n\n**The delusion**\n\nStacks has this mechanism where you stack STX to earn BTC. Sounds amazing, right? Passive income in Bitcoin just for holding.\n\nI watched STX go from $0.12 to $3.70. Sold a bit here and there, but never enough.\n\nWhy would I sell more? I was earning BTC. The number kept going up. I felt like a genius.\n\n**Going deeper**\n\nFeeling invincible, I went further:\n\n* NFTs\n* Memecoins (the usual dogs and cats)\n* DeFi farming\n* Liquidity pools\n\nThen I discovered ALEX Protocol. High yields. The ALEX token was pumping too. I thought I'd found the compound effect holy grail.\n\nSo I reinvested everything. STX, ALEX, more memecoins. All in.\n\n**The first crash**\n\nALEX got hacked.\n\nLost almost $500k overnight.\n\nBut I'm a dev, right? I built a trading app (basically a pumpfun clone on Stacks) and clawed back some losses. STX pumped to $3 again.\n\nDid I take real profits this time? Did I learn?\n\nNo.\n\n**The second crash**\n\nSTX is now $0.30. Portfolio sitting at $100k.\n\nFrom $1M peak to $100k. A 90% drawdown.\n\n**What I lost**\n\nNot just money. Years of work. The App Mining earnings. The hackathon prizes. The grants. Most of it evaporated because I couldn't bring myself to sell enough.\n\n**What I learned**\n\n1. **Don't fall into the \"passive income\" or \"HODL to earn\" trap.** Staking rewards, yield farming, earning BTC by holding—it all sounds great until you realize you're just watching your principal bleed while collecting crumbs. Just sell and take profits.\n2. **Never trust any single founder or protocol.** They can die, go to jail, get hacked, or rug. Doesn't matter how famous they are.\n3. **Diversify.** Not just across tokens—across asset classes entirely.\n4. **Buy real assets.** Property. Index funds. Things that exist outside your browser wallet.\n5. **HODL is a meme, not a strategy.** It's copium for people who can't make decisions.\n\n\n\nI'm still building in crypto. I still believe in the tech. But I no longer believe I'm smarter than the market.\n\nTake profits. Diversify. Don't be me.", "lang": null, "likes": 748, "replies": 228, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pld9af/i_watched_1m_shrink_to_100k_twice_heres_why_just/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pkoz1a", "author": "Then_Helicopter4243", "handle": "Then_Helicopter4243", "created_utc": 1765536630.0, "text": "Binance’s CZ Names the Best Bitcoin Investment Strategy Changpeng Zhao (CZ), former Binance CEO, has once again shared his perspective on how to approach Bitcoin investing. His advice is deceptively simple,“Buy the fear, sell the greed.” This mantra reflects the cyclical nature of crypto markets, where sentiment often swings wildly between panic and euphoria. CZ stresses that disciplined strategies like dollar cost averaging (DCA) and risk management are far more effective than chasing short term hype.\n\nThe recent Crazy 48h Event provided a perfect case study of this philosophy. Traders witnessed extreme volatility across multiple phases, Liquidity surged, shorts were liquidated en masse, and Bitcoin briefly spiked before retracing. Now phase 5 is live, those who had accumulated during earlier fearful phases were rewarded, while latecomers who chased the rally found themselves caught in the reversal. It was a textbook example of CZ’s principle in action.\n\nIt’s also worth noting that Bitget hosted the event, giving traders worldwide a front row seat to the chaos. The most effective Bitcoin strategy is to stay disciplined and avoid emotional trading. Bitcoin has historically rewarded long term holders, so treating it as a strategic allocation rather than a quick trade is key.\n\nAt the same time, risk management is critical. Keep Bitcoin as a reasonable portion of your portfolio, avoid leverage, and remember that regulation and sentiment shifts can cause sharp swings. Think of Bitcoin as digital gold, so accumulate steadily, hold through cycles, and let patience, not greed, drive your returns.\n\nBitcoin’s long term trajectory is built on fundamentals, not hype. Meme coins may swing 100% in hours, but CZ’s framework reminds us that patience and discipline win over time.", "lang": null, "likes": 6, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pkoz1a/binances_cz_names_the_best_bitcoin_investment/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pklq9d", "author": "sylsau", "handle": "sylsau", "created_utc": 1765523677.0, "text": "The Phantom Ledger: A Deep Dive on Rehypothecation and Paper Bitcoin. How Wall Street is Engineering the Capture of Bitcoin's Price Discovery.", "lang": null, "likes": 2, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pklq9d/the_phantom_ledger_a_deep_dive_on_rehypothecation/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pkhflt", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1765509766.0, "text": "Netflix is making a comedy movie about a couple who forgot their crypto password The film is called One Attempt Remaining and stars Jennifer Garner. The plot is about a divorced couple who discover their cryptocurrency from a cruise they won together is now worth millions but they forgot the password. According to reports they have around a couple of days (roughly 48–72 hours) to recover $35 million before the claim expires and apparently theres basically only one attempt left to unlock it before they lose the funds for good.\n\nThis is basically every crypto holders nightmare turned into entertainment. The movie mirrors real life situations like Stefan Thomas who forgot the password to his IronKey hard drive containing 7,002 Bitcoin worth around $640 million today. He's already made 8 out of 10 allowed attempts and still hasnt gotten in. After 10 wrong tries the drive permanently erases everything.\n\nThen theres James Howells who threw away a hard drive with 8,000 Bitcoin back in 2013. Its sitting in a UK landfill somewhere and hes been fighting the city council for years to search for it but keeps losing legal battles.\n\nThe fact that Netflix is making this into a romantic comedy shows how mainstream crypto has become. These password nightmare stories used to be niche crypto community horror tales but now theyre Hollywood material.\n\nAlso, the second you *do* recover something like this, there’s a whole “ok now what” layer people forget. Cost basis, old exchange records, DeFi trails, what’s taxable vs what’s just a transfer. That part isn’t fun, but it’s real. Stuff like Awaken tax exists basically for that exact cleanup when your history is chaotic and you don’t want to guess and overpay.\n\nIts kinda funny but also dark when you think about how much wealth is permanently locked away because people forgot passwords or lost hardware. This movie will probably give everyone watching anxiety about their own crypto storage.\n\nWill definately watch this just to see how they handle the technical aspects and whether they make it accurate or go full Hollywood nonsense.", "lang": null, "likes": 33, "replies": 26, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pkhflt/netflix_is_making_a_comedy_movie_about_a_couple/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pk7qrx", "author": "sunny8888", "handle": "sunny8888", "created_utc": 1765484151.0, "text": "Is the Bull Run Over? Analyzing the December 2025 Correction As we enter the final month of 2025, cryptocurrency markets have hit a turbulent patch. After an explosive year, Bitcoin (BTC) and Ethereum (ETH) are facing a \"December Test,\" leaving many investors wondering: *Is the cycle peaking, or is this the final buy opportunity before 2026?*\n\nHistorical data shows that December is often a mixed bag for crypto assets—a tug-of-war between year-end profit-taking and the anticipation of a \"Santa Rally.\n\nCheckout Cryptobull analysis on how markets are shaping for the rest of December and into early January 2026, and it'd be great to hear your thoughts on the analysis piece as well. Thank you!", "lang": null, "likes": 0, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pk7qrx/is_the_bull_run_over_analyzing_the_december_2025/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pk6i53", "author": "ApplicationNew2576", "handle": "ApplicationNew2576", "created_utc": 1765481232.0, "text": "Search for wallet.dat bitcoin I have found 3 old HDD on my basement from 2006 to 2010 and just out of curiosity i want to scan if i ever created a bitcoin wallet . Bed news is that back then because of viruses i used to format the pc 2 times per year and now I don’t know which tool software to use . The old pc running windows xp 32bit with 512bm ram .", "lang": null, "likes": 0, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pk6i53/search_for_walletdat_bitcoin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pk023u", "author": "Grouchy-Tangerine-30", "handle": "Grouchy-Tangerine-30", "created_utc": 1765466283.0, "text": "Bitcoin dips below $90,000 as AI worries dent risk appetite", "lang": null, "likes": 0, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pk023u/bitcoin_dips_below_90000_as_ai_worries_dent_risk/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pjy86l", "author": "sylsau", "handle": "sylsau", "created_utc": 1765461668.0, "text": "The $2 Trillion Experiment: Bitcoin's Countdown to the Event Horizon. The Ticking Sound Under the Floorboards.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pjy86l/the_2_trillion_experiment_bitcoins_countdown_to/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pjs93g", "author": "JAYCAZ1", "handle": "JAYCAZ1", "created_utc": 1765440805.0, "text": "Saylor, Ramaswamy Revolt Against MSCI’s ‘Anti-Crypto’ Index Rules Feels like this goes wayyy beyond Bitcoin. If MSCI actually exclude companies with a lot of BTC on their balance sheets, it's basically raising the cost of capital for any firm thinking about the bitcoin treasury model. Index providers aren’t regulators, but something like this effectively acts like regulation. The passive flow implications are huge!!", "lang": null, "likes": 1, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pjs93g/saylor_ramaswamy_revolt_against_mscis_anticrypto/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pjr82f", "author": "tornavec", "handle": "tornavec", "created_utc": 1765436800.0, "text": "Where are Elon Musk's \"space Bitcoins\" going? Elon Musk's company SpaceX has been moving cryptocurrency every week for the last two months. According to Arkham Intelligence, the firm is shifting BTC in chunks of around $100 million.\n\nSpaceX hadn't touched its crypto holdings in almost three years. So why is Elon Musk now breaking up 8,285 BTC worth roughly $770 million?\n\nThe company ranks fourth among the largest private holders of Bitcoin. Musk's influence on the crypto market is enormous. Could he be predicting a crash after January 15th, the date when MicroStrategy shares are set to be removed from the MSCI index?\n\nBitcoin split across multiple wallets is much easier to sell over-the-counter. You could just hand the buyer a seed phrase. This way, Musk and SpaceX could keep the deal quiet and avoid tanking the market.\n\nThat said, some press reports suggest the Bitcoin is being moved as part of preparations for a record-breaking IPO in 2026.", "lang": null, "likes": 0, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pjr82f/where_are_elon_musks_space_bitcoins_going/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pjpogr", "author": "sylsau", "handle": "sylsau", "created_utc": 1765431305.0, "text": "The Invisible Tsunami: Why the \"Bitcoin Isn't Money\" Narrative is Dead Wrong. While skeptics dismiss it, a massive, invisible payment infrastructure is being built right under our noses—here is the undeniable proof that Bitcoin is already working as money.", "lang": null, "likes": 0, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pjpogr/the_invisible_tsunami_why_the_bitcoin_isnt_money/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pj2rxb", "author": "Desperate-Hurry-3205", "handle": "Desperate-Hurry-3205", "created_utc": 1765373877.0, "text": "What’s your take on Bitcoin right now? Trend break or deeper cycle reset? Bitcoin’s been under pressure these past weeks — breaking below key support levels and showing a clear loss of momentum on higher timeframes: weekly MACD has flipped negative, RSI is heading into the 40s, and price structure now shows lower highs, while ETF flows have turned mixed, with net inflows now negative.\n\nAt the same time, we’re not (yet) in a confirmed long-term bear market. Long-term holders are distributing more than usual, but macro conditions and liquidity cycles could still shift the picture quickly if demand reappears.\n\nSo the big question is: **are we looking at a temporary mid-cycle correction or the early stages of a real bear phase?**\n\nCurious to hear how others are positioning. Are you buying dips, waiting for confirmation, or preparing for a deeper retrace?", "lang": null, "likes": 14, "replies": 59, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pj2rxb/whats_your_take_on_bitcoin_right_now_trend_break/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pixdjj", "author": "JAYCAZ1", "handle": "JAYCAZ1", "created_utc": 1765355012.0, "text": "Bitcoin Rewards Fed Stability More Than Rate Cuts Not necessarily a new idea for people who follow the macro world, but this read made the distinction between small cuts, big cuts, and ‘no change’ feel a lot clearer. I’ve always seen the cuts debate framed too simply, so the stability angle stood out to me more than I expected. Curious how others weigh predictability vs liquidity in BTC’s moves?", "lang": null, "likes": 0, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pixdjj/bitcoin_rewards_fed_stability_more_than_rate_cuts/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pis6wp", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1765337441.0, "text": "Ethereum just smashed through resistance and rallied over 8% while others are basically stuck at its current levels. [](https://www.reddit.com/r/CryptoCurrency/?f=flair_name%3A%22DISCUSSION%22)ETH managed to break above the $3,200 and $3,250 resistance levels that were holding it back. The price even pushed past $3,350 and touched a high of $3,396 before consolidating. Right now its trading above $3,200 and showing strong momentum with a bullish trendline forming around the $3,210 support level.\n\nThe technical setup looks pretty solid. If ETH can break above the $3,380 resistance it could target $3,420 next and possibly even $3,500 to $3,550 in the near term. The momentum indicators are flipping bullish with the MACD gaining strength and RSI above 50 which usually signals more upside potential.\n\nWhats intresting is Ethereum is outperforming btc right now. While BTC struggles around $92k, ETH is showing relative strength which could mean we're seeing a rotation into alts or specifically into Ethereum based on fundamentals or technical breakouts.\n\nHowever theres still risk here. If ETH fails to clear the $3,380 level it could pull back to support at $3,250 or even $3,210. A break below $3,210 would be concerning and might send it back toward $3,150 or lower.\n\nThe consolidation after the initial pump is actually healthy. It shows buyers are absorbing supply at these levels rather than just a quick pump and dump. The question is whether buyers have enough strength to push through the next resistance zone.\n\nETH dominance has also been ticking up on the charts lately, which kind of supports the idea of a short term momentum shift away from Bitcoin, at least for now.", "lang": null, "likes": 16, "replies": 17, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pis6wp/ethereum_just_smashed_through_resistance_and/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1piqai3", "author": "MarketFlux", "handle": "MarketFlux", "created_utc": 1765332118.0, "text": "PNC Bank Becomes First Major US Bank to Offer Direct Bitcoin Trading Through Coinbase Partnership PNC Private Bank, with $400-500 billion in assets, has launched direct Bitcoin trading capabilities for its high-net-worth clients through an integrated Coinbase platform. The move makes PNC the first major US bank to offer such services, marking a significant milestone in traditional finance's adoption of cryptocurrency. The partnership, announced in July, allows private banking clients to execute spot Bitcoin transactions directly through PNC's platform, signaling growing institutional acceptance of digital assets among mainstream financial institutions.", "lang": null, "likes": 8, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1piqai3/pnc_bank_becomes_first_major_us_bank_to_offer/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pin2r0", "author": "Janek_Calls", "handle": "Janek_Calls", "created_utc": 1765323576.0, "text": "Don't be greedy in trading like me! I'm gonna share my personal trading history with ETH futures here.\nI started trading crypto this year, Ethereum mostly. Over all, I did quite well apart from being down 25k on a 35k account in one trade lol. It got back however, and in the end of October I had a profit of 21k over the year which was absolutely amazing to me. Guess what, when the sell of started, I went more or less all-in with a little leverage (50 ETH to be precise), thinking it will bounce up again quickly as it did within the last weeks. It didn't, so at the end I've been down 53k (!) and almost got liquidated. My liquidation level was 2598 USD and it went down to 2621. I felt like shit and was sure I'm gonna lose it all. For some reason, the market turned and with today's profits I managed to get out break-even regarding my initial account balance. So I lost a little over 21k with just one trade and now I'm up 46 USD for the whole year. I know I got REALLY lucky not losing it all, it was incredibly close. I see it as a second chance not many people get, so pray for me that I'm gonna be more responsible the next time.", "lang": null, "likes": 62, "replies": 43, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pin2r0/dont_be_greedy_in_trading_like_me/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pi9yye", "author": "Legitimate_Towel_919", "handle": "Legitimate_Towel_919", "created_utc": 1765293346.0, "text": "the crypto market could grow 10–20x over the next decade Bitwise CIO Matt Hougan says crypto could grow 10–20x over the next decade. He points to how tiny tokenization still is compared to traditional markets, and even Paul Atkins recently hinted that U.S. stocks could move onchain within a few years.\nHougan expects stablecoins and tokenization to keep expanding, Bitcoin to strengthen its role, and new use cases to keep emerging. Since nobody knows which chain will dominate, he prefers broad index exposure over betting on one network.\n\nStill feels very early 😅 ?", "lang": null, "likes": 0, "replies": 8, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pi9yye/the_crypto_market_could_grow_1020x_over_the_next/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pi8i76", "author": "sylsau", "handle": "sylsau", "created_utc": 1765289740.0, "text": "The Sovereign Prisoner's Dilemma: Why Nations Have No Choice But to Front-Run the American Bitcoin Reserve. The math of the \"Sovereign Prisoner’s Dilemma\" proves why global powers must front-run the Fed or face insolvency—and why $126,000 is just the ante to sit at the table.", "lang": null, "likes": 0, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pi8i76/the_sovereign_prisoners_dilemma_why_nations_have/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pi8hsh", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1765289710.0, "text": "Bitcoin holds $90,000 as markets await Fed rate cut decision and Powell's guidance", "lang": null, "likes": 47, "replies": 15, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pi8hsh/bitcoin_holds_90000_as_markets_await_fed_rate_cut/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pi3thq", "author": "sylsau", "handle": "sylsau", "created_utc": 1765275065.0, "text": "The Ghost in the Machine: A Deep Dive on Acquiring Non-KYC Bitcoin.", "lang": null, "likes": 3, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pi3thq/the_ghost_in_the_machine_a_deep_dive_on_acquiring/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1phwm36", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1765249279.0, "text": "Michael Saylor just pitched countries on creating Bitcoin backed digital banking systems Speaking in Abu Dhabi, Saylor laid out a vision where countries could use Bitcoin reserves and tokenized credit to offer regulated bank accounts that give way higher returns than traditional deposits. He pointed out that banks in Japan, Europe and Switzerland barely pay any interest while US money market funds are around 4%. People are basically disgusted with their bank accounts which is why corporate bonds exist.\n\nHis proposal involves structuring accounts with about 80% digital credit instruments, 20% regular currency, and an extra 10% buffer to reduce volatility. The digital credit layer would be backed by Bitcoin reserves with about 5 to 1 overcollateralization. Basically using Bitcoin as the ultimate collateral layer.\n\nSaylor thinks a country that implements this could attract $20 to $50 trillion in deposits and become the digital banking capital of the world. Thats not a small claim.\n\nHowever theres obvious skepticism here. Bitcoin is down 28% from its recent highs and dropped 9% over the past year. The volatility makes people question how you can build stable high yield products on top of it. One former bond trader called Saylors moves folly and said hiking rates to maintain a peg wont work when people want their money back during a panic.\n\nStrategy already has a product called STRC that works somewhat like this - its grown to $2.9 billion but faces doubts about whether it can handle a real liquidity crunch.\n\nThe idea is innovative but feels like it requires Bitcoin to keep appreciating long term to actually work. What happens during extended bear markets?", "lang": null, "likes": 6, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1phwm36/michael_saylor_just_pitched_countries_on_creating/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1phsx75", "author": "Realistic-Read-2507", "handle": "Realistic-Read-2507", "created_utc": 1765239170.0, "text": "Kevin O'Leary Backed BitZero Holdings (BITZ.u) Begins Development of 100 Hectare Data-Center in Finland to Support Bitcoin Workloads", "lang": null, "likes": 2, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1phsx75/kevin_oleary_backed_bitzero_holdings_bitzu_begins/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1phgxst", "author": "f00dl3", "handle": "f00dl3", "created_utc": 1765211430.0, "text": "The Fed is about to make a policy error Everyone expects the Fed to cut rates this week. This should not happen. If this happens, we are cutting rates into increasing inflation. The BLS is now delaying October &amp; November PCE data until mid-January, which means that it's very possible inflation is once again increasing, and the current administration is just hiding the evidence to try to spin a political narrative that Powell needs to cut rates \"too late\" or what ever, when in fact the Fed needs to be raising rates right now.\n\n  \nWhat implications will this policy error have on Bitcoin?", "lang": null, "likes": 18, "replies": 35, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1phgxst/the_fed_is_about_to_make_a_policy_error/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1phevn3", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1765206756.0, "text": "Nvidia CEO Jensen Huang Just Flipped the Bitcoin Energy Consumption Debate And It Changes Everything Bitcoin’s energy use has been one of its biggest criticisms for years, but Nvidia CEO Jensen Huang just offered a very different perspective. Speaking during a panel on AI and energy, Huang said Bitcoin actually converts excess electricity into a portable form of money essentially reframing mining as a way to monetize unused power rather than waste it. Coming from the guy whose chips run most of today’s AI infrastructure, it’s a notable shift in tone. Supporters of Bitcoin have been arguing for a while that more mining is happening on stranded or renewable energy, and Huang’s comments line up with that narrative. It doesn’t magically solve all the environmental concerns, but it’s interesting to hear a major tech leader describe Bitcoin as part of the energy economy instead of a problem for it. Curious how others here see this is this a fair way to look at mining, or just a convenient reframing?", "lang": null, "likes": 303, "replies": 119, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1phevn3/nvidia_ceo_jensen_huang_just_flipped_the_bitcoin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ph62vt", "author": "sylsau", "handle": "sylsau", "created_utc": 1765177854.0, "text": "Big Buyers Storm In as Bitcoin’s Rebound to $91K Triggers Massive Liquidation Wave", "lang": null, "likes": 12, "replies": 7, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ph62vt/big_buyers_storm_in_as_bitcoins_rebound_to_91k/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ph560b", "author": "sylsau", "handle": "sylsau", "created_utc": 1765174509.0, "text": "The $126,000 Illusion: Why the \"Top\" Is Nowhere in Sight for Bitcoin Amidst a Tectonic Financial Shift. Wall Street has capitulated, sovereigns are accumulating, and the Fed just pivoted: Here is why the data proves the smart money is treating today's all-time high as the starting line.", "lang": null, "likes": 21, "replies": 12, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ph560b/the_126000_illusion_why_the_top_is_nowhere_in/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ph26qo", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1765165043.0, "text": "Coinbase is predicting Bitcoin could see a December recovery based on macro conditions but theres some important caveats. Their research team is pointing to improving liquidity and markets pricing in about a 92% chance of a Fed rate cut at the December 9–10 meeting. As of December 4th the odds of a rate cut jumped to 92%, which has often been supportive for risk assets like crypto in past cycles. They're also tracking global money supply which has been expanding lately.\n\nBack in October Coinbase actually predicted weakness in November followed by a December reversal and so far that's playing out. Bitcoin is hovering around $90k after dropping from highs near $100k last month.\n\nHowever the big wildcard is Fed Chair Jerome Powell's comments during the rate decision press conference. Analysts say if Powell sounds hawkish about 2026 policy it could put a cap on any rally even if they cut rates. His previous hawkish remarks in November contributed to the selloff we just saw.\n\nMarket sentiment is still pretty fearful right now. Both institutional and retail investors are hesitant to jump back in which is keeping markets in limbo. The technical picture shows Bitcoin already retested the $80k area and bounced off support tho.\n\nOne positive catalyst is speculation that Kevin Hassett might become the next Fed Chair in 2026. He's seen as way more dovish which would be bullish for crypto long term.\n\nSo basically the setup looks decent for a December recovery but everyones gonna be watching what Powell says super closely. One wrong comment could derail things fast.", "lang": null, "likes": 6, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ph26qo/coinbase_is_predicting_bitcoin_could_see_a/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1ph0t4a", "author": "Independent-Cat-9093", "handle": "Independent-Cat-9093", "created_utc": 1765160902.0, "text": "Bitcoin a viable long term investment option? as the title says Ive been wondering if bitcoin is a viable longterm investment like buy x$ worth and forget about it for 10+ years. Is it likely to make me money or just lose me money in the long term? Are there better crypto currencies or better ways to achieve the same long term effect?", "lang": null, "likes": 6, "replies": 99, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1ph0t4a/bitcoin_a_viable_long_term_investment_option/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pgx766", "author": "Emotional-Fig-4105", "handle": "Emotional-Fig-4105", "created_utc": 1765150730.0, "text": "Ether outpaces Bitcoin’s trend change: Is ETH on track for a 20% rally?", "lang": null, "likes": 21, "replies": 18, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pgx766/ether_outpaces_bitcoins_trend_change_is_eth_on/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pgrlcv", "author": "sylsau", "handle": "sylsau", "created_utc": 1765136689.0, "text": "The Bitcoin Miner's Dilemma: The War for the Color of Money. The miners are no longer just securing the network; they are deciding its political alignment. And in a war between Principles and Profits, Wall Street rarely bets on Principles.", "lang": null, "likes": 1, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pgrlcv/the_bitcoin_miners_dilemma_the_war_for_the_color/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pgc8jj", "author": "sylsau", "handle": "sylsau", "created_utc": 1765091704.0, "text": "The Silent Surrender: Why the System Finally Conceded to Bitcoin. Inside the Hostile Takeover of the Global Financial System: Why Regulators Are No Longer Approving Bitcoin, But Conceding to It.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pgc8jj/the_silent_surrender_why_the_system_finally/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pg7po3", "author": "spriteMeLeukoKrasi", "handle": "spriteMeLeukoKrasi", "created_utc": 1765076730.0, "text": "SEC Chair Paul Atkins: “All U.S. markets will be on chain within two years.” This is probably the most bullish expectation made by an official ever for crypto.\n\nThink about it: the volume, the utility, the urge for regulations. We can already see projects bringing TradFi onchain, so this expectation is not hard to believe.\n\nExamples:\n- Ondo: Real World Assets\n- Sphinx Protocol: Commodities Onchain\n- xStocks on Solana, Robinhood stocks and ETFs on Arbitrum\n- Rumors of countries launching their CBDCs on their own Cosmos appchains, Ethereum, or Solana.\n\nSource: https://x.com/i/status/1997128653650657338", "lang": null, "likes": 69, "replies": 27, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pg7po3/sec_chair_paul_atkins_all_us_markets_will_be_on/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pfv2gm", "author": "aharwelclick", "handle": "aharwelclick", "created_utc": 1765042828.0, "text": "In 2016 BTC rallied - Christmas Day: ~$896 What is that like 10 years go only?\n\n\n2016 (The Bull Run Beginnings): Bitcoin was in the middle of a strong uptrend leading into the 2017 mania.\n• Dec 20: ~$790\n• Christmas Day: ~$896\n• Dec 29: ~$969\n• Result: Price increased by over 20% during the holiday week.\n\n\n\nPeople that try to scare you about btc don't let them. BTC  is a money making algorithm that will suck in the entire world's wealth one day.", "lang": null, "likes": 0, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pfv2gm/in_2016_btc_rallied_christmas_day_896/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pfp5cl", "author": "Original-Assistant-8", "handle": "Original-Assistant-8", "created_utc": 1765027213.0, "text": "Why Vitalik believes quantum computing could break Ethereum’s cryptography sooner than expected \"In other words, he is thinking like a safety engineer. You do not evacuate a city because there is a 20% chance of a major earthquake in the next decade, but you do reinforce the bridges while you still have time.\"\n\nThis is exactly what every system worldwide using ecdsa and rsa encryption should be doing.  For crypto, that is how we securely sign transactions today.\n\nUpgrades need to happen. The risk, perceived or real, simply cannot be ignored.", "lang": null, "likes": 70, "replies": 35, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pfp5cl/why_vitalik_believes_quantum_computing_could/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pfn402", "author": "BONESHAKER50031", "handle": "BONESHAKER50031", "created_utc": 1765020400.0, "text": "✅ BTC/USD Technical Analysis (4H + 1H Confluence) ✅ BTC/USD Technical Analysis (4H + 1H Confluence)\n\nPattern: Symmetrical triangle forming inside a larger macro downtrend\nKey lines:\n\nDescending trendline resistance → around $92,000 – $94,000\n\nAscending support line → around $87,000 – $85,500\n\n\nBitcoin is currently moving inside a tight apex, meaning a breakout is coming soon.\n\n\n---\n\n📌 4H Chart Overview\n\nBearish structure still intact\n\nBTC is still respecting the major descending trendline since early November. Each retest of that line has caused a selloff.\n\nCurrent Position:\n\nPrice is inside the triangle and slightly pulling back after touching the resistance line near $92,000.\n\nIf price breaks above that level with high volume, momentum flips bullish.\n\n\n---\n\n📌 1H Chart Overview\n\nThe 1H chart shows a smaller ascending channel forming from the November 19th low. This creates bullish pressure from below while the macro downtrend caps the upside.\n\nThis squeeze normally leads to a strong breakout.\n\n\n---\n\n🟩 SAFE ENTRY LEVELS\n\n✅ Entry 1 – Aggressive Buy (Support Bounce)\n\nBuy Zone: $87,000 – $85,500\nWhen BTC taps the ascending support line.\n\nWhy:\n\nMultiple responses at this level\n\nVolume spikes on past bounces\n\nLower risk, tighter SL\n\n\nStop-Loss: $84,300\n\n\n---\n\n✅ Entry 2 – Breakout Buy (Confirmation)\n\nBuy Above: $92,800 – $93,200\nWait for a breakout + retest of the descending trendline.\n\nWhy:\n\nBreak of the macro trendline\n\nConfirmed shift to bullish trend\n\nGood for safer traders\n\n\nStop-Loss: $90,500\n\n\n---\n\n🔻 SAFE SELL (SHORT) ENTRY\n\n❌ Short Entry – Trendline Rejection\n\nIf BTC touches $92,000 – $93,000 and gets rejected:\n\nEntry to Short: $91,800 – $92,500\nStop-Loss: $93,800\nTake-Profit:\n\n1. $89,500\n\n\n2. $87,500\n\n\n3. $85,800\n\n\n\n\n---\n\n🎯 TAKE PROFIT TARGETS (FOR LONGS)\n\nTP for Bounce Entry:\n\n1. TP1: $89,500\n\n\n2. TP2: $92,000\n\n\n3. TP3: $94,800 (if a breakout occurs)\n\n\n\nTP for Breakout Entry:\n\n1. TP1: $95,500\n\n\n2. TP2: $98,800\n\n\n3. TP3: $102,000+ (if volume is strong)\n\n\n\n\n---\n\n⚠️ RISK WARNING\n\nThis setup is valid as long as BTC stays above $85,000.\nIf it breaks below that → expect $82,000 – $80,000 area next.", "lang": null, "likes": 4, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pfn402/btcusd_technical_analysis_4h_1h_confluence/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pfl1tp", "author": "Loirbj", "handle": "Loirbj", "created_utc": 1765012538.0, "text": "What BTC price do you imagine for 2027, and why? I’m not asking for financial advice or exact targets, just your personal scenarios.\n-Do you see Bitcoin below 50k, around the current range, or above 200k by 2027?\n-What are the main factors you think will drive it there (macro, ETFs, regulation, halving cycles, adoption, something else)?\nFeel free to share your bullish, bearish or neutral view, as long as you explain the logic behind it. The goal is to understand how the community thinks about the next cycle, not to guess a magic number.\nIf their still has a cycle for you guys.", "lang": null, "likes": 11, "replies": 32, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pfl1tp/what_btc_price_do_you_imagine_for_2027_and_why/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pfiprg", "author": "sylsau", "handle": "sylsau", "created_utc": 1765003630.0, "text": "One of the most interesting datapoints indicating a Bitcoin bear market is Dolphin Balance growth slowing down and crossing below trend. At the peak, these addresses added 965K Bitcoin YoY. It is now at 694K. This address cohort includes ETFs and Treasury companies, which have also stopped buying.", "lang": null, "likes": 1, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pfiprg/one_of_the_most_interesting_datapoints_indicating/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pfdjgq", "author": "tornavec", "handle": "tornavec", "created_utc": 1764986894.0, "text": "Bitcoin's Investment Future Now Rests on MicroStrategy's Health JPMorgan analysts claim that, in the near future, the price of Bitcoin will be more dependent on the financial strategy of MicroStrategy (MSTR) than on the actions of miners. The key indicator is the ratio of the company's value to the volume of its Bitcoin reserves. \n\nAs long as this ratio remains above one — the current value is 1.13 — the risk of the largest corporate holder being forced to sell cryptocurrency to cover its debts remains minimal. The company's fiat reserve of $1.44 billion provides an additional safety cushion.\n\nMiners are certainly under pressure: the estimated cost of mining is $90,000, forcing high-cost players to sell coins at current prices. However, experts consider this factor to be less important than the stability of MSTR's share price. \n\nInterestingly, the success of MicroStrategy's Bitcoin accumulation strategy hinges on JPMorgan. If the bank excludes MSTR shares from the MSCI index in January, the shares will continue to depreciate and the Bitcoin price will plummet too.\n\nNevertheless, JPMorgan analysts remain optimistic, expecting the first cryptocurrency to reach $170,000 within six to twelve months. Could this be considered insider information, providing an excellent opportunity to buy MSTR and BTC while they are low?", "lang": null, "likes": 14, "replies": 17, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pfdjgq/bitcoins_investment_future_now_rests_on/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pf7odh", "author": "Impossible-Band-2393", "handle": "Impossible-Band-2393", "created_utc": 1764971158.0, "text": "Gold and Silver Outperform Bitcoin as Fed Uncertainty Drives Market Rotation Precious metals have outshined Bitcoin in yearly performance, with silver and gold delivering impressive returns of 86% and 60%, respectively, while Bitcoin slipped into the red with a -1.2% return, according to Yahoo Finance.\n\nThis shift comes as traders brace for potential missteps by the Federal Reserve ahead of the December 10 interest rate decision. Ryan McMillin, CIO at Merkle Tree Capital, points to a mix of monetary debasement fears, macro uncertainty, and inconsistent central bank signals as key drivers behind the metals' strength. \n\nMcMillin notes that investors are preparing for a possible policy error where the Fed may begin cutting rates while inflation remains above the 2% target.\n\nWith capital rotating toward U.S. equities, I’ve been exploring stock futures more closely. Bitget stock futures platform offers an easy entry point for traders, with a $10 bonus and 90% off fees making it a low-risk way to diversify and learn as market dynamics shift.\n\nIn this environment, flexibility is everything.", "lang": null, "likes": 2, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pf7odh/gold_and_silver_outperform_bitcoin_as_fed/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pev529", "author": "Excellent_8740", "handle": "Excellent_8740", "created_utc": 1764941528.0, "text": "Crypto Market Outlook, What Could Happen Next? The cryptocurrency market has been extremely volatile, BTC is around $90K, down about 30% from its October high of $126K, ETH sits at $3,100, and most altcoins are underperforming SOL at $136, XRP $2.06, and the Total market capitalization is near $3T after losing over $1T in recent months, with trading volume around $135B and liquidations at $608M.\n\nMacro factors seems not helping, and i dont know where Fed rate cut expectations are going, Bitcoin ETFs continue to see outflows, and broader risk sentiment remains cautious. At the same time, whales are accumulating BTC, and XRP is seeing inflows, while institutional interest is still present, but Does this indicate short term weakness with potential for a rebound if key supports hold, or are their further corrections likely?\n\nOn a related note, going deep about the crypto news though I don’t usually follow traders, but I’ve noticed Asiftahsin going livestreams on bitget and, and uptil now i couldnt say why some people are finding his analysis useful to the extent of joining the 10x challenge but does he really deserve the attention and subscriptions he’s getting, or is it just hype? I’m curious what others think while we try to see where this market is actually heading to?", "lang": null, "likes": 6, "replies": 20, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pev529/crypto_market_outlook_what_could_happen_next/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pepgve", "author": "sylsau", "handle": "sylsau", "created_utc": 1764921779.0, "text": "The Architecture of Denial: What 1995 Internet Skeptics Teach Us About 2025 Bitcoin Critics. The Gen-Z kids are right. The English professors were wrong. And the history of the future belongs to the users, not the observers.", "lang": null, "likes": 1, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pepgve/the_architecture_of_denial_what_1995_internet/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pe8fr2", "author": "vinayraval007", "handle": "vinayraval007", "created_utc": 1764874501.0, "text": "🇺🇸 CFTC announces spot Bitcoin and crypto can now trade on CFTC-registered exchanges 👀  🇺🇸 CFTC announces spot Bitcoin and crypto can now trade on CFTC-registered exchanges 👀\n\nCFTC said this is to help make America the crypto capital of the world.", "lang": null, "likes": 2, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pe8fr2/cftc_announces_spot_bitcoin_and_crypto_can_now/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pe1u8e", "author": "fortune", "handle": "fortune", "created_utc": 1764859626.0, "text": "Michael Saylor's Strategy may have BlackRock to thank for the 11% rise in Bitcoin | Fortune", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pe1u8e/michael_saylors_strategy_may_have_blackrock_to/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pdzzce", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1764854859.0, "text": "Bitcoin is down nearly 30% from its record high — history shows that's normal", "lang": null, "likes": 46, "replies": 9, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pdzzce/bitcoin_is_down_nearly_30_from_its_record_high/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pdujcn", "author": "sylsau", "handle": "sylsau", "created_utc": 1764835828.0, "text": "The Missing Piece: How Bitcoin Solves the AI Economic Paradox. We are transitioning from a Type 0 civilization (based on chemical propulsion and fiat money) to a Type I civilization (based on renewable energy, AI, and sound money).", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pdujcn/the_missing_piece_how_bitcoin_solves_the_ai/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pdrkif", "author": "MarketFlux", "handle": "MarketFlux", "created_utc": 1764825394.0, "text": "Ethereum Fusaka Upgrade Goes Live on Mainnet Ethereum has officially activated its highly anticipated Fusaka upgrade on the mainnet, marking another major milestone in the network’s multi-year roadmap toward greater scalability, efficiency, and user experience. The upgrade rolled out smoothly, with validators reporting stable performance and no notable disruptions during activation.\n\nFusaka introduces several key enhancements aimed at reducing network congestion and improving transaction throughput. Among the most notable changes are optimizations to block processing, more efficient state management, and refinements to Ethereum’s execution layer all designed to deliver noticeably faster transaction speeds and lower latency for users and developers.\n\nThe upgrade also lays foundational improvements for future scalability initiatives, including upcoming roadmap items tied to proto-danksharding and long-term data-availability solutions. Developers say Fusaka serves as another building block toward Ethereum’s vision of becoming a high-performance, globally accessible settlement layer.\n\nWith Fusaka now live, users can expect more responsive decentralized applications, potentially lower gas volatility during peak periods, and a more seamless experience across the ecosystem. The Ethereum Foundation noted that ongoing monitoring will continue, but early signals point to a stable and successful transition.", "lang": null, "likes": 6, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pdrkif/ethereum_fusaka_upgrade_goes_live_on_mainnet/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pdp9wf", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1764818490.0, "text": "Bitcoin just got completely absorbed by traditional finance and it happened in like nine days. Between November 24 and December 2nd we saw three massive moves. JPMorgan filed to launch leveraged products tied to BlackRock's Bitcoin ETF. Nasdaq proposed to quadruple the limits on Bitcoin ETF options from 250,000 to 1 million contracts. Then Vanguard, who always said no to crypto, suddenly reversed course and opened Bitcoin and other crypto ETFs to their \\~50 million clients on a platform that oversees around $11 trillion.\n\nThis is wild because Vanguard's leadership was publicly against Bitcoin ETFs just last year. Now they’re effectively offering access to spot Bitcoin exposure to tens of millions of investors. Bank of America is letting 15,000 financial advisors recommend Bitcoin starting January 2026 with allocations between 1 to 4 percent of portfolios.\n\nWhat makes this interesting is the timing. This all happened while retail investors were panic selling and getting rekt. Institutions basically waited for retail to capitulate then swooped in with their infrastructure fully built out. Sovereign wealth funds like Abu Dhabi Investment Council increased their Bitcoin positions as regular people were exiting.\n\nBut here’s the catch – while institutions are embracing Bitcoin through ETFs and derivatives, index providers like MSCI are simultaneously trying to exclude companies like Strategy that buy Bitcoin directly for their treasuries. MSCI proposed removing these companies from major indices, which would force them out of a lot of passive funds.\n\nso bitcoin is getting institutionalized but mainly through fee generating products that banks and asset managers control. the original model of companies holding bitcoin directly on balance sheets is facing obstacles, while ETF models that generate recurring revenue for financial firms are getting pushed hard.\n\nif you’re actually trying to see how that shows up in your own taxes and portfolio (ETFs vs holding btc / eth outright) messing around with something like awaken tax is way more useful than doomscrolling headlines ngl it at least forces you to see how your “btc exposure” is split between fee products and actual coins.\n\nBitcoin was supposed to work around the traditional system but now it’s basically being absorbed into it.\n\nThoughts on this shift?", "lang": null, "likes": 326, "replies": 81, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pdp9wf/bitcoin_just_got_completely_absorbed_by/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pd4l86", "author": "Arun_Bath", "handle": "Arun_Bath", "created_utc": 1764769593.0, "text": "What is happening with crypto??? Alright guys, I want to make it clear that I’m very new to crypto space and don’t know much about it. I know the basics and fundamentals ofc, but didn’t dig deep in it. I’m trading indices mostly intraday, but wanted to start trading crypto just to see how it goes, and oh my god, it’s so volatile and random. I didn’t quite understand where the bitcoin dump came from, like what caused such big dump like that? I tried to read some articles but they weren’t clear. They had tons of words, but didn’t catch the meaning… And when do you guys think bitcoin will fully recover? because it looks like bitcoin is in a strong uptrend.", "lang": null, "likes": 9, "replies": 65, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pd4l86/what_is_happening_with_crypto/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pd2eks", "author": "EmergencyNo112", "handle": "EmergencyNo112", "created_utc": 1764763556.0, "text": "Complete beginner to Crypto. Where do I begin? Like a beginner in every field, I’ll sound weird and unserious and I know I’ll get a variety of opinions here and even be barred in entering by people not guiding me or not helping me out with expert knowledge but I genuinely want to get into this. What I’m looking for is a side hustle which might(emphasis on might) potentially end me up with decent wealth. I simply can’t get into a lot of side hustles because they don’t align with my mind, I’m great with strategy based work. I’ve heard however that Crypto and Trading are gambling, is that true? What I do know is how the currencies work, Bitcoin, Ethereum and XRP and I have a Binance account as well. Plan to put in just $100 and just do whatever happens with it. So can anybody help me to learn this or what platforms/channels/courses can I use to learn and then later trade with the strategies I learn. Do you guys think I should look into Stocks/Trading instead?", "lang": null, "likes": 13, "replies": 61, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pd2eks/complete_beginner_to_crypto_where_do_i_begin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pd0zp7", "author": "sylsau", "handle": "sylsau", "created_utc": 1764758763.0, "text": "The Giant's Awakening: Bitcoin Reclaims $90K – Analysis, Stakes, and Outlook for Year-End 2025.", "lang": null, "likes": 4, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pd0zp7/the_giants_awakening_bitcoin_reclaims_90k/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pczsx5", "author": "sylsau", "handle": "sylsau", "created_utc": 1764754271.0, "text": "🇺🇸 Bank of America will allow its wealth advisors to recommend an allocation of 1% to 4% to crypto assets, starting in January. The bank's advisors will initially focus on four spot bitcoin ETFs, including BlackRock's IBIT and Fidelity's FBTC.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pczsx5/bank_of_america_will_allow_its_wealth_advisors_to/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pcyh3e", "author": "ItzDurjoy", "handle": "ItzDurjoy", "created_utc": 1764749064.0, "text": "Bitcoin leaps back above $93k amid regulatory optimism, Fed cut hopes Reports attributed much of the strength to remarks from U.S. Securities and Exchange Commission (SEC) Chair Paul Atkins, who reiterated that the agency plans to roll out a new regulatory framework, including a proposed “innovation exemption,” to accommodate digital-asset firms.\n\nThe exemption is expected to provide more clarity and flexibility around issuance, custody, and trading of crypto assets as the agency works to modernize rules.\n\nAt the same time, institutional adoption received a boost after Vanguard, the world’s second-largest asset manager, reversed its earlier stance and announced that it will allow trading of cryptocurrency-focused ETFs and mutual funds on its brokerage platform starting this week.\n\nThe move expands access to regulated exposure for millions of investors and underlines growing acceptance of crypto products by mainstream finance.\n\nInvestors also assessed hiked bets on a Federal Reserve rate cut next week, adding to Bitcoin’s appeal as a risk asset priced in dollars.", "lang": null, "likes": 0, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pcyh3e/bitcoin_leaps_back_above_93k_amid_regulatory/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pcxwfn", "author": "sylsau", "handle": "sylsau", "created_utc": 1764746911.0, "text": "Bitcoin: The Thermodynamic Truth in a World of Political Noise. The energy-to-money convergence is the single largest macro transition of the century. The endgame is always the same: Energy → Computation → Bitcoin.", "lang": null, "likes": 5, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pcxwfn/bitcoin_the_thermodynamic_truth_in_a_world_of/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pcwy4y", "author": "Stock_Historian5617", "handle": "Stock_Historian5617", "created_utc": 1764743468.0, "text": "Bitcoin to the moon We going to see 200k usd soon boys.  Crypto winter was over, just a little 48 hour winter. We are now going to the moon", "lang": null, "likes": 56, "replies": 65, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pcwy4y/bitcoin_to_the_moon/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pcuxtc", "author": "Affectionate_View_46", "handle": "Affectionate_View_46", "created_utc": 1764736893.0, "text": "Retail Is Dead, Institutions Will Rise: Understanding the Next Global Crypto Bull Market **Conclusion first:** The next three years will be an institution-driven bull market. This marks the moment when **crypto and blockchain officially enter the balance sheets of Wall Street**, bringing about true mass adoption—not through a bottom-up de-central-bank revolution, but a **top-down financial infrastructure upgrade**.\n\nRetail traders are like the tide; institutions are the sea.  \nThe tide retreats. The sea does not.\n\n# Reviewing 2025: The \"First Year of Institutions\n\n* **Inflow Source:** Almost all major capital flowing into **BTC/ETH** in 2025 came from institutions (67% of allocation), not retail. Retail traders focused on meme/altcoins.\n* **Key Drivers:** The explosion of **ETFs** (holding 5.7%–7.4% of circulating BTC supply) monopolized Bitcoin's primary inflow routes.\n* **Market Formation:** Low tradable supply (due to ETF custody) combined with continuous institutional buying created a **liquidity-shock bull market**.\n* **Institutional Catalyst:** **U.S. regulatory clarity** (stablecoin laws, ETF approvals) enabled legal, compliant, and scaled institutional entry to meet massive demand (estimated 80:1 demand-supply ratio for BTC).\n\n# The Trillion-Dollar Impact\n\n* **Financial Scale:** Institutions control 70–80% of the $600T+ global investable assets. A mere **1% portfolio reallocation** from this pool could **double BTC's market cap** (trillions of dollars).\n* **Core Narrative:** This shift makes **Real World Assets (RWA)** the core narrative of the next cycle.\n\n# Long-Term Roles of Major Assets\n\n* **BTC:** Becomes the **Digital Gold** and an institutional reserve asset, driving slow, trend-driven price movements.\n* **ETH:** Becomes the **\"Equity Asset\"** of the global on-chain economy, valued based on network scale and usage, offering staking yield (dividends).\n\n# Opportunity &amp; Strategy Shift\n\n* **Retail's New Role:** Retail transitions from **narrative makers to price followers**. Strategies must shift from emotion/short-term speculation to **following major structural flows** and cross-cycle investing.\n* **Key Growth Sectors (VCs &amp; Founders):**\n   1. **Enterprise/Institutional Blockchains:** Private, compliant chains (like Hyperledger) for bank settlement and pensions.\n   2. **Bridging + ZK:** Essential for connecting private enterprise chains with public chains (RWA ↔️ public crypto).\n   3. **Custody &amp; Asset-Management Tools:** Platforms like Fireblocks and Copper.\n   4. **RWA &amp; Settlement Layers:** Tokenizing Treasuries, private credit, and creating on-chain SWIFT equivalents.\n\n**Final Conclusion:** The next bull market is an **upgrade to the global financial system**, not a revolution. Retail influence on major-coin prices will hit all-time lows. Success for retail means **understanding capital logic** and positioning for structural, enterprise-driven infrastructure trends.", "lang": null, "likes": 0, "replies": 7, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pcuxtc/retail_is_dead_institutions_will_rise/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pcs34j", "author": "Zealousideal_Rain_79", "handle": "Zealousideal_Rain_79", "created_utc": 1764728693.0, "text": "Bitcoin just bounced hard from yesterday’s dump and shot back above $90K, here’s why: - **Fed liquidity boost:**\n\nThe Fed just ended QT and injected $13.5B+ via repos. Historically, anytime the Fed turns the liquidity taps back on, BTC rallies.\n\n- **Vanguard finally opened the gates:**\n\nThe $11T asset manager now allows clients to buy BTC ETFs. This signals massive potential inflows from the most conservative money on Wall Street.\n\n- **Technical snapback:**\n\nYesterday’s dump filled a ton of unfilled bids, shorts got blown out, and low exchange reserves kept selling pressure weak.\n\n- **Whale activity and institutional buying:**\n\n\n- **WINTERMUTE** bought 8,577 BTC\n- **BINANCE** bought 7,658 BTC\n- **WHALE WALLET** bought 6,610 BTC\n- **COINBASE** bought 5,860 BTC\n- **BITMEX** bought 5,818 BTC\n- **BITFINEX** bought 5,778 BTC", "lang": null, "likes": 344, "replies": 81, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pcs34j/bitcoin_just_bounced_hard_from_yesterdays_dump/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pcryuo", "author": "Stock_Historian5617", "handle": "Stock_Historian5617", "created_utc": 1764728360.0, "text": "Why bitcoin mooning again Where the bare market go lol??\n\nBitcoin to the moon!!!\n\nAll those people liquidated for nothing.. if this ain't manipulation i don't know what is", "lang": null, "likes": 0, "replies": 13, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pcryuo/why_bitcoin_mooning_again/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pclonw", "author": "Burbakk", "handle": "Burbakk", "created_utc": 1764712228.0, "text": "Is it a Sign of Bear Market? Michael Saylor's 'Strategy' says it may be forced to sell Bitcoin if there's \"literally a three-year sustained down cycle.\"", "lang": null, "likes": 0, "replies": 26, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pclonw/is_it_a_sign_of_bear_market/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pcg5hw", "author": "Ill-Medicine-7496", "handle": "Ill-Medicine-7496", "created_utc": 1764699876.0, "text": "MicroStrategy just quietly killed the biggest 2025–2026 FUD with cold hard cash (and why BTC price action feels different this cycle) I was up late last night double-checking the latest filings because the “they’ll have to sell BTC every quarter for the $750 M dividend” narrative was still driving me nuts. Turns out Saylor already solved it months ago and barely anyone noticed: Strategy has a dedicated $1.44 billion USD dividend reserve in plain old cash and cash equivalents. That’s almost two full years roughly 23 months of the entire preferred dividend obligation covered in fiat, zero Bitcoin required.  \n\nIt’s actually kind of hilarious how over-prepared they were; they raised extra on purpose, parked it in dollars, and just let the loudest bear case of the year die of natural causes. No wonder the stock barely flinches on red days anymore and the gamma feels unbreakable this cycle. The forced-seller risk that haunted 2021–2024 is legitimately gone until late 2027 at the earliest.\n\nPersonal aside while I’m here same late night session I also opened one of those Bitget onchain Mystery Boxes I keep a small futures position open there for hedging. Literally $500–600 in volume this month and I still got 22 USDT plus a random token drop. If you already trade on Bitget it’s the easiest free roll I’ve seen in a while and even tiny retail volume qualifies. Feels like the whole market is shifting toward real holders getting the small edges this time around.", "lang": null, "likes": 31, "replies": 14, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pcg5hw/microstrategy_just_quietly_killed_the_biggest/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pcdn26", "author": "Beneficial-Ad-9986", "handle": "Beneficial-Ad-9986", "created_utc": 1764694452.0, "text": "I tested a simple $50 per month DCA strategy from 2015 to 2025. The long term results were interesting. Not financial advice just sharing something I’ve been analyzing for a while.\n\nI wanted to see what happens if someone invests only **50 USD per month** consistently for ten years without timing the market.\n\nSo I tested three simple pillars:\n\n• **Bitcoin**  \n• **VOO / VTI** (S&amp;P 500 index ETFs)  \n• **Gold** (physical or GLD)\n\nNo trading.  \nNo leverage.  \nNo trying to catch bottoms or tops.  \nJust pure, boring consistency.\n\nHere’s what stood out:\n\n• Stocks grew slowly but extremely steady  \n• Gold protected purchasing power during inflation spikes  \n• Bitcoin had the highest long term growth even with multiple crashes  \n• But the **combined portfolio** had the best balance between drawdowns and returns\n\nThe biggest lesson for me:  \nSometimes the simplest plan is the easiest to stick to emotionally.\n\nIf anyone’s interested I can share more details or the full breakdown.", "lang": null, "likes": 47, "replies": 51, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pcdn26/i_tested_a_simple_50_per_month_dca_strategy_from/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pccmfx", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1764692212.0, "text": "Stocks Climb as Bitcoin Gets Reprieve From Selling: Markets Wrap", "lang": null, "likes": 2, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pccmfx/stocks_climb_as_bitcoin_gets_reprieve_from/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pc2rau", "author": "Ok_Dress1423", "handle": "Ok_Dress1423", "created_utc": 1764662189.0, "text": "Did I get scammed Let me start by saying I probably should’ve made this post before I made any kind of investment. But we live and we learn I guess. So recently I sold a necklace to invest into this defi project, it seemed to be going fine. Then all of a sudden there was a “task” that I needed to complete by depositing $3500 more and I would receive a free ethereum. So I borrow money from family and a friend and I completed the task and received my ethereum reward. So now the issue is I’m trying to withdraw my USDT funds and they are saying I need to pay tax because defi is under the new tax regulation law whatever that means. So I’m not sure what I should do honestly, Christmas is around the corner and I really have no idea how I’m going to pay back my uncle and friend. I thought it would’ve went smooth and I was going to pay them back quicker than I imagined. The tax is $1800 I was thinking of pawning my computer to pay the tax but I really don’t want to do thank have a weird gut feeling.", "lang": null, "likes": 5, "replies": 98, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pc2rau/did_i_get_scammed/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pc21bx", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1764659423.0, "text": "BTC, ETH, ADA, XRP Price Warning: Bitcoin Might Fall to $65,000, Spelling Doom For Alts", "lang": null, "likes": 83, "replies": 58, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pc21bx/btc_eth_ada_xrp_price_warning_bitcoin_might_fall/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pbz9be", "author": "Outsmartde", "handle": "Outsmartde", "created_utc": 1764650161.0, "text": "What factors move BTC price? To all you Bitcoin traders, what factors move BITCOIN price actions. I know \n\n1. Bitcoin is correlated to NASDAQ\n2. Bitcoin is inversely correlated to 10-year treasury yields\n3. Bitcoin previously had correlation to gold\n3. Bitcoin ETF flow drives prices\n\nWhat else am I missing here or have I covered everything? Does S&amp;P500 affect Bitcoin prices too?", "lang": null, "likes": 12, "replies": 36, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pbz9be/what_factors_move_btc_price/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pbolvd", "author": "fortune", "handle": "fortune", "created_utc": 1764622622.0, "text": "Bitcoin takes another plunge, chances of reclaiming $100,000 by year end drop to 24% on prediction markets | Fortune", "lang": null, "likes": 100, "replies": 49, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pbolvd/bitcoin_takes_another_plunge_chances_of/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pbhuqz", "author": "Decentralization-God", "handle": "Decentralization-God", "created_utc": 1764607781.0, "text": "Crypto Cycle Rationale I would find interesting to read well argumented  opinions on “crypto cycle” as this whole thing is or always was IMO kind of “artificial”. \n\nIn general I am crypto friendly person, and have  some investments, but I also want to be strictly rational investor and not a narrative-driven.\n\nIn past, there obviously were those cycles whose fundamental part (or cause?) was bitcoin halving event and its consequences. Also while there are no technical dependencies between Bitcoin and all those alt coins, there is actually super-strong dependency and everyone can see how precisely all altcoins copy bitcoin (with exception here or there). This is a clear evidence of still speculative component in price, and very little value. If trust in bitcoin shakes, whole industry shakes - a dominantly trust based “asset class” as the real use and value still needs to be developed. \n\nBut what about that cycle, which seems to be broken now? \n\nIMO the cycle was kind of convention created by bitcoin community - and it was passed on newcomers. Since it is all mostly based on trust, this convention was kind of guide in terms of where we are - is it good to buy, enter or sell? It worked somehow. Also part of this cycle were those waves or sequence:\n\n1. Cash BTC\n2. Pump and dump ether\n3. Pump and dump altcoin1-n \n\nAll was like a scripted game which helped to navigate.\n\nBut this “seasonality” does not exist on WallStreet and in Fin industry at all. The speculation there is omnipresent but most assets have underlying value - commodities are best example and events affecting underlying value is what drives price movements adjusted by speculation and trading approaches. \n\nSo once these big institutional players went into bitcoin, many applauded as price went up. However “kids game/convention” was effectively broken as these guys do not follow some convention, cycle etc. They came with their very own rules!  \n\nIMO they did not join this game just to pump and dump massively this asset and “destroy” further adoption potential. \nTheir strategy is more long term and less about that massive volatility. They dont like huge crashes. IMO it is these guys who protected price from “cyclic crash” which they did not join, they bought the dips triggered by retailers etc. \n\nSo the game changed. That is my opinion, but I keep hearing those who still think all is the same and they rule the game - they believe in classic cycle, which is not reality any more IMO. \n\nSo folks, is my reasoning flawed or how do you see that?", "lang": null, "likes": 0, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pbhuqz/crypto_cycle_rationale/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pbgcj3", "author": "Bellar101", "handle": "Bellar101", "created_utc": 1764604419.0, "text": "December starts with red, and I am thinking of DeFi Staking like Mevolaxy As the crypto market starts the month of December with red, just as we saw in November, it gives me the impression that early next year market may do the same thing, and to prevent the temptation of selling my bag, I am thinking of keeping my bag while I still get a return from it through a platform like Mevolaxy staking which was said to be a US-based mevstake platform.\n\nAccording to what I read, the Mevolaxy platform is unique because it is flexible, supports all major blockchains like Arbitrum, has no restrictions, and allows users, even those who are new to cryptocurrency, to access mevbot and stake assets like ARB and receive consistent returns. I also read their report about giving users over US$3 million in June 2025.\n\nThe team was said to consist of DeFi specialists, marketers, product managers, cybersecurity engineers, financial analysts, and blockchain infrastructure developers. With many years of experience, the company's engineers work with high-load systems and advanced blockchain technologies from Ethereum, Solana, Arbitrum, zkSync, and other networks. What's your stance on the Mevolaxy . com  staking?", "lang": null, "likes": 6, "replies": 40, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pbgcj3/december_starts_with_red_and_i_am_thinking_of/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pbfgqs", "author": "TeaGroundbreaking306", "handle": "TeaGroundbreaking306", "created_utc": 1764602428.0, "text": "Bitcoin Beneficiary or Inflationary Victim?", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pbfgqs/bitcoin_beneficiary_or_inflationary_victim/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pbfgoh", "author": "sylsau", "handle": "sylsau", "created_utc": 1764602424.0, "text": "Stop Measuring Bitcoin in Years. Start Measuring in Blocks. Bitcoin has 6,930,000 blocks to process in its subsidy era. We are less than 15% of the way through that journey.", "lang": null, "likes": 5, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pbfgoh/stop_measuring_bitcoin_in_years_start_measuring/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pbbmdg", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1764592489.0, "text": "Crypto Starts December in the Red as Bitcoin, Ethereum Extend Sell Off Crypto markets opened the new month with more weakness, as Bitcoin and Ethereum both moved sharply lower on Monday. Bitcoin dropped over 5% and was trading around $86,435, while Ethereum slid more than 6% to roughly $2,843. The weakness wasn’t limited to the top two coins. Solana fell more than 7%, and broader altcoins followed the same trend Dogecoin slipped nearly 9%. The pressure extended to Asia as well, after the People’s Bank of China issued a warning about illegal digital currency activity, pulling down several Hong Kong–listed crypto-linked stocks. Market sentiment remains risk-off, and analysts say a large chunk of the move appears tied to liquidations. Ben Emons of Fedwatch Advisors told CNBC that a roughly $400 million exchange liquidation was a major driver of Monday’s downturn. He also pointed to the extremely high leverage still present on crypto exchanges, with some platforms offering up to 200x leverage. According to Emons, the amount of perpetual futures leverage outstanding estimated around $787 billion dwarfs ETF-linked exposure, and leaves the market vulnerable to more forced selling if prices remain weak. Bitcoin’s behavior continues to show stronger correlation with tech indexes, especially the Nasdaq, something that became obvious during October’s market slide. Emons also highlighted that the current environment is heavily driven by retail traders, which typically adds more volatility and faster reactions during sell-offs. Broader macro uncertainty isn’t helping either. Questions around U.S. interest rate cuts, combined with concerns about stretched valuations in the AI sector, added to November’s choppy action and crypto volatility has followed the same pattern. For now, analysts describe the setup as fragile, with sentiment still cautious and leverage remaining a key risk factor if prices fall further.", "lang": null, "likes": 6, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pbbmdg/crypto_starts_december_in_the_red_as_bitcoin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pban9i", "author": "Swiftvoyager1906", "handle": "Swiftvoyager1906", "created_utc": 1764589388.0, "text": "Will the concept of money as a currency really get replaced in the future? Came across this article stating Elon Musk predicts the death of money and that energy will eventually become the 'real currency', using Bitcoin as an example . Just one of his mad genuis rants, or is there some truth to it..  Sometimes I can't tell if we are moving forward or backwards in this society - we once traded goods through bartering, but eventually created a universal medium of exchange - currency. If we are goanna absolve this, are we are actually moving forward..or slipping backwards 🧐", "lang": null, "likes": 1, "replies": 8, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pban9i/will_the_concept_of_money_as_a_currency_really/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pb8kl2", "author": "Lovely_girl_18", "handle": "Lovely_girl_18", "created_utc": 1764581833.0, "text": "BTC stays strong above $80K Bitcoin is currently holding steady above 80,000 dollars,  what do you all think about that?Does anyone have a different perspective on Bitcoin?", "lang": null, "likes": 0, "replies": 19, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pb8kl2/btc_stays_strong_above_80k/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pb61k9", "author": "Stock_Historian5617", "handle": "Stock_Historian5617", "created_utc": 1764572191.0, "text": "It's a bad time to be trading Seeing as tokens are largely institution driven now they choose when the pumps and when the dumps happen. You can't rely on candle graphs anymore. Prove me wrong. Why do people still trade when bitcoin is basically as volatile as a memecoin right now?", "lang": null, "likes": 20, "replies": 35, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pb61k9/its_a_bad_time_to_be_trading/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pav3z5", "author": "hodorrny", "handle": "hodorrny", "created_utc": 1764540775.0, "text": "Are bitcoin whales actually hesitating right now or just playing it smart? the data looks weird Recent analysis from Joao Wedson is showing something a bit uncomfortable – wallets holding between 100 and 1,000 BTC have pretty much stopped adding. That band usually lines up with funds, desks and more “professional” money. Historically when these guys stop pressing the buy button for a while it hasn’t been a great vibe for price later.\n\nThe spooky part is it looks a lot like 2021. Back then the same wallet range cooled off on accumulation and a few months later we slid into a proper bear market. Not saying copy paste crash incoming but it’s one of those signals you don’t just ignore.\n\nBut there’s a twist here. After that December nuke where institutions dumped around 79,000 BTC and we got hit with roughly a 15% correction, some of the bigger players actually started buying back in. Over the last 30 days or so they’ve scooped up something like 34,000 BTC again which means at least some whales think these levels are decent entry or reload zones.\n\nSo on one side you’ve got those mid sized 100–1,000 BTC wallets acting cautious and on the other side you’ve got larger institutional guys quietly stacking the dip. The pause from the mid tier whales feels like weaker medium term demand but the bigger wallets stepping in should add some kind of floor underneath.\n\nThe annoying part is retail is still basically asleep. Most of this is just big wallets and structured money slapping each other around so price action feels less like a classic cycle and more like a liquidity game.\n\nAre whales positioning for something big or just managing risk after a crazy run up hard to say for sure but these mixed signals are definitely worth keeping an eye on", "lang": null, "likes": 1, "replies": 31, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pav3z5/are_bitcoin_whales_actually_hesitating_right_now/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pau90m", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1764538651.0, "text": "Strategy’s 48 billion usd bitcoin bet and the one time they’d actually sell strategy’s CEO just laid out the only scenario where they’d *actually* sell some of their bitcoin and it’s kinda wild\n\nphong le basically said they’d only even think about selling as a total last resort if two things happen **together**  \n1 their stock trades below the value of their bitcoin stack (mNAV drops under 1x)  \n2 they cant raise any new capital anymore equity debt preferreds nothing\n\ntheir whole model is built around the opposite situation when strategy trades at a premium they issue more shares or preferreds raise cash and use that to buy more bitcoin so each share ends up backed by more btc over time that’s what they keep calling “bitcoin yield per share”\n\nle also admitted that with something like 700 to 800 million dollars a year in preferred dividends and other payments to make if that equity premium disappears for long enough selling a bit of the stack can actually be the “mathematically right” move to protect existing holders and keep that btc yield per share story alive not some “we lost faith in bitcoin” moment just pure balance sheet math\n\nright now strategy holds almost 650k btc which is insane that’s about 48 billion usd of cost basis at roughly 74k per coin and close to 60 billion at recent prices so they’re literally the biggest corporate bitcoin holder on the planet\n\nto calm everyone down after the latest dump they rolled out this new btc credit or “credit dashboard” where they show how their debt and preferreds are covered at different bitcoin prices according to their own numbers they still have about 5.9x btc assets to convertible debt if btc just sits around their \\~74k average cost basis and even in a nasty 25k scenario they say it’s still about 2x coverage plus they keep bragging about a 70 plus year dividend runway at current prices\n\ntheir view on bitcoin itself hasnt really changed they’re still in the “scarce non sovereign asset that people everywhere reach for when their local money sucks” camp think us plus places like argentina or turkey where inflation is brutal\n\nthe whole thing is kinda crazy because most bitcoin maxis love to say “we’ll never sell” but here you’ve got a listed company with almost a 60 billion usd position openly spelling out the one situation where selling some coins is on the table i kinda respect that they at least admit there is a worst case playbook instead of pretending bitcoin magically removes the need for risk management feels very “grown up bitcoiner” energy tbh same kind of risk math vibe you see from nerdy tax and balance sheet people building stuff like awaken tax and koinly", "lang": null, "likes": 26, "replies": 14, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pau90m/strategys_48_billion_usd_bitcoin_bet_and_the_one/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1palpbj", "author": "eghoostly", "handle": "eghoostly", "created_utc": 1764518292.0, "text": "Stop trying to time the market My best advice is to dca, be long term and just ignore the fud for a few years and you will laugh to the bank. People playing options are gambling and looking for every little sign of a drop with conspiracy theories.\n\nBetting with options need serious research with big money not just 1 hour of googling and asking AI to support your ideas.\n\nEdit: Okay since this was too hard for people to understand. Let me make it clear, I’m not talking about shitcoins I’m talking about bitcoin/ Ethereum i do not believe in some random ”Trump” coin tbh. Nobody that bought at the top in 2021 are minus today. They were almost plus 100%. And if you’re talking about dips. Bitcoin just dipped 30% from the top like come on…\n\n\nEdit again: i tried to tell you to dca i really tried.. you had the chance of another 10% but you would only tell me ”I will time bitcoin” 😩", "lang": null, "likes": 17, "replies": 36, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1palpbj/stop_trying_to_time_the_market/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pal4sw", "author": "spriteMeLeukoKrasi", "handle": "spriteMeLeukoKrasi", "created_utc": 1764516876.0, "text": "It's crazy to think it's over with what's coming! I can't believe people think it's over. Every major altcoin has been making real progress, even as their charts seem to go from bad to worse.\n\nChainlink has been doing an amazing job partnering with banks. Cosmos has connected to EVM via IBC, a real bridge and not centralized infrastructure. Ondo is working on RWA (Real World Assets) with serious backing from BlackRock and others. Solana is generating impressive revenue, proving it can handle high levels of activity. And let's not forget future projects like Sphinx Protocol, which aims to bring commodity derivatives onchain, solving real problems for plebs like me who want exposure to assets like gas or oil.\n\nLong-term, I only see an uptrend, and I'm not just talking about BTC here, but many alts as well. A lot of them have already proven they're decentralized enough to survive and thrive, just like Bitcoin.", "lang": null, "likes": 148, "replies": 147, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pal4sw/its_crazy_to_think_its_over_with_whats_coming/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pabm3q", "author": "sylsau", "handle": "sylsau", "created_utc": 1764485090.0, "text": "The Great Absorption: How Wall Street is Engineering the Capture of Bitcoin. Bitcoin was created to destroy the intermediaries. The intermediaries have responded by buying Bitcoin. The game hasn’t ended; it has just moved to the boss level.", "lang": null, "likes": 3, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pabm3q/the_great_absorption_how_wall_street_is/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1pa3c4k", "author": "Superchief440", "handle": "Superchief440", "created_utc": 1764459699.0, "text": "Fat-Fingered Robinhood Bitcoin Limit Order So I was buying some Bitcoin yesterday on the dip and entering $250 limit orders under the current market price.  BTC was trading for about $90,150 @ at the ask and it was my intention to place a limit order with a Target price of 90,100, or $50 below the current ask. I mistakenly fat fingered the order for 91,000 rather than $90,100.  \n\nNow I have traded with Schwab for many years and if you ever enter a limit order above the current ask you get a warning that your order May immediately execute as it is above the current ask. No warning for me on Robinhood and you guessed it, the order filled at 91,000, which was $850 over the current ask at the time. Not used to being completely ripped off I was flabbergasted. I contacted support and finally got through to an agent who gave me three paragraphs of gobbledygook about it being totally my fault and that I was properly filled at the best available price at the time which just happened to be my limit price which was $850 over the current ask. I asked them exactly who scooped my order and pocketed the hefty premium and the agent broke off the chat.  \n\nYes, I made a mistake. No I did not expect to be completely taken advantage of and ripped off by an opportunistic broker. Is this not outright thievery or am I overreacting? I now trust Robin Hood about as far as I can throw Vlad. I will definitely be taking all my crypto business elsewhere. Please be forewarned when entering limit orders. Robin Hood does not have your back.\n\nWhat are your suggestions for a new crypto broker? I already have a Strike account for Bitcoin but am interested in any other recommendations. Thank you.", "lang": null, "likes": 0, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1pa3c4k/fatfingered_robinhood_bitcoin_limit_order/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p9ujyr", "author": "TeaGroundbreaking306", "handle": "TeaGroundbreaking306", "created_utc": 1764437290.0, "text": "Bitcoin Moat", "lang": null, "likes": 1, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p9ujyr/bitcoin_moat/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p9r1f6", "author": "0xskittycat", "handle": "0xskittycat", "created_utc": 1764428533.0, "text": "Bitcoin vs smart contracts If EVM smart contracts can encode any monetary policy, what actually prevents someone from recreating Bitcoin’s issuance model on Ethereum? We already see ERC-20s that copy supply caps or halving curves, yet none of them gain monetary credibility. What’s the structural reason an ERC-20 can’t function as a true Bitcoin competitor?\n\nTo me, this suggests the market is missing something fundamental and out of touch with the technology, because on paper, a Bitcoin-style asset on an EVM chain should come with several clear advantages.", "lang": null, "likes": 0, "replies": 42, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p9r1f6/bitcoin_vs_smart_contracts/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p9kjg1", "author": "sylsau", "handle": "sylsau", "created_utc": 1764407572.0, "text": "Red Alert or Opportunity of the Century? What Bitcoin History Tells Us About This Rare Signal. Bitcoin rarely offers such clear entry points after such violent corrections.", "lang": null, "likes": 0, "replies": 8, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p9kjg1/red_alert_or_opportunity_of_the_century_what/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p9jwd8", "author": "sylsau", "handle": "sylsau", "created_utc": 1764405152.0, "text": "The Funeral of \"Fundamental Value\": Why Bitcoin Breaks the Minds of Traditional Economists.", "lang": null, "likes": 0, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p9jwd8/the_funeral_of_fundamental_value_why_bitcoin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p9ecgc", "author": "hodorrny", "handle": "hodorrny", "created_utc": 1764386556.0, "text": "How Bitcoin turned its “strongest month” into its worst in 7 years... Bitcoin is having one of its worst Novembers since the 2018 bear market and here’s why it’s happening.\n\nSo far this month, Bitcoin is down roughly 17–20%, trading around the $90–92k range. That’s pretty close to the losses from November 2019, when BTC dropped about 17–18%. The worst November on record was back in 2018, with a brutal ~36% crash in the middle of that bear market.\n\nHistorically, November has actually been one of Bitcoin’s strongest months, with average returns around 40% in past cycles, so this kind of red November is a big break from the usual pattern. One major structural change this time around is that U.S. spot Bitcoin ETFs finally launched in January 2024, which pulled a lot of institutional money directly into BTC and may have shifted the timing of the typical post-halving “euphoria” phase.\n\nSince those ETFs went live, institutions and large funds have played a much bigger role in price action, and a lot of analysts think that’s changed the rhythm of this cycle. Instead of the classic script where October and November often rip higher, this year October already closed slightly red and November is now deeply negative despite that historically bullish seasonality.\n\nAnother huge factor has been leverage getting nuked. A ton of traders were running oversized long positions with borrowed money, and when the October and November sell-offs hit, billions of dollars in longs were force-liquidated. That cascade of liquidations amplified the downside and helped drive BTC from an all-time high around $126k in October down into the low $80ks at the worst point of this drawdown.\n\nSome analysts actually see this “flush” as a necessary cleansing process. It shakes out over-leveraged players and weak hands, kills off some of the froth, and can set up a healthier base for the next leg up once the market digests all the forced selling.\n\nOne interesting pattern from the last decade: every time Bitcoin has had a red November, December has also finished red. That doesn’t guarantee anything, but if that pattern holds and you combine it with the usual post-halving correction, it wouldn’t be shocking if real recovery takes time and stretches well into 2026 rather than bouncing straight back in the next few weeks", "lang": null, "likes": 43, "replies": 18, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p9ecgc/how_bitcoin_turned_its_strongest_month_into_its/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p9e46l", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1764385861.0, "text": "Some whale just dropped $84 million on a Bitcoin long position and everyone’s talking about it. A trader that on chain analyst The Data Nerd spotted just opened a massive BTC long on Hyperliquid.... about $84.19 million with 3x leverage. That’s not pocket change, that’s serious conviction that Bitcoin is heading up.\n\nWhat makes this interesting is the timing. Bitcoin is sitting around the low $90k range right now and has been pretty volatile lately. This trader is basically betting big that we’re going to see higher prices soon. The position uses leverage too, which means the gains could be huge but so could the losses if things go south.\n\nThe market has definitely been heating up. Daily BTC trading volume is in the high tens of billions of dollars right now, so there’s clearly a lot of activity and interest. Between whales, derivatives and bigger players still taking directional bets, there’s plenty of fuel for more volatility in both directions.\n\nThese kinds of whale moves usually create ripple effects. Other traders see this and it ends up influencing their decisions – sometimes it brings in more buyers, sometimes it just adds even more chaos to the price action.\n\nPersonally I think it’s wild to see someone throw that much money on a leveraged bet. One wrong move and that’s a massive liquidation. But clearly some people are still comfortable taking huge swings at these levels.\n\nAnyone else watching this play out What do you think happens next with Bitcoin", "lang": null, "likes": 44, "replies": 39, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p9e46l/some_whale_just_dropped_84_million_on_a_bitcoin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p98fj9", "author": "eghoostly", "handle": "eghoostly", "created_utc": 1764369809.0, "text": "A bet against bitcoin is a bet against god Remember a bet against bitcoin is a bet against god \n\nBitcoin Will go up forevermore\n\nRepeat after me", "lang": null, "likes": 0, "replies": 11, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p98fj9/a_bet_against_bitcoin_is_a_bet_against_god/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p93zh4", "author": "Comfortable_Fly_7943", "handle": "Comfortable_Fly_7943", "created_utc": 1764358663.0, "text": "Amundi Launches First Tokenized Euro Money Market Fund on Ethereum Amundi, Europe largest asset manager, has introduced a tokenized share class for its euro money market fund, marking a first in traditional finance integration with blockchain. This hybrid rollout allows investors to choose between the traditional fund and the blockchain based version recorded directly on Ethereum.\n\nThe first transaction was successfully executed on November 4, demonstrating that tokenized shares can coexist alongside traditional structures. The move reflects growing interest in leveraging blockchain for liquidity, transparency, and more flexible trading options.\n\nThe rollout was developed with CACEIS, a European asset servicing group, which provided the necessary tokenization infrastructure, investor wallets, and a digital order system to process subscriptions and redemptions. According to the companies, this setup helps streamline operations and widens access to new investor channels.\n\nTokenization also opens the door to 24/7 trading of traditionally static assets. Investors now have the ability to engage with money market funds in ways previously impossible, potentially increasing efficiency and broadening participation in a historically conservative segment. Platforms like bitget have also been experimenting with copy trading via GetAgent, allowing users to mirror strategies and trade tokenized or onchain assets, providing a parallel example of how blockchain tools are bridging traditional and crypto finance. Always DYOR before participating.\n\nOverall, Amundi’s tokenized fund represents a small but significant step toward integrating conventional finance with blockchain innovation. It’s a reminder that markets are evolving, and both institutional and retail participants are finding new ways to interact with assets.", "lang": null, "likes": 3, "replies": 4, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p93zh4/amundi_launches_first_tokenized_euro_money_market/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p8yy90", "author": "Red_rack13", "handle": "Red_rack13", "created_utc": 1764346874.0, "text": "Is This 'Relief Rally' Just a Trap? When Will the Real Trend Be Revealed? Hello everyone! We've recently seen a temporary spike in Bitcoin's price, which has raised hopes for many. However, I still believe this might just be a **\"Relief Rally\"** or a **Bear Market Rally**, and we could still be firmly within a larger downtrend.\n\n\n\n# The Big Question: Has the Market Truly Bottomed Out?\n\nThere's a crucial conflict here:\n\n1. **The Rally's Reality:** This temporary increase could be the result of short-covering and short-term trading activity. If key support levels fail (80K), the primary downtrend could resume.\n2. **The Role of Extreme Sentiment:** We know that when market sentiment becomes extremely negative and everyone gives up hope, that's often when a major **Bullish Reversal** occurs, and the market starts its journey toward a new All-Time High (ATH). This situation is commonly referred to as **\"Blood in the streets.\"**\n\n# The Current State: Neither Bull Nor Bear?\n\nRight now, I don't see the kind of extreme negative sentiment that would confirm we've hit the final bottom. There is some Fear, but not the widespread Panic or Despair needed for a massive reversal.\n\n* **The Market's Next Move:** After this rally, the price will likely enter a **Sideways Consolidation** phase.\n* **The Deciding Factor:** This consolidation period will be the key to determining whether we get **Bull Continuation** or **Bear Trend Continuation**. We will only be able to confirm whether we're heading toward new highs or sinking further down after observing the market's movement for a few more days/weeks.\n\n  \n**Are you currently seeing \"Extreme Despair\" in the market?** Or is more panic yet to come? What strategy are you adopting for this potential sideways period? (e.g., DCA, Sell the Rally, or Wait and See?)\n\n\\#Bitcoin #CryptoTA #BearMarketRally #Sentiment #BottomingOut #HODL", "lang": null, "likes": 1, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p8yy90/is_this_relief_rally_just_a_trap_when_will_the/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p8x1gx", "author": "YourInsider", "handle": "YourInsider", "created_utc": 1764342255.0, "text": "Bitcoin Eyes $100,000 Milestone Again: BTIG Analysts Predict Imminent Rally Amid Crypto Market Rebound Trading above $91,500 as of midday Friday, the world’s largest cryptocurrency is on the cusp of reclaiming its psychological $100,000 barrier, according to a fresh note from BTIG analysts", "lang": null, "likes": 5, "replies": 11, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p8x1gx/bitcoin_eyes_100000_milestone_again_btig_analysts/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p8vt3c", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1764339136.0, "text": "Whale Inflows Spike Again Is Bitcoin Setting Up for Another Pullback? Bitcoin is seeing renewed selling pressure after on-chain data showed over $7.5 billion worth of whale inflows moving into Binance over the last 30 days. These are large BTC deposits from wallets that typically hold long-term and when they start moving coins onto exchanges, it usually means one thing: they want liquidity. What’s catching attention is how closely this looks to March 2025, when a similar wave of whale deposits hit exchanges. Within weeks, BTC dropped from around $102K to $70K as selling pressure picked up. This current inflow trend is almost identical in size and pace. On-chain analysts are pointing out a few red flags: Exchange liquidity is rising, which makes big sell orders easier to execute. Spot trading volume is thinning, so whales have more influence over price swings. Derivative markets are cutting long exposure, showing a shift toward caution. Long-term holder supply is falling, meaning older coins are moving out of storage usually not a bullish sign. The $7.5B figure is now one of the largest 30-day inflows of the year, and if this pace continues, it could point to a broader risk-off setup. But to be fair, this doesn’t guarantee a crash whales also move funds for hedging, collateral, or arbitrage. For now, the market tone is defensive, with everyone watching whether BTC can hold key support levels. A clean break below recent lows could trigger a deeper correction, while a sudden shift to outflows would suggest accumulation instead of distribution.", "lang": null, "likes": 3, "replies": 20, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p8vt3c/whale_inflows_spike_again_is_bitcoin_setting_up/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p8sfvh", "author": "sylsau", "handle": "sylsau", "created_utc": 1764328819.0, "text": "The Geopolitics of Bitcoin is shifting right under our noses. Healthy adoption or quiet control? I’d love to hear your thoughts in the comments.", "lang": null, "likes": 0, "replies": 16, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p8sfvh/the_geopolitics_of_bitcoin_is_shifting_right/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p8pwiq", "author": "sylsau", "handle": "sylsau", "created_utc": 1764319063.0, "text": "Why Bitcoin is Inevitable (and a 500-Year-Old Law Proves It).", "lang": null, "likes": 0, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p8pwiq/why_bitcoin_is_inevitable_and_a_500yearold_law/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p8gdda", "author": "Intelligent-Hat6087", "handle": "Intelligent-Hat6087", "created_utc": 1764287164.0, "text": "I'm going all in. I'm tired of the bullshit. Fuck the system.\n\nBitcoin is a once in a lifetime opportunity. I fucking need this to become rich as fuck. I can't sit around slaving away and investing my money for a measly 10% a year returns. I need to get rich and bitcoin is the answer.\n\nI know what the risks are and I'm willing to take on the risks. The way I see it, I don't have any other hope than bitcoin. It's either I work a dead end job and just barely scrap by for the rest of my life. Or I put everything I fucking own into bitcoin and just let it ride.\n\nI don't give a fuck.\n\nLet's do this. Everything in. All on bitcoin.\n\nFuck it.", "lang": null, "likes": 381, "replies": 375, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p8gdda/im_going_all_in/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p8bipi", "author": "Fearless-Cellist-245", "handle": "Fearless-Cellist-245", "created_utc": 1764273448.0, "text": "Is there a Point in Buying any Crypto Besides Bitcoin??? I was comparing the charts of bitcoin with other popular cryptos like xrp, chainlink, hbar, and ethereum. Bitcoin is the only one that looks like its constantly trending upwards like the sp500. Every other chart looks like its been moving sideways with major spikes occasionally in the middle. I feel like if you already missed the spikes for the other ones, then is there a real point in still buying them? The only one that I saw that was kinda close is etherum but its chart still doesn't look like an upward trend like bitcoin.", "lang": null, "likes": 71, "replies": 297, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p8bipi/is_there_a_point_in_buying_any_crypto_besides/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p89llv", "author": "hodorrny", "handle": "hodorrny", "created_utc": 1764268560.0, "text": "How Btc fluctuations are puzzling traders as Btc stuck around 91k and nobody knows which way it's breaking Bitcoin is hovering in the low 90k range right now (around 91k as I write this) after a brutal drawdown from the October all time high near 126k. That peak-to-trough move of roughly one third has been described by BeinCrypto as the steepest pullback of this bull cycle so far, and you can feel the uncertainty in the way people are trading.\n\nSome on-chain and technical analysts are arguing that, despite how nasty this correction has been, the broader uptrend from the past year and a half is still intact. They’re basically framing this as a classic bull market pullback – ugly in the short term, but still within the kind of drawdowns we saw in previous cycles before new highs.\n\nThe other camp is more cautious. Bitcoin has run straight into resistance in this low-90k area and stalled. If buyers can’t step in soon and turn this into a clean higher low, there’s a real chance we end up retesting the recent lows down in the low-80k region – and a decisive break below 80k is exactly the kind of level some analysts have warned could accelerate selling.\n\nA lot of traders are starting to treat this as a potential range rather than a straight trend. The idea is something like: resistance up around the low-90s, support down near the prior lows, and opportunities only at the extremes – fade euphoria near the top of the range and bid fear near the bottom – until the macro picture or flows force a real breakout.\n\nThe problem is that short term players are going to get wrecked whichever way it eventually breaks. If price squeezes above the current resistance, anyone who’s been shorting every lower high gets steamrolled. If we lose those low-80s supports, all the “buy every dip” crowd gets dragged into a much deeper drawdown than they signed up for.\nEvery squeeze and flush you play now turns into a cluster of taxable disposals later. I have been running my exchanges and wallets through awaken.tax just to see what my year actually looks like if I keep scalping this range instead of being surprised at filing time.\n\nRight now it feels like a waiting game. Macro data and the next Fed decision are hanging over everything, liquidity is thinner than it was near the top, and volatility is sleeping just enough to make people overconfident. Whether this turns into a proper higher-low reset or the start of a larger unwind probably depends less on the next meme line on the chart and more on whether real spot and ETF demand actually shows up again.", "lang": null, "likes": 32, "replies": 34, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p89llv/how_btc_fluctuations_are_puzzling_traders_as_btc/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p84c1d", "author": "Supreme-Muffinator", "handle": "Supreme-Muffinator", "created_utc": 1764255729.0, "text": "More people are using BTC as loan collateral instead of home equity. Smart move? Been digging into the latest lending data and it looks like more people are using their BTC and ETH as loan collateral instead of going the traditional home-equity route. The shift is bigger than I expected.\n\nGalaxy Research showed crypto-backed loans hitting about $73.6B last quarter, which is the highest on record. That kind of volume means people are clearly choosing to unlock liquidity without selling their coins.\n\nThe funniest part is watching TradFi scramble to pretend they were early to all of this. JPMorgan spent a whole week pushing fear around Bitcoin and MSTR while everyone was posting #BoycottJPM… and now they are suddenly excited about BTC and ETH as loan collateral. The turnaround is something else.\n\nWhat actually matters to me is which lenders are doing the heavy lifting. Galaxy’s report puts Tether, Nexo, and Galaxy at the top. Basically the firms that stayed standing after 2022, tightened risk, and kept everything fully collateralized.\n\nCompared to real-estate loans, the advantages are pretty obvious:\n\n* Faster access to capital\n* No taxable event\n* Works anywhere without dealing with banks or credit files\n\nNone of this means it is risk-free - you still need to watch volatility and your LTV - but the market looks a lot cleaner than it used to. \n\nSo I am curious: If you needed funds right now, would you go through your house or your crypto?Anyone here borrowed against their BTC or ETH? How did it go?", "lang": null, "likes": 6, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p84c1d/more_people_are_using_btc_as_loan_collateral/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p7zygv", "author": "PrettyPleaseYo", "handle": "PrettyPleaseYo", "created_utc": 1764242940.0, "text": "Next market everyone will be a  BTC maximalist? We’ve hit lover levels than where we were at 4 years ago and if we look at the combined altcoin charts we have basically been in a bear market since then, but definitely for a year now. Trend is down.\n\nLeads me to feel like I should go full on bitcoin maximalist next time, and I expect many others will too. \n\nBut then again the markets always do what inflicts most most pain and if everyone holds only Bitcoin I bet all other “quality coins” will have their time in the sun finally. \n\nThroughs? How are you guys rebalancing your portfolios?", "lang": null, "likes": 31, "replies": 42, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p7zygv/next_market_everyone_will_be_a_btc_maximalist/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p7zwi6", "author": "Swiftvoyager1906", "handle": "Swiftvoyager1906", "created_utc": 1764242740.0, "text": "Cathie Wood Says Crypto ‘Liquidity Squeeze’ Will Reverse, Reiterates $1.5M Bitcoin Bull Case", "lang": null, "likes": 22, "replies": 16, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p7zwi6/cathie_wood_says_crypto_liquidity_squeeze_will/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p7ydt5", "author": "MaeronTargaryen", "handle": "MaeronTargaryen", "created_utc": 1764237161.0, "text": "[AMA] ETH Strategy - Wartime Ethereum", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p7ydt5/ama_eth_strategy_wartime_ethereum/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p7xjva", "author": "tornavec", "handle": "tornavec", "created_utc": 1764233879.0, "text": "Euro Dropped from Digital Currency Race — Analysts Raise Risk of USDT Depegging From 27 November 2025 onwards, Tether will stop supporting the redemption of the EUR₮ stablecoin on all blockchain networks. Minting of new coins stopped in 2022.\nConsequently, owners will no longer be able to exchange their tokens via the platform's official channels.\n\nThe one-year period allotted to users to withdraw their funds has officially expired, marking EUR₮'s final departure from the cryptocurrency market. As far as I am aware, no other companies are issuing digital euros, so it is safe to say that the EU fiat has been completely removed from crypto exchanges.\n\nUSDT remains in third place in terms of market capitalisation, which could pose a hidden threat to the cryptocurrency market. S&amp;P Global Ratings has revised its assessment of the reliability of Tether's stablecoin issuance, downgrading it from 4 to 5 ('weak'). \n\nThis harsh decision was prompted by the alarming transformation of the company's reserve structure: the share of high-risk instruments, including Bitcoin, gold, and corporate bonds, has grown to 24%.\n\nGiven the recent 20% collapse in the BTC exchange rate, there is a real risk that the fall in asset values will leave the stablecoin without full coverage. The story of UST from the developers of Terra could then repeat itself. As soon as speculators learned about the problems with securing stablecoins, they caused the peg to the dollar to collapse.", "lang": null, "likes": 0, "replies": 10, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p7xjva/euro_dropped_from_digital_currency_race_analysts/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p7rz84", "author": "Clear_Medium_5858", "handle": "Clear_Medium_5858", "created_utc": 1764214640.0, "text": "History shows cooling inflation changes how people view Bitcoin - but its not always bullish right away So theres this interesting pattern with how Bitcoin behaves when inflation starts cooling down. It basically shifts from being seen as a crisis hedge to more of a growth asset depending on where we are in the cycle.\n\nLooking back at 2013 to 2015 after Bitcoins first major pump inflation declined globally and BTC went into this long consolidation phase. People started talking about it as digital gold but price action was pretty boring. The narrative was building tho even if the chart wasnt exciting.\n\nThen in 2018 to 2019 after the 2017 peak inflation cooled and Bitcoin stayed range bound for like two years. But this is when institutions actually started paying attention. Custody services launched futures markets opened up and the store of value idea gained real credibility. The rally didnt come immediately but the foundation got built.\n\nFast forward to 2022 when inflation hit a 41 year high then started cooling in 2023 and 2024. This time Bitcoin stopped acting like an inflation hedge and became way more sensitive to liquidity and rate expectations. ETFs came into play institutional money started flowing and it shifted into a macro sensitive growth asset. if you look at actual realized gains and tax data over these years (the kind of stuff tools like awaken tax try to surface) you can literally see that most people end up realising big btc profits after rate cut vibes start, not at the peak panic.\n\nThe pattern is pretty clear. When inflation cools the urgent need for protection fades. Instead people start favoring assets that do well when money gets easier. Bitcoin rallies strongest after central banks signal rate cuts or pauses not during the inflation peak itself.\n\nBut heres the catch - cooling inflation doesnt guarantee smooth sailing. You can still get corrections from overoptimism about rate cuts or sudden risk off events. Different cycles play out differently especially now with spot ETFs and better institutional infrastructure.", "lang": null, "likes": 4, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p7rz84/history_shows_cooling_inflation_changes_how/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p7hk24", "author": "Foreign_Paper2006", "handle": "Foreign_Paper2006", "created_utc": 1764186585.0, "text": "I need advice So by the end of this year I will most likely have between 8 to 10k USD and I want to invest it in crypto. My plan is to use the money in the next 3-4 years and my hope is that it would’ve increased to 30-60k by then. I know that bitcoin is obviously the most stable to invest in but the returns won’t be as significant as if I invested in either Solana or Chainlink. For instance it’s a lot easier to increase from 15 to 100 or from 160 to 800 but i feel its harder to move from 90k to 360k. Please I need your advice, which of the 3, bitcoin, solana, or chainlink would you advice to invest that money into?", "lang": null, "likes": 8, "replies": 61, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p7hk24/i_need_advice/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p7h8xj", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1764185851.0, "text": "JPMorgan Says Bitcoin Could Hit $240K LongTerm But Halving Cycles May Not Matter Anymore JPMorgan just put out a new note suggesting Bitcoin could eventually reach $240,000, even though the crypto market looks pretty rough right now. BTC has dropped from its early-October high of $126K to the low-$80Ks, and sentiment has definitely cooled off.The interesting part isn’t the price target  it’s the shift they’re calling out. According to JPM, Bitcoin isn’t being driven by the classic four-year halving cycle anymore. Instead, crypto is starting to behave more like a macro asset: influenced by interest rates, liquidity, and broader economic trends.\nTheir view is that institutional money now plays a much bigger role than retail speculation. Basically, the days of halving  hype  bull run might be fading as bigger players start treating Bitcoin the same way they treat other risk assets.\nWhat do you all think  is this the new normal for Bitcoin, or are halving cycles still going to matter in the long run?", "lang": null, "likes": 85, "replies": 32, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p7h8xj/jpmorgan_says_bitcoin_could_hit_240k_longterm_but/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p7byg4", "author": "sylsau", "handle": "sylsau", "created_utc": 1764173973.0, "text": "The Bitcoin Society: The Mirage of Centralized Sovereignty. The Bitcoin Society forgets that Bitcoin’s strength lies in the absence of a leader, not in the creation of new intermediaries. If you want Bitcoin, buy Bitcoin.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p7byg4/the_bitcoin_society_the_mirage_of_centralized/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p79gsf", "author": "tomhandy11", "handle": "tomhandy11", "created_utc": 1764168163.0, "text": "Bull or Bear for 2026? Some think we're seeing a dip this year because of all the external macro factors—tariffs, persistent inflation, and the lingering threat of high interest rates. That pressure systematically drains liquidity from risk assets like ours.\n\nOr, it could simply be the end of the classic four-year halving cycle. There is a huge debate raging on that. Many influential voices argue that the new institutional flow from the Spot ETFs has fundamentally broken the old script. They see the Bitcoin 4 year cycle as being on an extended, elongated run that could easily stretch well into next year, becoming a slow, steady climb rather than a vertical parabolic blow-off top.\n\nWe've seen this kind of turbulent maturity curve before. Look at disruptive tech sectors like cell phones, computers, solar, and electric vehicles; their early stages were anything but smooth. They all required massive investment and went through periods of major volatility before becoming stable giants.\n\nMy question for the community is Which factor do you believe is dominant right now—Macro Headwinds or the Elongated Cycle—and where do you see the cryptocurrency market going from here?", "lang": null, "likes": 19, "replies": 93, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p79gsf/bull_or_bear_for_2026/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p73dgz", "author": "matt7882", "handle": "matt7882", "created_utc": 1764149044.0, "text": "Performance of altcoins I am trying to get an understanding of how the performance of altcoins as a whole have been over longer periods. So this is what I would like to know specifically:\n\nHow much would a portfolio of altcoins (the top 100 coins at the time except bitcoin and the stable coins), weighted by market capitalization, bought at certain time points (say at the beginning of each year since 2020) be worth now?\n\nSo just to be more clear an example: Collect a portfolio of the top 100 altcoins except bitcoin and the stable coins on 2021-01-01, weighted by their market cap at that date. How much would this portfolio be worth now?\n\nCan I somewhere get an answer to that question?", "lang": null, "likes": 0, "replies": 27, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p73dgz/performance_of_altcoins/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p72g98", "author": "sylsau", "handle": "sylsau", "created_utc": 1764145313.0, "text": "Inside Donald Trump's Secret Bitcoin Empire: The Three-Pillar Strategy to Redefine Global Power. The only question is: Are you watching the price, or are you watching the power?", "lang": null, "likes": 1, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p72g98/inside_donald_trumps_secret_bitcoin_empire_the/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p6o4ih", "author": "sylsau", "handle": "sylsau", "created_utc": 1764103917.0, "text": "\"Saving Private Strategy\": The Clash of Worlds Between Wall Street and Bitcoin.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p6o4ih/saving_private_strategy_the_clash_of_worlds/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p6kcoy", "author": "Gullible-Tale9114", "handle": "Gullible-Tale9114", "created_utc": 1764095525.0, "text": "Over 8% of all Bitcoin just changed hands in a week - markets on a knife's edge waiting for Fed decision So something historically significant just happened. More than 8% of Bitcoins entire supply changed hands over the past seven days. Joe Burnett from Semler Scientific called this one of the most significant onchain events in Bitcoin history.\n\nThe last times we saw supply movements this large were in March 2020 when BTC was around 5000 dollars and December 2018 when it hit 3500. Both of those marked local bottoms before accumulation phases that eventually led to new all time highs. So historically this type of activity has been bullish longterm.\n\nTheres a catch tho. Up to half of this movement might just be from Coinbase doing a wallet migration they announced on Saturday. So the actual selling and buying pressure might be less dramatic than the raw numbers suggest.\n\nRight now the markets completely focused on what the Fed does on December 10th. Odds of a 25 basis point rate cut jumped from 50% to 82% in just a week according to CME Groups FedWatch tool. Thats whats fueling Bitcoins recovery from 81k back to 87k.\n\nNic Puckrin from Coin Bureau put it pretty well saying were on a knifes edge and the Fed holds the key to whether we get a Santa rally or a Santa dump. As we get closer to December 10th expect volatility to pick up even more.\n\nThe mixed messages about rate cuts are keeping everyone on edge. Markets jitters are gonna continue until we actually get clarity from the Feds press conference. Basically everyones just waiting to see what Jerome Powell says before making any big moves.", "lang": null, "likes": 62, "replies": 27, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p6kcoy/over_8_of_all_bitcoin_just_changed_hands_in_a/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p6b7s3", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1764073816.0, "text": "Bitcion price: Bitcoin price faces triple threat as ETFs sell, stablecoins drop, and long-term holders exit", "lang": null, "likes": 11, "replies": 10, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p6b7s3/bitcion_price_bitcoin_price_faces_triple_threat/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p65ltq", "author": "sylsau", "handle": "sylsau", "created_utc": 1764053110.0, "text": "The Fiat Facade: Why the Next Generation is Locked Out of the Bitcoin Revolution.", "lang": null, "likes": 0, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p65ltq/the_fiat_facade_why_the_next_generation_is_locked/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p61aqa", "author": "hodorrny", "handle": "hodorrny", "created_utc": 1764039259.0, "text": "China just quietly became the third largest Bitcoin miner again despite the 2021 ban still being in effect China is back to roughly 14 percent of global bitcoin mining hashrate, which puts them in third place again behind the us and russia by recent estimates. this is wild considering mining was banned in 2021 and their visible share collapsed right after that.\n\nthe comeback is happening especially in power rich regions like xinjiang, where miners say cheap electricity and excess data center capacity make underground mining hard to resist. a miner named wang told reuters he started operating late last year, saying a lot of xinjiang power can’t be transmitted out so people end up consuming it through mining, and new projects are still being built.\n\nhardware sales back this up. canaan, the second largest mining rig maker, got about 2.8 percent of its revenue from china in 2022, that jumped to 30.3 percent in 2024, and a source with direct knowledge told reuters china was over 50 percent of sales in q2 2025. canaan did not confirm the q2 split but acknowledged stronger china demand.\n\nthe government hasn’t officially changed its stance. the ban is still on the books, but significant capacity is operating anyway, suggesting enforcement is uneven and incentives are winning in certain provinces.\n\nthere are also signs of a more nuanced posture on digital assets. hong kong’s stablecoin licensing regime went live in august, and reuters has reported mainland officials weighing yuan backed stablecoins for cross border use. that doesn’t mean a full reversal, but it fits with miners sensing softer edges.\n\nthe ceo of perpetuals dot com called the resurgence one of the most important signals the market has seen in years. it also reopens the centralization debate, since the us russia and china together account for about two thirds of hashrate by current estimates.\n\nbottom line, economic incentives are beating policy. cheap power and profitable mining make a total crackdown hard to sustain.", "lang": null, "likes": 31, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p61aqa/china_just_quietly_became_the_third_largest/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5wwlt", "author": "Background-Day-4957", "handle": "Background-Day-4957", "created_utc": 1764027219.0, "text": "\"MSCI May Exclude Digital Asset Treasury Firms, Putting “Meaningful Pressure” on the Sector\" \"The discussion, which began quietly in October, has gained urgency after MSCI confirmed it is consulting the investment community on whether firms holding more than 50% of their balance sheet in Bitcoin or other cryptocurrencies should remain eligible for inclusion.\"\n\n[https://finance.yahoo.com/news/msci-may-exclude-digital-asset-075439803.html](https://finance.yahoo.com/news/msci-may-exclude-digital-asset-075439803.html)", "lang": null, "likes": 1, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5wwlt/msci_may_exclude_digital_asset_treasury_firms/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5v351", "author": "fortune", "handle": "fortune", "created_utc": 1764022769.0, "text": "Here’s how low Bitcoin is likely to fall | Fortune Crypto", "lang": null, "likes": 0, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5v351/heres_how_low_bitcoin_is_likely_to_fall_fortune/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5o2wb", "author": "PersonalNature1795", "handle": "PersonalNature1795", "created_utc": 1764007051.0, "text": "when does Wall Street dictate direction? I’m trading bitcoin. And I have a hard time figuring out what happens to bitcoin when the US circus is open. It seems like some days it follows every move of the S&amp;P. And some days it does not give a shit. Some days it’s almost tethered instantly to US open. Some days there is no reaction at all. Any thoughts, tips or tricks?", "lang": null, "likes": 2, "replies": 8, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5o2wb/when_does_wall_street_dictate_direction/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5mpm9", "author": "Red_rack13", "handle": "Red_rack13", "created_utc": 1764004108.0, "text": "Paper Bitcoin —The Real Killers of the 2025 Bull Run Looking at the recent volatility and the failure to sustain momentum, I believe the core problem isn't regulation or macroeconomics, but two internal issues that eroded trust and liquidity: Paper Bitcoin and the Toxic Culture of FOMO Leverage.\n\nThe Cancer of \"Paper Bitcoin\"\n\n\"Paper Bitcoin\" refers to the massive amount of synthetic exposure (ETFs, centralized exchange balances, futures contracts, etc.) that represent BTC ownership without actually removing coins from the circulating supply.\n\n\n\nThe Problem: When institutions or exchanges offer these products, they create billions in demand on paper, but this demand doesn't necessarily translate into coins being permanently taken out of circulation (especially if they use fractional reserve or re-hypothecation).\n\n\n\nThe Liquidity Drain: As soon as the price dips, these massive \"paper\" positions are the first to be liquidated or sold by institutions prioritizing risk management. This creates immense, concentrated sell pressure that the retail market simply cannot absorb, artificially destroying bull run momentum built on genuine, self-custody demand.\n\n\n\nThe Irony: We celebrate institutional adoption (like ETFs), but in reality, this adoption creates a highly leveraged, easily disposable form of Bitcoin that actively works against the \"number go up\" narrative during pullbacks.", "lang": null, "likes": 0, "replies": 14, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5mpm9/paper_bitcoin_the_real_killers_of_the_2025_bull/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5llm9", "author": "sylsau", "handle": "sylsau", "created_utc": 1764001730.0, "text": "The Sovereign Nomad: 5 Security Rules for Traveling with Your Bitcoin.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5llm9/the_sovereign_nomad_5_security_rules_for/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5ksgy", "author": "Hellstorage", "handle": "Hellstorage", "created_utc": 1763999996.0, "text": "why many people call bitcoin ponzi scam ? People fear what they don’t understand, and that’s why many call Bitcoin a ponzi scam. But the real irony is that the paper money we work for and save is much closer to a ponzi system. Governments can print unlimited amounts of it out of thin air, reducing its value and calling it “inflation.” Bitcoin isn’t the scam here—fiat money is.\n\nam i missing somthing here ?", "lang": null, "likes": 0, "replies": 32, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5ksgy/why_many_people_call_bitcoin_ponzi_scam/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5j5ns", "author": "f00dl3", "handle": "f00dl3", "created_utc": 1763996180.0, "text": "Is it impossible to \"patch\" Bitcoin against Quantum Computing? On several other venues and platforms I have posed questions asking why nobody has done anything to address the fact Bitcoin is vulnerable to Quantum Computing's obvious threats. The general consensus is that because of Bitcoin's \"decentralized\" nature, that it would be impossible to \"fix\" or \"patch\" Bitcoin's code to protect against Quantum Computing.\n\n  \nThe only viable option is to start a new Bitcoin project that is Quantum Computing resistant.\n\n  \nDoes this mean when we get to that point, in 2 or 3 years, or less, that everyone will be selling Bitcoin, there is no protection in place to prevent the price from going to $0, and while some may adopt the new \"Bitcoin 2\" or whatever it ends up being called, that a lot of people will probably just say \"I'm done, not going to go through all this trouble and pay more network fees to convert my Bitcoin to Bitcoin 2.\"\n\n  \nAlso, how would this impact ETFs. Would you have to buy new ETFs? Would your old ETFs be liquidated by the ETF maintainers? Or would the maintainers of the ETFs be legally required to convert your assets to \"Bitcoin 2?\"", "lang": null, "likes": 18, "replies": 65, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5j5ns/is_it_impossible_to_patch_bitcoin_against_quantum/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5i9c8", "author": "TeaGroundbreaking306", "handle": "TeaGroundbreaking306", "created_utc": 1763993998.0, "text": "Bitcoin For Inflation Evasion", "lang": null, "likes": 0, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5i9c8/bitcoin_for_inflation_evasion/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5hw2j", "author": "Desperate-Hurry-3205", "handle": "Desperate-Hurry-3205", "created_utc": 1763993070.0, "text": "Weekly Bitcoin Oversold Snapshot — Testing the 86.9k Pivot BTC Weekly Technical Snapshot — Pivot at 86.9k\n\nTL;DR: As of 2025-11-24, Bitcoin (BTC) closed at $86,820 on the weekly chart, sitting just below the weekly pivot (86,895.6). Short- and mid-term indicators show a bearish bias: price is below the EMA10/20/50, MACD is negative, and ADX indicates a weak trend. Oscillators are near oversold (RSI \\~32, stochastic in oversold with an early bullish cross) while price has breached the lower Bollinger Band — a volatility signal that can persist. Immediate support and resistance are tightly spaced (\\~±1–3.7%), with a heavy resistance cluster at 93.6–98k and deeper historical supports well below 42k. This is a tactical environment; momentum and band signals conflict, so resolution may be reflected in weekly closes around the pivot, R1/R3 and S1/S3.\n\nWhy this matters\n\nBitcoin’s weekly price structure frames tactical decisions for traders and for investors tracking trend direction. The latest weekly snapshot (close 86,820, data to 2025-11-24) shows price sitting just under the weekly pivot, inside a volatile, wide-range market. That proximity suggests near-term levels are particularly relevant, as small weekly moves can shift the immediate bias.\n\nThe current picture (quick facts)\n\n* Last weekly close: $86,820.\n* Weekly pivot: 86,895.6 (price is fractionally below).\n* Short/mid MAs: Price &lt; EMA10 (101,354), EMA20 (105,130), EMA50 (99,668).\n* Long MA: SMA200 at 55,798 — well below current price (long-term structural support).\n* ADX: 11.9 — weak trend strength on the weekly timeframe.\n* Market phase labeled: bearish drift with choppy range behavior.\n\nIn plain terms: the mid-term technical structure is biased down (lower highs &amp; lower lows) while the market lacks strong directional momentum.\n\nWhat the indicators are saying\n\n* MACD: Negative and below its signal line (MACD −2,243; signal 1,867; hist −4,109) — momentum is bearish.\n* RSI (14): 32.3 — close to oversold but not an extreme reversal signal on its own.\n* Stochastic: K 13.8, D 10.5 — in oversold territory with K above D (an early bullish cross that can precede short squeezes or temporary bounces).\n* Bollinger Bands: Price is below the lower band (Upper \\~130.7k, Lower \\~90.1k) — a band breach that signals elevated volatility; breaches can persist during trending moves or violent chop.\n* ATR (weekly): \\~10.25k — points to high weekly volatility range.\n\nTakeaway: Oscillators are showing oversold conditions while trend and momentum remain unfavorable. That creates a mixed signal set — short-term bounce candidates within a broader bearish context.\n\nSupport, resistance and the pivot map\n\nKey immediate levels (distance from last close in parentheses):\n\n* Pivot (range mid): 86,895.6 (+0.09%).\n* Resistance cluster (near-term): R1 87,911 (+1.26%), R2 89,002 (+2.51%), R3 90,018 (+3.69%).\n* Extended resistance cluster (supply zone): 93,625 (+7.84%), 94,500 (+8.85%), 96,250 (+10.86%), 98,000 (+12.88%). Major resistance around 108,500 (+24.98%).\n* Near supports: S1 85,804 (−1.17%), S2 84,789 (−2.34%), S3 83,698 (−3.61%).\n* Deep, historical frequency supports (contextually distant): 42,000 (−51.6%), 29,750 (−65.7%), 26,250 (−69.8%), 19,250 (−77.8%).\n\nInterpretation: Price currently trades inside a tight weekly pivot band (\\~±1–3.7%). Overhead supply becomes significant above \\~93.6k and could stall any meaningful recovery. Immediate downside interest clusters around the S1–S3 band.\n\nVolume and recent market context\n\n* Notable volume spikes: 2024-11-11 (breakout volume surge, +100% vs typical) and 2025-03-03 (elevated selling, +35%). Recent selling waves showed expansion in volume, which supports the bearish mid-term narrative.\n* Range (last \\~3 months on the weekly): low \\~86.8k, high \\~123.5k — a wide range (≈42% width relative to the low), reflecting choppy behavior and elevated whipsaw risk.\n\nReading the risk map: what to watch\n\n* Tactical breakout indicators: Weekly closes above 90,018 (R3) would degrade the immediate downside bias and clear a pivot stack, opening the path toward the 93.6–98k supply zone.\n* Breakdown indicators: Weekly close below 83,698 (S3) would confirm a near-term structural break and increase the chance of deeper retests inside the broader range.\n* Narrow triggers: Because the pivot and S1/R1 sit within \\~1–2% of price, small weekly moves matter for near-term positioning.\n\nNote: These are technical trigger observations — not trade recommendations.\n\nConflicting signals and how to interpret them\n\nThere is a multi-horizon conflict: the SMA200 sits far below current price (a long-term structural support), while short- and mid-term EMAs and MACD are bearish. The resolution honors the current structure and multi-horizon evidence: lower highs/lows and weak ADX favor a mid-term bearish view, while the SMA200 provides a longer-term backdrop that would matter only if price moved materially lower.\n\nAlso, oversold oscillators (RSI/Stoch/CCI) and a Bollinger lower-band breach can lead to counter-trend bounces; however, oversold readings can persist in weak trends — so bounces would be described as tactical unless accompanied by structural breaks such as weekly closes above R3 or sustained moving-average crossovers.\n\nBottom line — clear takeaway\n\nBitcoin sits marginally below the weekly pivot at \\~86.9k in a weak, choppy downtrend. Momentum remains negative, but oscillators are oversold and price has breached the lower Bollinger Band — a setup that can produce short-term rebounds inside a larger bearish context. The near-term focus centers on weekly closes around 90,018 (neutralizes the immediate downside stack) and 83,698 (escalates downside risk) for a clearer directional read. Expect volatility to remain elevated given band breaches and widened ATR, with moves that can be swift and noisy.\n\nThis is a technical snapshot intended to clarify structure and levels, not a forecast or financial advice.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5hw2j/weekly_bitcoin_oversold_snapshot_testing_the_869k/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5gtpr", "author": "sylsau", "handle": "sylsau", "created_utc": 1763990289.0, "text": "BITCOIN IS NOW IN THE DEEP VALUE ZONE. BTC just dipped below the short-term holder MVRV bands - something it almost never does outside of major reset periods.", "lang": null, "likes": 76, "replies": 42, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5gtpr/bitcoin_is_now_in_the_deep_value_zone_btc_just/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5fn5i", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1763986947.0, "text": "Bitcoin Funds Set for Worst Month as Investors Yank $3.5 Billion", "lang": null, "likes": 21, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5fn5i/bitcoin_funds_set_for_worst_month_as_investors/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5enf2", "author": "tornavec", "handle": "tornavec", "created_utc": 1763983756.0, "text": "BTC Conceded Ground: Why ETH Showed Superior Relative Strength Following the Spring Crash? From late January to April, investors began actively selling Bitcoin and Ethereum. Taking the mid-April rise of the two cryptocurrencies as a starting point and comparing their dynamics to the present day reveals an interesting picture on the chart: ETH has shown greater resilience to negativity following the recent market crash. \n\nAnother anomaly can be seen in the inflows and outflows of ETF funds. During the cryptocurrency market crash, ETH often received investments while capital fled from BTC ETFs. \n\nI think investors have rethought their attitude towards the two cryptocurrencies and that institutional demand for ETH is higher for the following reasons:\n\n- Ethereum has more developers who can quickly deal with the quantum threat to the blockchain\n- Ethereum strives for transaction anonymity\n- ETH mining and blockchain security do not depend on electricity, the shortage of which is growing with the emergence and development of AI", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5enf2/btc_conceded_ground_why_eth_showed_superior/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5djbi", "author": "discrete_moment", "handle": "discrete_moment", "created_utc": 1763979884.0, "text": "Bitcoin weekly: The Breakdown Deepens Hey guys. Happy to get some feedback on my latest bitcoin TA chart analysis! Don't hold back lol", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5djbi/bitcoin_weekly_the_breakdown_deepens/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p5crzf", "author": "Firm_Ad8062", "handle": "Firm_Ad8062", "created_utc": 1763976993.0, "text": "Problem with BTC transfer being held in Robinhood, have to transfer to COINBASE. Problem with BTC transfer being held in Robinhood, have to transfer to COINBASE.\n\nI'm having some problems with my Bitcoin regarding Robinhood. I used Robinhood to buy the bitcoin, transferred it to Roobet (which is a gambling website) to bet on it. Won a bit and transferred all of the Bitcoins back to my Robinhood wallet. \n\nThey asked me for my address, ID, etc, and I provided everything. After that, I got an email that said: \n\n||\n||\n|Your BTC transfer is on hold|\n\n||\n||\n|Your incoming 0.0496971 BTC transfer is on hold.  Contact Support so we can review the details of the transfer with you.|\n\nThe Live Support wasn't open on the weekend, so I waited until Monday to chat with them. In the chat, they said that the deposit has to be sent back to a NON-Robinhood BTC wallet, since I had problems regarding \"transfer of fund regulation\", but couldn't tell me why or what. \n\nIn the end, I gave them my Coinbase Bitcoin wallet, and they said that IF they can process the return, it can take up to 10 days, and that I won't get any kind of confirmation if it has been sent, and instead have to check up with Robinhood. \n\nI asked beforehand if they accepted transfer to a Coinbase wallet, and they said yes. \n\nI am just a little bit stressed since I am pretty new to all this, and it feels a bit sketchy. Will i get my funds? What is going on? Has anybody else experienced something like this and know what the outcome might be?\n\nAlso, i was wondering if I get the funds to my Coinbase wallet, is it possible for me to deposit the BTC back to the Robinhood wallet to sell it there instead?", "lang": null, "likes": 2, "replies": 7, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p5crzf/problem_with_btc_transfer_being_held_in_robinhood/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p59i3g", "author": "sylsau", "handle": "sylsau", "created_utc": 1763964620.0, "text": "Bitcoin Logs Longest Losing Streak Since 2024 as Fed Repricing Fuels Cautious Rebound - Decrypt", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p59i3g/bitcoin_logs_longest_losing_streak_since_2024_as/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p59hpu", "author": "sylsau", "handle": "sylsau", "created_utc": 1763964580.0, "text": "Is MicroStrategy a Fortress or a House of Cards? The math behind Michael Saylor’s $60B bet on Bitcoin. **Is MicroStrategy a Fortress or a House of Cards? The math behind Michael Saylor’s $60B bet.**\n\nEveryone is asking the same question: \"Can Michael Saylor survive a 90% Bitcoin crash?\" Saylor says yes. The market is skeptical. But looking at the balance sheet, the answer isn't what you think.\n\nWe dove deep into the numbers of the MicroStrategy machine. Here is the reality vs. the narrative:\n\n❌ **The Myth:** \"MSTR faces a margin call if BTC drops.\" \n\n✅ **The Reality:** Most of MSTR’s $8.2B debt is unsecured convertible notes. There are no price-based covenants. Saylor won't be forced to sell a single Satoshi tomorrow, even if Bitcoin hits $15k.\n\n⚠️ **The Real Danger:** The \"Debt Wall\" of 2027-2029. The risk isn't liquidation; it's **refinancing**. Between 2027 and 2029, billions in debt mature. \n\n• If Bitcoin is high? The debt converts to equity. Genius move. \n\n• If Bitcoin is low? Creditors want cash. The financing window closes.\n\nMicroStrategy is a time-leveraged bet. It’s not about the **Price** of Bitcoin today; it’s about the **Time** it takes to recover.\n\nWe analyzed the liquidity, the cash flows ($689M/year needed just to keep the lights on), and the \"Paper Fortress\" structure.\n\n📖 **Read the full analysis to understand why MSTR is immune to volatility, but vulnerable to time:** [**The Paper Fortress? Michael J. Saylor's Strategy Facing the Trial by Fire**](https://sylvainsaurel.substack.com/p/the-paper-fortress-michael-j-saylors)", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p59hpu/is_microstrategy_a_fortress_or_a_house_of_cards/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p58xyc", "author": "sylsau", "handle": "sylsau", "created_utc": 1763962672.0, "text": "The Retail Trap: Why MSTR is not a Bitcoin Proxy.", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p58xyc/the_retail_trap_why_mstr_is_not_a_bitcoin_proxy/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p4w0j7", "author": "Red_rack13", "handle": "Red_rack13", "created_utc": 1763927238.0, "text": "Stop Trading, Start DCAing: Why Dollar-Cost Averaging Is Your Best Strategy Trying to time the crypto market is gambling. DCA (Dollar-Cost Averaging) is the proven, low-stress method to beat volatility and build wealth long-term.\n\nThe Problem: Why Trading Fails (Especially Now):  \n  \nAs crypto enthusiasts, we all dream of buying the absolute bottom and selling the absolute top. But let's be realistic:\n\nEmotional Decisions: When Bitcoin drops 10% in an hour, panic sets in, and you sell at a loss. When it jumps 15%, you FOMO (Fear of Missing Out) in at the top. Emotions beat logic every time.\n\nFailed Timing: Nobody, not even the experts, can consistently predict the market's exact peaks and troughs. You might get lucky once, but you won't do it over five years.\n\nThe DCA Solution: Simple, Effective\n\nDCA is an investment method where you invest a fixed, small amount of money at regular intervals (e.g., $100 every Monday), regardless of the price.\n\n\n\nHow It Works (The Math)\n\nWhen you buy consistently, you automatically buy more coins when the price is low and fewer coins when the price is high.\n\nThis process effectively lowers your overall average cost compared to trying to dump all your money in at once.\n\nResult: You get more assets for the same amount of money over time.\n\n\n\nThe Real Advantage: Mindset\n\nThe biggest gain from DCA is psychological:\n\nZero Stress: You remove the need to constantly check charts and stress over daily swings.\n\nLong-Term Focus: DCA forces you to focus on the next 5 years, not the next 5 days.\n\n\n\nActionable Tip\n\nChoose: Select a strong asset (BTC/ETH).\n\nAutomate: Set up a recurring buy (weekly is great) with an amount you can comfortably afford to lose.\n\nHODL: Transfer your accumulated assets to cold storage.\n\n\n\nWhat is the one thing you stopped doing that helped your DCA strategy succeed? Share your tips below!", "lang": null, "likes": 0, "replies": 6, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p4w0j7/stop_trading_start_dcaing_why_dollarcost/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p4sqix", "author": "JAYCAZ1", "handle": "JAYCAZ1", "created_utc": 1763919464.0, "text": "Bitcoin Rebounds as Volatility Spikes to Monthly Highs", "lang": null, "likes": 18, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p4sqix/bitcoin_rebounds_as_volatility_spikes_to_monthly/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p4r3hk", "author": "sylsau", "handle": "sylsau", "created_utc": 1763915596.0, "text": "Bitcoin in Freefall: Is $73,000 Inevitable After the Breakdown at $90,000?", "lang": null, "likes": 0, "replies": 12, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p4r3hk/bitcoin_in_freefall_is_73000_inevitable_after_the/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p4fpli", "author": "Proxima-B12", "handle": "Proxima-B12", "created_utc": 1763879439.0, "text": "Bitcoin Is Crashing NOW — So Why Are People Still Pretending the Crash Starts in 2026? Bitcoin is bleeding right now — hard — and yet people keep parroting the same lazy narrative: “don’t worry, the real crash comes in 2026.” Based on what? Outdated cycle charts from a market that stopped behaving like that years ago?\n\nInstitutional flows are rolling over. ETF money is leaving. Liquidity is tightening. Long-term holders are sending BTC to exchanges. Macro is hostile. The charts are already broken.\n\nThis isn’t “pre-peak volatility.”  \nThis *is the crash starting early* — and people are still coping with 4-year-cycle nostalgia.\n\nIf you’re waiting for some magical 2026 dump, you’re already late.", "lang": null, "likes": 0, "replies": 10, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p4fpli/bitcoin_is_crashing_now_so_why_are_people_still/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3z4tu", "author": "sylsau", "handle": "sylsau", "created_utc": 1763832978.0, "text": "The Gilded Cage: Why Bitcoin Hasn't Decoupled (Yet). Bitcoin is the most honest mirror in the world. If we look into it and see a speculative tech stock, that is because that is who we are right now. Bitcoin is not judging us; it is reflecting us.", "lang": null, "likes": 3, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3z4tu/the_gilded_cage_why_bitcoin_hasnt_decoupled_yet/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3weuj", "author": "Immediate_Oil_562", "handle": "Immediate_Oil_562", "created_utc": 1763826431.0, "text": "For every seller there is a buyer. So why when things go down do people say everyone is selling? Help me understand Curiosity to why when things go down people say everybody is selling. When in fact for every seller there is a buyer. \n\nCan we know how much actual money is being lost. \n\nWhen bitcoin is at an all time high the gains are mostly paper gains right. Relatively few people sell and realise that gain. Likewise when it goes down most loss isn’t realised.\n\nSo why is the trope that everyone is selling so commonly used when there is always a buyer?", "lang": null, "likes": 0, "replies": 22, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3weuj/for_every_seller_there_is_a_buyer_so_why_when/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3v1w9", "author": "Red_rack13", "handle": "Red_rack13", "created_utc": 1763822976.0, "text": "Bitcoin: The Calm Before the Storm? Analyzing the Current Correction and Consolidation Hello everyone,\n\nI've been closely watching the recent Bitcoin price action, and it feels like we've hit a temporary floor after a significant correction.\n\nIt seems the immediate, heavy selling pressure has subsided. Right now, it looks like we could enter a consolidation phase for a short period—maybe ranging sideways before the next major move. This consolidation is a healthy sign after a sharp drop, allowing the market to digest the recent losses and gather momentum (or distribute further).\n\n\n\nMy Core Thesis: The Final Correction Awaits\n\nWhile this consolidation provides a nice breather, I have a strong feeling that the final, capitulatory correction is still pending.\n\nThe current price level, while a good temporary support, doesn't quite feel like the true bottom that flushes out all the weak hands and resets market sentiment for a sustainable bull run.\n\n\n\nWhy I believe this:\n\nLack of True Capitulation: We haven't seen the kind of high-volume, despair-driven selling (the \"throw-in-the-towel\" moment) that typically marks a major cycle bottom.\n\nMacro Economic Headwinds: Broader market uncertainty and regulatory clarity (or lack thereof) might still pressure risk assets like Bitcoin one last time.\n\nThe Psychological Reset: The market often needs a final, painful dip to complete the full correction cycle and clear the slate for long-term holders to accumulate heavily.\n\n\n\nWhat are your thoughts?\n\nDo you agree that we are due for a final, sharp move down after this consolidation?\n\nWhat price range are you watching for the potential \"final flush\"?\n\nAre you buying this current dip, or waiting on the sidelines?", "lang": null, "likes": 36, "replies": 42, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3v1w9/bitcoin_the_calm_before_the_storm_analyzing_the/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3r9zn", "author": "Then_Helicopter4243", "handle": "Then_Helicopter4243", "created_utc": 1763811915.0, "text": "Bitcoin’s Current Condition and How Traders Are Responding Bitcoin has slipped back toward the $83K range, and the selling pressure is starting to show. Onchain data suggests that some larger investors are offloading positions, locking in losses similar to what we saw during past crash cycles. This is not unusual, historically, sharp declines often trigger capitulation among those who bought near the highs. It’s a reminder that even smart money can get shaken out when sentiment turns fragile, and that price action alone does not always reflect long term fundamentals.\n\nFor retail traders, this environment is tricky. Avoiding losses is not about predicting the exact bottom, its about managing risk in a disciplined way. That means setting stop losses, not over leveraging, and being comfortable with smaller position sizes until volatility cools down. It also means resisting the urge to chase pumps or panic sell during dips. Protecting capital should be your first priority, because opportunities will always come back once the market stabilizes. Many experienced traders emphasize patience, scaling into positions gradually, and keeping cash reserves ready for when conviction is stronger.\n\nInterestingly, some traders are diversifying their approach instead of focusing solely on BTC. With Black Friday events ongoing, a few are experimenting with structured strategies like spot grids and reward based campaigns, where returns can be boosted, some even mention 100% back offers. I have heard these events are live on certain CEXes, including Bitget and others. Whether or not you participate, it shows how traders are looking beyond just holding BTC, exploring side opportunities while waiting for clearer market direction. Lastly don’t get blinded by short term noise, but also don’t ignore creative ways to stay active in the market while protecting your downside.", "lang": null, "likes": 2, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3r9zn/bitcoins_current_condition_and_how_traders_are/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3pue0", "author": "Stock_Historian5617", "handle": "Stock_Historian5617", "created_utc": 1763806665.0, "text": "How much are yall down? The bitcoin bleed seems to be hurting everything right now, but it's temporary pain for long term reward. I found it interesting that my bitcoin loss is much greater than some meme coins i hold.\n\nHow much yall down all up?", "lang": null, "likes": 39, "replies": 164, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3pue0/how_much_are_yall_down/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3pf67", "author": "Illustrious_Lie_954", "handle": "Illustrious_Lie_954", "created_utc": 1763805085.0, "text": "Bitcoin just dropped to a seven-month low, going under $82,000. What’s next for those investing? Bitcoin dropped to a seven-month low, edging dangerously close to the $80,000 mark a level below which analysts believe the cryptocurrency could face far steeper losses. The world’s largest digital asset fell to $80,553 while ether tumbled to a four-month low, as cryptocurrencies led a broader retreat from riskier assets amid mounting concerns over stretched tech valuations and renewed uncertainty around U.S. interest-rate cuts.", "lang": null, "likes": 122, "replies": 114, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3pf67/bitcoin_just_dropped_to_a_sevenmonth_low_going/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3ov76", "author": "sylsau", "handle": "sylsau", "created_utc": 1763802882.0, "text": "The Great Illusion: Why Bitcoin Broke Its Sacred Alliance with Global Liquidity (aka Global M2 Money Supply). The fuel is there, but it is in a tank to which Bitcoin’s engine is not connected.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3ov76/the_great_illusion_why_bitcoin_broke_its_sacred/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3jhjf", "author": "Xanl20", "handle": "Xanl20", "created_utc": 1763783735.0, "text": "Probably a stupid question, but... Has bitcoin lost a lot of its real world utility with the rising popularity of stablecoins? I'm new to bitcoin and crypto in general, fyi.\n\nMy impression of bitcoin is it has two use cases. The first is as an investment vehicle. Bitcoin has no tangible value, so any appreciation is based on utility and perceived value/scarcity. Utility is tied to its second use case- a way to hold and transfer wealth that is very difficult for the government to monitor and seize. It allows people and organizations to secretly do business and to smuggle/hide wealth from authorities.\n\nWith the advent of stablecoins, either tied to fiat currency or assets like gold, doesn't this have the potential to replace bitcoin's utility with cryptocurrencies that are much more stable in value? If so, that leaves bitcoin in a tulip scenario, where speculation by investors is the only thing holding up its value. Like I said, I'm new to crypto. I'd love to hear if/why I'm wrong from people who are actually educated in the sector.", "lang": null, "likes": 2, "replies": 5, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3jhjf/probably_a_stupid_question_but/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3id1j", "author": "hodorrny", "handle": "hodorrny", "created_utc": 1763780272.0, "text": "Rich Dad Poor Dad author Robert Kiyosaki just sold 2.25 million dollars worth of Bitcoin at 90k after buying at 6k - but says hes still bullish he just announced he sold about 2.25 million dollars worth of Bitcoin on Friday. He said he originally bought those coins years ago when BTC was around 6000 and sold near 90k so he locked in a pretty massive gain. He did not clearly say this was his entire BTC stack, just that he sold this amount.\n\nWhats interesting is hes not selling because he thinks Bitcoins done. He says hes reinvesting the proceeds into two surgery centers and a billboard business that he estimates will generate about 27500 dollars in tax free monthly income by February 2026.\n\nHe also said hes still very bullish and optimistic on Bitcoin and plans to start buying again using the cash flow from those businesses. Earlier this month he repeated his view that BTC could hit around 250k by 2026.\n\nThe timing is what caught people off guard tho. This comes right as Bitcoin dumped into the mid 80k range this week and briefly traded in the low 80ks intraday before bouncing back. We are now down a bit over 30 percent from the October all time high around 126k.\n\nThe Fear and Greed Index hit 11 on Friday which is extreme fear territory and one of the lowest readings this year. Some people are genuinely worried we are sliding into a deeper bear phase.\n\nBut some analysts including Bitfinex commentators have framed the ETF outflows and this downturn as short term stress in positioning and macro, not necessarily a full breakdown of long term institutional interest. And veteran trader Peter Brandt still thinks Bitcoin reaches 200k in the next cycle, roughly around Q3 2029.\n\nSo Kiyosakis move seems more tactical than anything. Take profits when theyre there, reinvest in cash flowing assets, then buy back later when you have stable income. Classic rich dad playbook honestly.", "lang": null, "likes": 0, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3id1j/rich_dad_poor_dad_author_robert_kiyosaki_just/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3i5br", "author": "TeaGroundbreaking306", "handle": "TeaGroundbreaking306", "created_utc": 1763779642.0, "text": "Bitcoin Confusion", "lang": null, "likes": 3, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3i5br/bitcoin_confusion/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p3hyya", "author": "Practical-Solutions1", "handle": "Practical-Solutions1", "created_utc": 1763779118.0, "text": "What This AI Bubble Burst Means for Bitcoin and Crypto Market Fears of an AI bubble are rising as trillion-dollar investments show signs of strain. Tech valuations are wobbling, sentiment is cooling, and crypto, especially Bitcoin, is feeling the impact as volatility spills over from Big Tech.\n\nNow, the core question: If AI’s boom deflates, what happens to crypto?", "lang": null, "likes": 3, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p3hyya/what_this_ai_bubble_burst_means_for_bitcoin_and/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p38pzt", "author": "These_Athlete1933", "handle": "These_Athlete1933", "created_utc": 1763755269.0, "text": "what do i need in order to deposit/withdraw ETH? what do i need in order to deposit/withdraw ETH? i was using it in 2022 for axie infinity. had ronin wallet and metamask back then (not sure if i still got access to the later). i have been out of the loop for a long time (since axie infinity flopped) and am not sure if both of them are still required or something changed.\n\nasking this for online casinos like stake, shuffle etc etc\n\nalso, what is the best cryptocurrency as of 2025? best as in safest or whatever u think is important. bitcoin or ethereum? or maybe something else entirely?\n\nthanks in advance", "lang": null, "likes": 0, "replies": 0, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p38pzt/what_do_i_need_in_order_to_depositwithdraw_eth/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p30gs2", "author": "f00dl3", "handle": "f00dl3", "created_utc": 1763736350.0, "text": "Is Microstrategy shorting/selling their Bitcoin to maintain listing? Based on yesterday's news, Microstrategy's Bitcoin holdings were 77% which is above the allowed holdings for a Nasdaq listed company. The price has been crashing, HARD, the past few days.\n\n  \nIs this because Microstrategy is either shorting Bitcoin to gain liquid valuation, or just simply dumping their Bitcoin to go back to the 55% level?", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p30gs2/is_microstrategy_shortingselling_their_bitcoin_to/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p2zrn2", "author": "sylsau", "handle": "sylsau", "created_utc": 1763734641.0, "text": "Eighty-One Levels of Hell: The Unbearable Truth About Your \"$2.8 Billion\" Bitcoin Fantasy.", "lang": null, "likes": 0, "replies": 2, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p2zrn2/eightyone_levels_of_hell_the_unbearable_truth/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p2wohw", "author": "victor0427", "handle": "victor0427", "created_utc": 1763726120.0, "text": "Bitcoin enters a new phase - the era of only 5% remaining. On November 17th, over 19.95 million Bitcoins had been mined. This represents 95% of the total supply of 21 million. The remaining 1.05 million, however, will take 115 years to mine.", "lang": null, "likes": 0, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p2wohw/bitcoin_enters_a_new_phase_the_era_of_only_5/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p2vfmu", "author": "eghoostly", "handle": "eghoostly", "created_utc": 1763721785.0, "text": "Keep talking, keep selling, i need bitcoin cheaper, give me your money \nThe reason I’m staying fully invested and even adding to my position is that Bitcoin is now at its most oversold level in history. I am firmly convinced that we are nowhere near the top of this cycle.\nThis entire week I’ve been watching the bloodbath unfold with a smile, marveling at how extreme and one-sided the selling has been. These are exactly the conditions that have historically marked major bottoms.\nI’m not just optimistic about this trade — I’m absolutely convinced we’re about to see one of the most explosive rebounds in Bitcoin’s history. This is the dip we’ve been waiting for. 🚀", "lang": null, "likes": 10, "replies": 9, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p2vfmu/keep_talking_keep_selling_i_need_bitcoin_cheaper/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p2un1y", "author": "Stock_Historian5617", "handle": "Stock_Historian5617", "created_utc": 1763718880.0, "text": "Bitcoin has become more volatile than memecoins Honestly what's going on with the market?\n\nMy 401jk is massively out performing my bitcoin. \n\nBtc is red, solana is red, xrp is red.\n\nWonder what the world's in for?", "lang": null, "likes": 0, "replies": 17, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p2un1y/bitcoin_has_become_more_volatile_than_memecoins/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p2u33z", "author": "Aldhyabi", "handle": "Aldhyabi", "created_utc": 1763716695.0, "text": "Bitcoin Next Halving is a real issue ( Critical ) It cannot be done and be bullish on the same time with current bitcoin \n\nhere is why :\n\n\nSome Bitcoiners must stop pushing the narrative into L2 Lightning and apps usecases \n\nWe have a real problem here for Bitcoin security and Fees, We must have a real usage in bitcoin On-chain\n\nMiners cannot afford the next having \n\nSome Chinese miners have already started shutdown and sell their hardware \n\n\nAll these issues are caused by censorship, Censorship can be easily done when they are physically known \n\nBitcoin software maintainers can also be censored easily regardless the current attempts to make it decentralized money with knots \n\nMiners are being impacted and they started   dumping their bitcoin \n\nBitcoin is not prepared for next halving \nSome miners already sold their hardware and bought ZEC , DASH , XNO \n\n\nXNO l is rising when Bitcoin was dumping \n\nsome started getting the idea of Why NANO \n\nNano can run with zero censorship because miners are  eliminated in NANO , There is no way bitcoin to be real money and bankers, govs watching it", "lang": null, "likes": 0, "replies": 23, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p2u33z/bitcoin_next_halving_is_a_real_issue_critical/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p2sfp5", "author": "Swiftvoyager1906", "handle": "Swiftvoyager1906", "created_utc": 1763710304.0, "text": "Bitcoin plunges below $86,000 as US jobs data dampens rate cut hopes", "lang": null, "likes": 17, "replies": 3, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p2sfp5/bitcoin_plunges_below_86000_as_us_jobs_data/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p2cee0", "author": "Red_rack13", "handle": "Red_rack13", "created_utc": 1763666621.0, "text": "Has Bitcoin officially entered the Bear Market? Judging by the current price action and market sentiment, it looks like the cycle top is behind us. The structure is looking increasingly bearish.\n\n\n\nFor those still waiting for a massive V-shaped recovery immediately, you might be in for a disappointment. In my opinion, we are heading into a long period of consolidation.\n\n\n\nAre you guys still holding, or have you taken profits and exited?", "lang": null, "likes": 59, "replies": 64, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p2cee0/has_bitcoin_officially_entered_the_bear_market/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p2bze1", "author": "Old_Neighborhood1872", "handle": "Old_Neighborhood1872", "created_utc": 1763665676.0, "text": "Bitcoin keeps going down soon It'll be a good way to buy it for cheap Bitcoin keeps going down, soon It'll be a good way to buy it for really cheap and It'll start going to the moon back and it'll reach the new hights. Buy it for cheap now or wait for it to get even lower. The circle is reapating itself again.", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p2bze1/bitcoin_keeps_going_down_soon_itll_be_a_good_way/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p299un", "author": "irpx235", "handle": "irpx235", "created_utc": 1763659756.0, "text": "Why the number of Bitcoins is 21 million? Is it because the programmer who created Bitcoin, in his code, had a variable like \"no_of_units\", and he thought to himself like... aaa let's just put: \n\n&lt;initial code&gt;\nno_of_units = 21,000,000\n......\n&lt; the rest of the code&gt; \n\nIs this the reason why the BTC people are proudly saying it's not inflationey because there's only 21 million of those?\n\nDid the developer have the choice to put like any random long or short integer as the \"no_of_units\", and for some reason he/ she decided to use 21 million?\n\nNot taking the piss, I'm genuinely curious and trying to understand.", "lang": null, "likes": 0, "replies": 7, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p299un/why_the_number_of_bitcoins_is_21_million/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p1ztaq", "author": "sylsau", "handle": "sylsau", "created_utc": 1763634649.0, "text": "The Forest and the Trees: Why $100K Bitcoin is a Rounding Error. The “trees” are the daily price action, the regulatory headlines, the Twitter arguments, and the quarterly market cycles. The “Forest” is the larger, undeniable, tectonic-level reality.", "lang": null, "likes": 0, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p1ztaq/the_forest_and_the_trees_why_100k_bitcoin_is_a/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p1tj23", "author": "tornavec", "handle": "tornavec", "created_utc": 1763611730.0, "text": "Buterin Warns: Bitcoin &amp; Ethereum Could Die by the End of Trump’s Term Vitalik Buterin has made a radical change to his forecast for the security of cryptocurrencies. Speaking at the Devcon conference, he claimed that Bitcoin and Ethereum could be susceptible to hacking within the next four years, by which time the next US presidential election will have taken place.\n\nThe main threat comes from quantum computers. While he previously considered their emergence to be a distant prospect comparable to thermonuclear fusion, he is now calling for urgent action. The current encryption standard (ECC), on which almost the entire blockchain is based, may be compromised by new capabilities. The Ethereum founder insists that the industry must transition immediately to quantum-resistant cryptography.", "lang": null, "likes": 633, "replies": 285, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p1tj23/buterin_warns_bitcoin_ethereum_could_die_by_the/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p1sobx", "author": "Swiftvoyager1906", "handle": "Swiftvoyager1906", "created_utc": 1763609164.0, "text": "Crypto world wipes out US$1 trillion as Bitcoin plunges anew", "lang": null, "likes": 30, "replies": 11, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p1sobx/crypto_world_wipes_out_us1_trillion_as_bitcoin/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p1sng7", "author": "guyletibro", "handle": "guyletibro", "created_utc": 1763609085.0, "text": "Arthur Hayes, co-founder of BitMEX, has just published Snow Forecast, an essay on recent Bitcoin movements and what could trigger the next bullish phase. According to him, the fall in $BTC is not linked to headlines, politics, or ETFs, but to liquidity: the dollar is becoming scarce, and the market is beginning to feel it. ETF flows have created an illusion of institutional demand, but once these flows dissipate, Bitcoin reflects true liquidity conditions.\n\nWithout new liquidity injections from the Treasury or the Fed, the crypto market could freeze, pushing $BTC towards $80,000–$85,000.\n\nBut if monetary easing resumes, whether in the US or China, the bull run could restart very quickly. Otherwise, we could see one last correction before takeoff.\n\nYou can use Bitget's GetAgent to set up your strategies and conduct in-depth research on Bitcoin.", "lang": null, "likes": 0, "replies": 10, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p1sng7/arthur_hayes_cofounder_of_bitmex_has_just/", "subreddit": "CryptoMarkets"}
{"platform": "reddit", "post_id": "1p1phf1", "author": "LavishlyRitzyy", "handle": "LavishlyRitzyy", "created_utc": 1763600234.0, "text": "Can New NVDA 57B Revenue Spark recovery In spite Analyst Warning Bitcoin Could Drop Below $75,000 Bitcoin faces technical deterioration that could lead to a decline below $75,000, according to analyst Przemyslaw K. Radomski. The analyst has been shorting Bitcoin since it traded around $104,000 and warns the asset is in “deep, technical trouble.”\n\nWill NVDA news have any effect on the market?", "lang": null, "likes": 1, "replies": 1, "shares": null, "url": "https://www.reddit.com/r/CryptoMarkets/comments/1p1phf1/can_new_nvda_57b_revenue_spark_recovery_in_spite/", "subreddit": "CryptoMarkets"}
